{"input": ["David Drops the Weight"], "output": ["David noticed he had put on a lot of weight recently.", "He examined his habits to try and figure out the reason.", "He realized he'd been eating too much fast food lately.", "He stopped going to burger places and started a vegetarian diet.", "After a few weeks, he started to feel much better."], "src": "David Drops the Weight", "trg": "David noticed he had put on a lot of weight recently. He examined his habits to try and figure out the reason. He realized he'd been eating too much fast food lately. He stopped going to burger places and started a vegetarian diet. After a few weeks, he started to feel much better."}
{"input": ["Frustration"], "output": ["Tom had a very short temper.", "One day a guest made him very angry.", "He punched a hole in the wall of his house.", "Tom's guest became afraid and left quickly.", "Tom sat on his couch filled with regret about his actions."], "src": "Frustration", "trg": "Tom had a very short temper. One day a guest made him very angry. He punched a hole in the wall of his house. Tom's guest became afraid and left quickly. Tom sat on his couch filled with regret about his actions."}
{"input": ["Marcus Buys Khakis"], "output": ["Marcus needed clothing for a business casual event.", "All of his clothes were either too formal or too casual.", "He decided to buy a pair of khakis.", "The pair he bought fit him perfectly.", "Marcus was happy to have the right clothes for the event."], "src": "Marcus Buys Khakis", "trg": "Marcus needed clothing for a business casual event. All of his clothes were either too formal or too casual. He decided to buy a pair of khakis. The pair he bought fit him perfectly. Marcus was happy to have the right clothes for the event."}
{"input": ["Different Opinions"], "output": ["Bobby thought Bill should buy a trailer and haul it with his car.", "Bill thought a truck would be better for what he needed.", "Bobby pointed out two vehicles were much more expensive.", "Bill was set in his ways with conventional thinking.", "He ended up buying the truck he wanted despite Bobby's advice."], "src": "Different Opinions", "trg": "Bobby thought Bill should buy a trailer and haul it with his car. Bill thought a truck would be better for what he needed. Bobby pointed out two vehicles were much more expensive. Bill was set in his ways with conventional thinking. He ended up buying the truck he wanted despite Bobby's advice."}
{"input": ["Overcoming shortcomings"], "output": ["John was a pastor with a very bad memory.", "He tried to memorize his sermons many days in advance but to no avail.", "He decided to learn to sing to overcome his handicap.", "He then made all his sermons into music and sang them on Sundays.", "His congregation was delighted and so was he."], "src": "Overcoming shortcomings", "trg": "John was a pastor with a very bad memory. He tried to memorize his sermons many days in advance but to no avail. He decided to learn to sing to overcome his handicap. He then made all his sermons into music and sang them on Sundays. His congregation was delighted and so was he."}
{"input": ["Melody's trip to the aquarium."], "output": ["Melody's parents surprised her with a trip to the big aquarium.", "Melody took a nap during the two hour car ride to the aquarium.", "When they arrived, Melody was energetic and excited.", "At the aquarium Melody saw sharks, tropical fish and many others.", "After five hours at the aquarium, Melody and her family drove home."], "src": "Melody's trip to the aquarium.", "trg": "Melody's parents surprised her with a trip to the big aquarium. Melody took a nap during the two hour car ride to the aquarium. When they arrived, Melody was energetic and excited. At the aquarium Melody saw sharks, tropical fish and many others. After five hours at the aquarium, Melody and her family drove home."}
{"input": ["Pop Quiz"], "output": ["The math teacher announced a pop quiz as class began.", "While some students complained, he began passing out the quiz.", "I took out my pencil and began to work.", "About 5 minutes later, I finished.", "I stood up feeling confident and turned it in."], "src": "Pop Quiz", "trg": "The math teacher announced a pop quiz as class began. While some students complained, he began passing out the quiz. I took out my pencil and began to work. About 5 minutes later, I finished. I stood up feeling confident and turned it in."}
{"input": ["My first girlfriend"], "output": ["My first girlfriend i met on the internet.", "She lives about 4 hours away from me.", "Finally after 2 years we met each other.", "She stayed with me for a week or two.", "We decided we couldn't be apart so she moved in with me."], "src": "My first girlfriend", "trg": "My first girlfriend i met on the internet. She lives about 4 hours away from me. Finally after 2 years we met each other. She stayed with me for a week or two. We decided we couldn't be apart so she moved in with me."}
{"input": ["Charlie Horse"], "output": ["I got Charlie Horse when I was four years old.", "He's a brown stuffed horse, and at 35 I still sleep with him at night.", "He was my best friend, and always laid at the head of my bed.", "I laid him next to me, smelling his soft fur every night.", "I liked to listen to my radio as I fell asleep cuddling him."], "src": "Charlie Horse", "trg": "I got Charlie Horse when I was four years old. He's a brown stuffed horse, and at 35 I still sleep with him at night. He was my best friend, and always laid at the head of my bed. I laid him next to me, smelling his soft fur every night. I liked to listen to my radio as I fell asleep cuddling him."}
{"input": ["Corn"], "output": ["Laura loved corn.", "So she decided to grow some in her backyard.", "The whole process of growing them made her very excited.", "But she realized that they required too much water.", "So Laura quickly abandoned her corn garden idea."], "src": "Corn", "trg": "Laura loved corn. So she decided to grow some in her backyard. The whole process of growing them made her very excited. But she realized that they required too much water. So Laura quickly abandoned her corn garden idea."}
{"input": ["New Hair Color"], "output": ["Andy was invited to a Halloween party.", "Andy figured that for dramatic effect, he should color his hair.", "Since Andy's costume was green, Andy decided on that color.", "After the stylist finished the coloring, Andy regretted it.", "Andy was disappointed with his new, bold, green hair color."], "src": "New Hair Color", "trg": "Andy was invited to a Halloween party. Andy figured that for dramatic effect, he should color his hair. Since Andy's costume was green, Andy decided on that color. After the stylist finished the coloring, Andy regretted it. Andy was disappointed with his new, bold, green hair color."}
{"input": ["Winner"], "output": ["Luke was playing hockey at school.", "The game was tied and almost over.", "Then Luke made the winning shot!", "Everybody cheered!", "Luke was so proud of himself!"], "src": "Winner", "trg": "Luke was playing hockey at school. The game was tied and almost over. Then Luke made the winning shot! Everybody cheered! Luke was so proud of himself!"}
{"input": ["Cross country"], "output": ["Robbie was competing in a cross country meet.", "He was halfway through when his leg cramped up.", "Robbie wasn't sure he could go on.", "He stopped for a minute and stretched his bad leg.", "Robbie began to run again and finished the race in second place."], "src": "Cross country", "trg": "Robbie was competing in a cross country meet. He was halfway through when his leg cramped up. Robbie wasn't sure he could go on. He stopped for a minute and stretched his bad leg. Robbie began to run again and finished the race in second place."}
{"input": ["Traffic Troubles"], "output": ["Jude was very excited about his college graduation ceremony.", "On the way to the arena, he got stuck in traffic.", "He only had an hour before the ceremony started.", "He thought he wasn't going to be able to make it in time.", "Luckily, the traffic cleared up in time for him to get to the ceremony."], "src": "Traffic Troubles", "trg": "Jude was very excited about his college graduation ceremony. On the way to the arena, he got stuck in traffic. He only had an hour before the ceremony started. He thought he wasn't going to be able to make it in time. Luckily, the traffic cleared up in time for him to get to the ceremony."}
{"input": ["Not Santa"], "output": ["Beth sent a letter to Santa Claus.", "She received a letter back in the mail.", "Beth did not think that it sounded like the real Santa.", "She sent another letter calling that Santa a fake.", "She did not receive another letter back in the mail."], "src": "Not Santa", "trg": "Beth sent a letter to Santa Claus. She received a letter back in the mail. Beth did not think that it sounded like the real Santa. She sent another letter calling that Santa a fake. She did not receive another letter back in the mail."}
{"input": ["Miss Fussy"], "output": ["Our granddaughter Anna is very fussy about her clothes.", "She is only two, but wants to pick her outfits.", "Today her mom wanted Anna to wear a dress.", "Anna started crying.", "They let her wear a t-shirt and shorts instead."], "src": "Miss Fussy", "trg": "Our granddaughter Anna is very fussy about her clothes. She is only two, but wants to pick her outfits. Today her mom wanted Anna to wear a dress. Anna started crying. They let her wear a t-shirt and shorts instead."}
{"input": ["Getting to the Store"], "output": ["Jake needed a ride to the store.", "His girlfriend was working and wouldn't take him.", "His brother was in the middle of a movie and said no.", "Jake decided to take the bus to the store.", "He got what he needed all by himself."], "src": "Getting to the Store", "trg": "Jake needed a ride to the store. His girlfriend was working and wouldn't take him. His brother was in the middle of a movie and said no. Jake decided to take the bus to the store. He got what he needed all by himself."}
{"input": ["The Sale"], "output": ["I'd been looking for a stand for my TV.", "I looked everywhere, but the ones I saw were expensive.", "I happened upon a yard sale on my way home.", "She had a stand that was perfect, and cheap.", "It looks great in my den."], "src": "The Sale", "trg": "I'd been looking for a stand for my TV. I looked everywhere, but the ones I saw were expensive. I happened upon a yard sale on my way home. She had a stand that was perfect, and cheap. It looks great in my den."}
{"input": ["Prescription"], "output": ["Sally had a root canal this morning, as she had a damaged root.", "After the procedure, the dentist wrote her a prescription.", "She headed straight to the pharmacy to fill her medication.", "She handed the prescription to the technician and waited patiently.", "The technician called her name and she paid for the prescription."], "src": "Prescription", "trg": "Sally had a root canal this morning, as she had a damaged root. After the procedure, the dentist wrote her a prescription. She headed straight to the pharmacy to fill her medication. She handed the prescription to the technician and waited patiently. The technician called her name and she paid for the prescription."}
{"input": ["Storm"], "output": ["My dog is terrified of thunder.", "There was a storm today.", "He came running into my office.", "He hid in the kneehole of my desk, trembling.", "Once the storm was over, he acted like a brave dog again."], "src": "Storm", "trg": "My dog is terrified of thunder. There was a storm today. He came running into my office. He hid in the kneehole of my desk, trembling. Once the storm was over, he acted like a brave dog again."}
{"input": ["Children's Show"], "output": ["Mark and Jo were brainstorming ideas for a children's show.", "Mark suggested that a monster attacks the children.", "Jo laughed because he thought Mark was joking.", "Mark was confused because he thought it was a great idea.", "Mark left in a huff for having his ideas mocked."], "src": "Children's Show", "trg": "Mark and Jo were brainstorming ideas for a children's show. Mark suggested that a monster attacks the children. Jo laughed because he thought Mark was joking. Mark was confused because he thought it was a great idea. Mark left in a huff for having his ideas mocked."}
{"input": ["Parade Float"], "output": ["Ben's Boy Scout Troop worked for weeks on a float.", "It was going to be in the town's July 4th parade.", "They got it finished just in time.", "It was big enough for his whole troop to ride on.", "They felt proud as they went down the street as people clapped."], "src": "Parade Float", "trg": "Ben's Boy Scout Troop worked for weeks on a float. It was going to be in the town's July 4th parade. They got it finished just in time. It was big enough for his whole troop to ride on. They felt proud as they went down the street as people clapped."}
{"input": ["Francis Ties a Tie"], "output": ["Francis has always wanted to learn how to tie a necktie.", "He decides to practice until he can tie one.", "At first he finds it very difficult.", "But eventually he is able to tie a necktie very well.", "Francis is proud of himself for learning how to tie a necktie."], "src": "Francis Ties a Tie", "trg": "Francis has always wanted to learn how to tie a necktie. He decides to practice until he can tie one. At first he finds it very difficult. But eventually he is able to tie a necktie very well. Francis is proud of himself for learning how to tie a necktie."}
{"input": ["Stepmother"], "output": ["Eric and his wife had a daughter named Meg.", "Eric's wife passed away.", "Eric and Meg were very sad.", "Eric met a woman and married her 5 years after his wife died.", "Meg is now happy with her new stepmother."], "src": "Stepmother", "trg": "Eric and his wife had a daughter named Meg. Eric's wife passed away. Eric and Meg were very sad. Eric met a woman and married her 5 years after his wife died. Meg is now happy with her new stepmother."}
{"input": ["Foreign Food"], "output": ["My cousin took me to a local restaurant.", "We ordered a large pizza.", "Since she never tasted the food there, she didn't know if it was good.", "I began to start sneezing.", "To make matters worse, I caught an allergy."], "src": "Foreign Food", "trg": "My cousin took me to a local restaurant. We ordered a large pizza. Since she never tasted the food there, she didn't know if it was good. I began to start sneezing. To make matters worse, I caught an allergy."}
{"input": ["My Diagnosis"], "output": ["When I was 12 years old, my dad got angry and kicked me aggressively.", "Afterward, I became very ill, and tasted something metallic.", "I went to a doctor, and was informed that one of my kidneys was dead.", "Ever since, I've had swelling and hypertension.", "I started taking medications to combat the symptoms at 13."], "src": "My Diagnosis", "trg": "When I was 12 years old, my dad got angry and kicked me aggressively. Afterward, I became very ill, and tasted something metallic. I went to a doctor, and was informed that one of my kidneys was dead. Ever since, I've had swelling and hypertension. I started taking medications to combat the symptoms at 13."}
{"input": ["Fred Wears Sandals"], "output": ["Fred noticed that he feet got very hot in the summer.", "He decided he needed new footwear.", "Fred invested in a nice new pair of sandals.", "He loved wearing his new sandals.", "Fred was glad that his feet no longer got hot in the summer."], "src": "Fred Wears Sandals", "trg": "Fred noticed that he feet got very hot in the summer. He decided he needed new footwear. Fred invested in a nice new pair of sandals. He loved wearing his new sandals. Fred was glad that his feet no longer got hot in the summer."}
{"input": ["Maine"], "output": ["Last year I took a day trip to see a friend in Maine.", "I took the Amtrak from Boston to Saco, Maine.", "We had lunch at Gritty's in Portland.", "My friend drove me back to the train station.", "I had a nice time and will visit my friend this year."], "src": "Maine", "trg": "Last year I took a day trip to see a friend in Maine. I took the Amtrak from Boston to Saco, Maine. We had lunch at Gritty's in Portland. My friend drove me back to the train station. I had a nice time and will visit my friend this year."}
{"input": ["Heather cooks Tacos for the first time."], "output": ["Heather and her family really wanted tacos for dinner.", "Two of the children wanted chicken tacos.", "The other two children wanted beef.", "Heather took great care preparing all the tacos that each wanted.", "Everyone sat down at dinner and enjoyed eating the tacos together."], "src": "Heather cooks Tacos for the first time.", "trg": "Heather and her family really wanted tacos for dinner. Two of the children wanted chicken tacos. The other two children wanted beef. Heather took great care preparing all the tacos that each wanted. Everyone sat down at dinner and enjoyed eating the tacos together."}
{"input": ["Suet"], "output": ["Anna was filling her bird feeders.", "But a chunk of suet fell onto the ground.", "Her dog rushed over and lapped it up!", "Anna was astonished.", "She had no idea dogs loved bird food!"], "src": "Suet", "trg": "Anna was filling her bird feeders. But a chunk of suet fell onto the ground. Her dog rushed over and lapped it up! Anna was astonished. She had no idea dogs loved bird food!"}
{"input": ["No Connection"], "output": ["James had an Xbox 360.", "His friends had Xbox accounts online.", "James registered, but was still unable to connect online.", "He called for tech support, but they couldn't help either.", "He realized he would need a new Xbox."], "src": "No Connection", "trg": "James had an Xbox 360. His friends had Xbox accounts online. James registered, but was still unable to connect online. He called for tech support, but they couldn't help either. He realized he would need a new Xbox."}
{"input": ["The Protest"], "output": ["The people gathered to protest the court's ruling last week.", "They held signs and chanted loudly.", "The police stormed in and arrested them all.", "Now there are more protests in surrounding towns.", "The movement is gaining momentum!"], "src": "The Protest", "trg": "The people gathered to protest the court's ruling last week. They held signs and chanted loudly. The police stormed in and arrested them all. Now there are more protests in surrounding towns. The movement is gaining momentum!"}
{"input": ["Big Box"], "output": ["My roommate and I bought a new futon for our living room.", "The futon came in a huge box.", "We set the box out on the curb to be picked up on trash day.", "Much to our chagrin, the garbage men left the box on the curb.", "We had to take the box to the dump ourselves."], "src": "Big Box", "trg": "My roommate and I bought a new futon for our living room. The futon came in a huge box. We set the box out on the curb to be picked up on trash day. Much to our chagrin, the garbage men left the box on the curb. We had to take the box to the dump ourselves."}
{"input": ["Pot of Gold"], "output": ["Bob chased after the rainbow through the fields.", "He ran after it over forests and streams.", "Bob thought he'd lost it behind a boulder.", "He found it waiting for him on the other side.", "When Bob dived for the pot of gold, he woke up."], "src": "Pot of Gold", "trg": "Bob chased after the rainbow through the fields. He ran after it over forests and streams. Bob thought he'd lost it behind a boulder. He found it waiting for him on the other side. When Bob dived for the pot of gold, he woke up."}
{"input": ["One Way to Paris"], "output": ["Soren ran through the airport, pulling her bags behind her.", "The female voice above her announced final boarding to Soren's fligh.", "She yelled for them to wait as she neared her gate, waving her arms.", "The attendant at the desk gave Soren a sad, sympathetic look.", "Nearly out of breath, Soren presented her pass and boarded the plane."], "src": "One Way to Paris", "trg": "Soren ran through the airport, pulling her bags behind her. The female voice above her announced final boarding to Soren's fligh. She yelled for them to wait as she neared her gate, waving her arms. The attendant at the desk gave Soren a sad, sympathetic look. Nearly out of breath, Soren presented her pass and boarded the plane."}
{"input": ["Charles Graduates"], "output": ["Charles had always wanted to have a college degree.", "He worked hard for many years to complete his courses.", "Finally he turned in his last college essay.", "All of his family attended his college graduation.", "Charles was proud that he had a college degree."], "src": "Charles Graduates", "trg": "Charles had always wanted to have a college degree. He worked hard for many years to complete his courses. Finally he turned in his last college essay. All of his family attended his college graduation. Charles was proud that he had a college degree."}
{"input": ["Stacy Changes Her Mind"], "output": ["Stacy originally thought she wanted five kids.", "She and Bob first were blessed with a daughter.", "Two years later, they had twin girls.", "Now, Stacy is selling all her maternity and baby clothes.", "She says she has changed her mind about wanting five kids!"], "src": "Stacy Changes Her Mind", "trg": "Stacy originally thought she wanted five kids. She and Bob first were blessed with a daughter. Two years later, they had twin girls. Now, Stacy is selling all her maternity and baby clothes. She says she has changed her mind about wanting five kids!"}
{"input": ["Lance wins"], "output": ["Lance was going to make a bet.", "He was thinking of making it a big one.", "He was going to bet all of his savings on a Race.", "The day of the Race is here.", "Lance crosses the finish line and Wins it all!"], "src": "Lance wins", "trg": "Lance was going to make a bet. He was thinking of making it a big one. He was going to bet all of his savings on a Race. The day of the Race is here. Lance crosses the finish line and Wins it all!"}
{"input": ["Office Party"], "output": ["Larry worked at an accounting firm.", "It was a boring job but it paid the bills.", "Larry grew tired of doing the same thing every day.", "He had the idea to have an office party.", "By lunch the whole office had passed out and nothing got done."], "src": "Office Party", "trg": "Larry worked at an accounting firm. It was a boring job but it paid the bills. Larry grew tired of doing the same thing every day. He had the idea to have an office party. By lunch the whole office had passed out and nothing got done."}
{"input": ["Swimmer"], "output": ["Ava was six years old.", "She wanted to learn to swim.", "Her mom took her to the pool.", "There, she patiently taught Ava the basics.", "Soon Ava was paddling all by herself!"], "src": "Swimmer", "trg": "Ava was six years old. She wanted to learn to swim. Her mom took her to the pool. There, she patiently taught Ava the basics. Soon Ava was paddling all by herself!"}
{"input": ["The missing wallet"], "output": ["James was walking down a street one afternoon.", "He noticed a wallet lying on the ground.", "He decided to bring it to the police station.", "That evening, the phone rang.", "The old man had called to thank James for returning his wallet."], "src": "The missing wallet", "trg": "James was walking down a street one afternoon. He noticed a wallet lying on the ground. He decided to bring it to the police station. That evening, the phone rang. The old man had called to thank James for returning his wallet."}
{"input": ["Dog's Behavior"], "output": ["Chad's dog would always jump on people.", "Chad couldn't bring his dog anywhere.", "Chad decided to hire a dog trainer.", "The trainer taught the dog how to behave.", "Chad was proud to finally show off his dog to others."], "src": "Dog's Behavior", "trg": "Chad's dog would always jump on people. Chad couldn't bring his dog anywhere. Chad decided to hire a dog trainer. The trainer taught the dog how to behave. Chad was proud to finally show off his dog to others."}
{"input": ["Sliding Into Second"], "output": ["Karl was a good baseball player in his youth.", "As a middle-aged man, he joined an adult baseball team.", "Karl is very competitive and will do anything to win.", "One day, he slid into second base to beat a throw and hurt his knee.", "The injury made Karl realize that he wasn't young anymore."], "src": "Sliding Into Second", "trg": "Karl was a good baseball player in his youth. As a middle-aged man, he joined an adult baseball team. Karl is very competitive and will do anything to win. One day, he slid into second base to beat a throw and hurt his knee. The injury made Karl realize that he wasn't young anymore."}
{"input": ["The Roommate"], "output": ["Nick was trying to buy a house.", "He lived with a roommate that he couldn't trust.", "His stuff always ended up missing from his bedroom.", "He knew it had to be Nick so he decided he would move out.", "He found a place and moved out as fast as he could."], "src": "The Roommate", "trg": "Nick was trying to buy a house. He lived with a roommate that he couldn't trust. His stuff always ended up missing from his bedroom. He knew it had to be Nick so he decided he would move out. He found a place and moved out as fast as he could."}
{"input": ["Fat Goldfish"], "output": ["Jody bought a goldfish from the pet store.", "She noticed that the goldfish looked quite fat.", "Her mom told her that the goldfish had too much to eat.", "Jody adjusted her pet's diet.", "The goldfish got skinnier and healthier."], "src": "Fat Goldfish", "trg": "Jody bought a goldfish from the pet store. She noticed that the goldfish looked quite fat. Her mom told her that the goldfish had too much to eat. Jody adjusted her pet's diet. The goldfish got skinnier and healthier."}
{"input": ["Jane's New Job"], "output": ["Jane had recently gotten a new job.", "She was nervous about her first day of work.", "On the first day of work, Jane overslept.", "Jane arrived at work an hour late.", "Jane did not make a good impression at her new job."], "src": "Jane's New Job", "trg": "Jane had recently gotten a new job. She was nervous about her first day of work. On the first day of work, Jane overslept. Jane arrived at work an hour late. Jane did not make a good impression at her new job."}
{"input": ["The Amazon"], "output": ["Jill was going on a trip to the amazon.", "She arrived after a flight from the US.", "Once there she marveled at all the beauty.", "It was dangerous, but exciting.", "Jill had a wonderful time on her trip to the Amazon."], "src": "The Amazon", "trg": "Jill was going on a trip to the amazon. She arrived after a flight from the US. Once there she marveled at all the beauty. It was dangerous, but exciting. Jill had a wonderful time on her trip to the Amazon."}
{"input": ["Chris the Lawyer"], "output": ["Chris is a defense attorney.", "He has a client that he must defend in court.", "The client is not guilty.", "Chris does his best to defend his client during his trial.", "Chris wins the case and the client goes free."], "src": "Chris the Lawyer", "trg": "Chris is a defense attorney. He has a client that he must defend in court. The client is not guilty. Chris does his best to defend his client during his trial. Chris wins the case and the client goes free."}
{"input": ["Julie's Bad pizza"], "output": ["Julie was feeling hungry.", "She thought she would order some Pizza.", "Julie order the food through an online website.", "The pizza arrived and Julie tipped the driver.", "Julie went to take a bite of the pizza and it was burnt!"], "src": "Julie's Bad pizza", "trg": "Julie was feeling hungry. She thought she would order some Pizza. Julie order the food through an online website. The pizza arrived and Julie tipped the driver. Julie went to take a bite of the pizza and it was burnt!"}
{"input": ["Fear of Dogs"], "output": ["Justin was terrified of dogs.", "His girlfriend had a dog and he wanted to feel comfortable with it.", "Justin went to therapy to help him get over his fear.", "After a few months of therapy Justin felt better around dogs.", "Justin then moved in with his girlfriend and her dog."], "src": "Fear of Dogs", "trg": "Justin was terrified of dogs. His girlfriend had a dog and he wanted to feel comfortable with it. Justin went to therapy to help him get over his fear. After a few months of therapy Justin felt better around dogs. Justin then moved in with his girlfriend and her dog."}
{"input": ["Falling down"], "output": ["David was walking down the street when he felt down.", "He stood up and saw that his knee was bleeding.", "He found a handkerchief in his pants and applied it to the wound.", "He hopped to the nearest pharmacy stifling his pain.", "He then bought some peroxide and bandages to treat his knee."], "src": "Falling down", "trg": "David was walking down the street when he felt down. He stood up and saw that his knee was bleeding. He found a handkerchief in his pants and applied it to the wound. He hopped to the nearest pharmacy stifling his pain. He then bought some peroxide and bandages to treat his knee."}
{"input": ["Concert"], "output": ["Nicole wanted to go to a concert in another city.", "Unfortunately, Nicole could not drive.", "She asked her cousin to take her to the concert.", "Her cousin agreed to drive if Naomi bought the tickets.", "They went to the concert and had a great time."], "src": "Concert", "trg": "Nicole wanted to go to a concert in another city. Unfortunately, Nicole could not drive. She asked her cousin to take her to the concert. Her cousin agreed to drive if Naomi bought the tickets. They went to the concert and had a great time."}
{"input": ["Scare"], "output": ["I woke from my sleep at around three in the morning.", "I heard a scratching sound coming from inside my closet.", "I turned the light on beside my bed to investigate.", "I crept slowly toward the closet.", "My little brother jumped out of the closet, scaring me to death."], "src": "Scare", "trg": "I woke from my sleep at around three in the morning. I heard a scratching sound coming from inside my closet. I turned the light on beside my bed to investigate. I crept slowly toward the closet. My little brother jumped out of the closet, scaring me to death."}
{"input": ["Warm Beer"], "output": ["Ken put a bottle of beer in the freezer.", "He heard a popping noise.", "He looked in the freezer and saw the bottle had burst.", "He didn't want to wait for another beer to get cold.", "He drank a warm beer instead."], "src": "Warm Beer", "trg": "Ken put a bottle of beer in the freezer. He heard a popping noise. He looked in the freezer and saw the bottle had burst. He didn't want to wait for another beer to get cold. He drank a warm beer instead."}
{"input": ["Christmas Day"], "output": ["Christmas was Tyler's favorite holiday.", "On Christmas morning he ran downstairs to the tree.", "Tyler saw so many presents and could not wait to open them.", "By the time his parents woke up, Tyler had opened all his presents!", "Tyler showed his parents everything Santa Claus gave him."], "src": "Christmas Day", "trg": "Christmas was Tyler's favorite holiday. On Christmas morning he ran downstairs to the tree. Tyler saw so many presents and could not wait to open them. By the time his parents woke up, Tyler had opened all his presents! Tyler showed his parents everything Santa Claus gave him."}
{"input": ["Wendy loses her cool"], "output": ["Wendy was working at her local fast food establishment.", "She pretty much hated her Job.", "Wendy was having a rough day and her employees were annoying her.", "The cook decided to defy her orders when she said go clean the trash.", "Wendy flew off the handle and fired him on the spot."], "src": "Wendy loses her cool", "trg": "Wendy was working at her local fast food establishment. She pretty much hated her Job. Wendy was having a rough day and her employees were annoying her. The cook decided to defy her orders when she said go clean the trash. Wendy flew off the handle and fired him on the spot."}
{"input": ["Dog's Bite"], "output": ["Walter was worried because his dog was showing a lot of aggression.", "The dog recently began snapping at other dogs and even people.", "Walter consulted with his veterinarian.", "The vet discovered that the dog was suffering a flea infestation.", "Some medication got rid of the fleas and the dog's bad mood, too."], "src": "Dog's Bite", "trg": "Walter was worried because his dog was showing a lot of aggression. The dog recently began snapping at other dogs and even people. Walter consulted with his veterinarian. The vet discovered that the dog was suffering a flea infestation. Some medication got rid of the fleas and the dog's bad mood, too."}
{"input": ["The Lake"], "output": ["The couple took a romantic trip to the lake.", "They stayed in a nice cabin by the water.", "They went boating and relaxed in the hammock.", "They were happy to reconnect with each other.", "When they returned home, they decided to buy a lake house."], "src": "The Lake", "trg": "The couple took a romantic trip to the lake. They stayed in a nice cabin by the water. They went boating and relaxed in the hammock. They were happy to reconnect with each other. When they returned home, they decided to buy a lake house."}
{"input": ["Universal Studios"], "output": ["The family planned their first trip to Universal Studios.", "They were excited to go on all the rides.", "They saw a lot of the characters.", "They spent three days in the park.", "They were sad to come home."], "src": "Universal Studios", "trg": "The family planned their first trip to Universal Studios. They were excited to go on all the rides. They saw a lot of the characters. They spent three days in the park. They were sad to come home."}
{"input": ["Ketchup on fries"], "output": ["I went to a restaurant.", "I ordered fries.", "They put ketchup on the fries.", "I was furious at the awful site.", "After complaining, I was given delicious, ketchup free fries."], "src": "Ketchup on fries", "trg": "I went to a restaurant. I ordered fries. They put ketchup on the fries. I was furious at the awful site. After complaining, I was given delicious, ketchup free fries."}
{"input": ["The Craft"], "output": ["The woman decided to start a new hobby.", "She went to the craft store and picked out some supplies.", "She went home and created an amazing masterpiece.", "She was very proud of her work.", "She displayed it in her kitchen."], "src": "The Craft", "trg": "The woman decided to start a new hobby. She went to the craft store and picked out some supplies. She went home and created an amazing masterpiece. She was very proud of her work. She displayed it in her kitchen."}
{"input": ["James Plays Football"], "output": ["James had always wanted to try out for a sport at his school.", "He decided he would try out for football.", "James exercised every day to be ready to try out.", "After trying out, James was accepted onto the team.", "James was glad to be playing a sport at school."], "src": "James Plays Football", "trg": "James had always wanted to try out for a sport at his school. He decided he would try out for football. James exercised every day to be ready to try out. After trying out, James was accepted onto the team. James was glad to be playing a sport at school."}
{"input": ["Race"], "output": ["Josie wanted to win an important race at school.", "She woke up early for a week to practice in the park.", "She also hired a coach to train with him after school.", "When the race event started she was really nervous.", "But all her hard work paid off and she made it to third place easily."], "src": "Race", "trg": "Josie wanted to win an important race at school. She woke up early for a week to practice in the park. She also hired a coach to train with him after school. When the race event started she was really nervous. But all her hard work paid off and she made it to third place easily."}
{"input": ["Eggs From Above"], "output": ["Kayla parked her car in front of the convenience store.", "She got out of the car, and began to walk towards the store.", "Suddenly, she got hit in the head with an egg.", "She looked up and saw teenagers on top of the store.", "The teenagers ran away, and Kayla was left with an egg on her head."], "src": "Eggs From Above", "trg": "Kayla parked her car in front of the convenience store. She got out of the car, and began to walk towards the store. Suddenly, she got hit in the head with an egg. She looked up and saw teenagers on top of the store. The teenagers ran away, and Kayla was left with an egg on her head."}
{"input": ["The Patrol"], "output": ["A police officer got a new patrol route.", "He wasn't familiar with the neighborhood.", "He spent a lot of time familiarizing himself with the street names.", "SOon he got to know everyone in the neighborhood.", "He was beginning to feel at home."], "src": "The Patrol", "trg": "A police officer got a new patrol route. He wasn't familiar with the neighborhood. He spent a lot of time familiarizing himself with the street names. SOon he got to know everyone in the neighborhood. He was beginning to feel at home."}
{"input": ["The Thief"], "output": ["Mikey has a habit of taking items that don't belong to him.", "Last night he stole a trailer from Henry's yard.", "Henry has a camera in his yard and caught Mikey on tape.", "The cops were called and took Mikey to jail.", "Mikey is now sitting in a cell thinking about his actions."], "src": "The Thief", "trg": "Mikey has a habit of taking items that don't belong to him. Last night he stole a trailer from Henry's yard. Henry has a camera in his yard and caught Mikey on tape. The cops were called and took Mikey to jail. Mikey is now sitting in a cell thinking about his actions."}
{"input": ["Hunger"], "output": ["Roger was hungry.", "He checked the fridge.", "The fridge was empty.", "Roger went to the store.", "He came home with lots of food."], "src": "Hunger", "trg": "Roger was hungry. He checked the fridge. The fridge was empty. Roger went to the store. He came home with lots of food."}
{"input": ["Noah's Arches"], "output": ["Bob stared in disbelief at the flooded basement.", "All that could be seen were the stone arches above the doors.", "The plumber told him it flooded because the sump pump was off.", "Bob understood that was because the electricity had also been off.", "He enabled the electricity and the pump drained the flooded basement."], "src": "Noah's Arches", "trg": "Bob stared in disbelief at the flooded basement. All that could be seen were the stone arches above the doors. The plumber told him it flooded because the sump pump was off. Bob understood that was because the electricity had also been off. He enabled the electricity and the pump drained the flooded basement."}
{"input": ["Oscar Goes For A Run"], "output": ["Oscar decided that he no longer wanted to be out of shape.", "He decided to start running outside every day.", "At first he found it very difficult.", "However, over time, Oscar began to enjoy running.", "He was glad to be getting in shape."], "src": "Oscar Goes For A Run", "trg": "Oscar decided that he no longer wanted to be out of shape. He decided to start running outside every day. At first he found it very difficult. However, over time, Oscar began to enjoy running. He was glad to be getting in shape."}
{"input": ["Breast Cancer"], "output": ["Jill went to the doctor for her annual exam.", "A lump was found on her breast and she needed more testing.", "She went to a follow up appointment and it was confirmed as cancer.", "Jill went through several rounds of chemotherapy.", "Fortunately, she had no signs of cancer following her treatment."], "src": "Breast Cancer", "trg": "Jill went to the doctor for her annual exam. A lump was found on her breast and she needed more testing. She went to a follow up appointment and it was confirmed as cancer. Jill went through several rounds of chemotherapy. Fortunately, she had no signs of cancer following her treatment."}
{"input": ["homework"], "output": ["Jasmine had homework to do.", "She did not have a pencil.", "She looked around the room for one.", "The room did not have a pencil.", "Jasmine decided not to do her homework."], "src": "homework", "trg": "Jasmine had homework to do. She did not have a pencil. She looked around the room for one. The room did not have a pencil. Jasmine decided not to do her homework."}
{"input": ["Marc's Absence"], "output": ["Marc always had perfect attendance at school.", "One day, he stopped coming to class.", "Everyone was worried about him!", "He came back a few days later.", "He had been in bed with the flu."], "src": "Marc's Absence", "trg": "Marc always had perfect attendance at school. One day, he stopped coming to class. Everyone was worried about him! He came back a few days later. He had been in bed with the flu."}
{"input": ["Joe and Santa Claus"], "output": ["Joe was really excited for Christmas.", "Joe has never seen Santa Claus before.", "He decided to hide on top of the staircase to try to catch Santa.", "Joe waited as long as he could before he fell asleep.", "He woke up to many presents under the tree, and no Santa in sight!"], "src": "Joe and Santa Claus", "trg": "Joe was really excited for Christmas. Joe has never seen Santa Claus before. He decided to hide on top of the staircase to try to catch Santa. Joe waited as long as he could before he fell asleep. He woke up to many presents under the tree, and no Santa in sight!"}
{"input": ["Apples"], "output": ["Anna went to pick apples.", "She tried to pluck the low-hanging fruits.", "But she could reach very few.", "At the end of the trip, she had only ten apples.", "Anna wished she had been able to reach more apples!"], "src": "Apples", "trg": "Anna went to pick apples. She tried to pluck the low-hanging fruits. But she could reach very few. At the end of the trip, she had only ten apples. Anna wished she had been able to reach more apples!"}
{"input": ["Rubber Garden"], "output": ["Bob bought a new manufactured home in Montana.", "He was sad he didn't have any land to grow a garden on.", "One of his neighbors told him he could vegetables in tires.", "Bob tried it and was astounded when it worked.", "He's very proud of his tire grown tomatoes and corn."], "src": "Rubber Garden", "trg": "Bob bought a new manufactured home in Montana. He was sad he didn't have any land to grow a garden on. One of his neighbors told him he could vegetables in tires. Bob tried it and was astounded when it worked. He's very proud of his tire grown tomatoes and corn."}
{"input": ["The Poll"], "output": ["The candidates were running a tight campaign.", "The latest poll said they were tied.", "The Republican candidate focused on radio ads.", "The Democrat focused on TV.", "They fought for every vote they could grab."], "src": "The Poll", "trg": "The candidates were running a tight campaign. The latest poll said they were tied. The Republican candidate focused on radio ads. The Democrat focused on TV. They fought for every vote they could grab."}
{"input": ["Ballet Surprise"], "output": ["Johnnie got dragged to the ballet because his sister wanted to go.", "He was dreading how boring it would be.", "He was already bored when the lights were dimmed.", "Then when the dancers started he got into it.", "He was sad when it ended."], "src": "Ballet Surprise", "trg": "Johnnie got dragged to the ballet because his sister wanted to go. He was dreading how boring it would be. He was already bored when the lights were dimmed. Then when the dancers started he got into it. He was sad when it ended."}
{"input": ["Dan Runs A Marathon"], "output": ["Dan had always wanted to participate in a marathon.", "However he was scared that it would be very difficult.", "He decided to practice until he felt stronger.", "Finally he was prepared to participate in a marathon.", "Dan was glad that he was finally going to run a marathon."], "src": "Dan Runs A Marathon", "trg": "Dan had always wanted to participate in a marathon. However he was scared that it would be very difficult. He decided to practice until he felt stronger. Finally he was prepared to participate in a marathon. Dan was glad that he was finally going to run a marathon."}
{"input": ["I Told You So"], "output": ["Bill's wife, Carly, warned him that it would rain today.", "Bill disregarded this, and began mowing the lawn.", "Within minutes, rain began pouring down on Billy.", "Billy hurried to get the tools inside the shed and went in the house.", "Carly was there, giving Billy the look that says I told you so."], "src": "I Told You So", "trg": "Bill's wife, Carly, warned him that it would rain today. Bill disregarded this, and began mowing the lawn. Within minutes, rain began pouring down on Billy. Billy hurried to get the tools inside the shed and went in the house. Carly was there, giving Billy the look that says I told you so."}
{"input": ["Late Fee"], "output": ["Joe rented a movie from one of the last rental stores.", "He had it for five days so he was going to keep it that long.", "At the end of the fifth day he decided to take it back.", "The store closed early that night.", "Joe now has to pay a ten dollar late fee on a five dollar movie."], "src": "Late Fee", "trg": "Joe rented a movie from one of the last rental stores. He had it for five days so he was going to keep it that long. At the end of the fifth day he decided to take it back. The store closed early that night. Joe now has to pay a ten dollar late fee on a five dollar movie."}
{"input": ["The Puppies"], "output": ["Janet loved to pet her neighbor's dog.", "She was told the dog had puppies a few weeks ago.", "Janet was very excited to see them.", "She begged her parents to let her have a puppy.", "Janet was very happy when she walked back to her house with a puppy."], "src": "The Puppies", "trg": "Janet loved to pet her neighbor's dog. She was told the dog had puppies a few weeks ago. Janet was very excited to see them. She begged her parents to let her have a puppy. Janet was very happy when she walked back to her house with a puppy."}
{"input": ["Beanie Babies"], "output": ["When Shawn was growing up he collected beanie babies.", "He had hundreds of them.", "He was convinced that they would be worth a lot of money.", "He kept them for almost twenty years before realizing he was wrong.", "He is now just a grown man with hundreds of stuffed animals."], "src": "Beanie Babies", "trg": "When Shawn was growing up he collected beanie babies. He had hundreds of them. He was convinced that they would be worth a lot of money. He kept them for almost twenty years before realizing he was wrong. He is now just a grown man with hundreds of stuffed animals."}
{"input": ["Jasmin Perseveres"], "output": ["Jasmin got pregnant during her senior year of high school.", "She was very worried that her life would be ruined.", "She had her baby after graduation.", "She was still able to go to college to pursue her education.", "As soon as she graduated, she landed her dream job!"], "src": "Jasmin Perseveres", "trg": "Jasmin got pregnant during her senior year of high school. She was very worried that her life would be ruined. She had her baby after graduation. She was still able to go to college to pursue her education. As soon as she graduated, she landed her dream job!"}
{"input": ["The New Happiness"], "output": ["Randy had recently separated from his wife.", "He felt very lonely and sad all the time.", "He considered trying to patch things up with Vera, his ex-wife.", "He decided to get a puppy instead.", "His decision made him happy and he no longer felt sad."], "src": "The New Happiness", "trg": "Randy had recently separated from his wife. He felt very lonely and sad all the time. He considered trying to patch things up with Vera, his ex-wife. He decided to get a puppy instead. His decision made him happy and he no longer felt sad."}
{"input": ["Terrible Test"], "output": ["Tim needed to take a large test to graduate from high school.", "He was confident he would pass.", "However, Tim never studied for tests, including this one!", "Tim guessed all the answers, failed the test, and did not graduate.", "Tim learned that studying is important."], "src": "Terrible Test", "trg": "Tim needed to take a large test to graduate from high school. He was confident he would pass. However, Tim never studied for tests, including this one! Tim guessed all the answers, failed the test, and did not graduate. Tim learned that studying is important."}
{"input": ["Marina"], "output": ["Lucy made marinara sauce for her family.", "It took a lot of time and effort.", "They ate it all and said it was great.", "She finally tried it and it was disgusting.", "She was happy they all pretended to like it."], "src": "Marina", "trg": "Lucy made marinara sauce for her family. It took a lot of time and effort. They ate it all and said it was great. She finally tried it and it was disgusting. She was happy they all pretended to like it."}
{"input": ["Charlie Helps Paint"], "output": ["Little Charlie and his dad were painting the garage.", "Charlie had some trouble controlling the brush.", "His dad turned around and started to laugh.", "Charlie had paint on him from head to toe.", "His dad rinsed him off with water from the hose."], "src": "Charlie Helps Paint", "trg": "Little Charlie and his dad were painting the garage. Charlie had some trouble controlling the brush. His dad turned around and started to laugh. Charlie had paint on him from head to toe. His dad rinsed him off with water from the hose."}
{"input": ["Working Out"], "output": ["Fred was never one for the gym.", "He was always worried about what he would look like going in there.", "One day he decided to go for it.", "It was a great life change for Fred.", "He started looking better and feeling better, all thanks to the gym."], "src": "Working Out", "trg": "Fred was never one for the gym. He was always worried about what he would look like going in there. One day he decided to go for it. It was a great life change for Fred. He started looking better and feeling better, all thanks to the gym."}
{"input": ["Don't Swim in December"], "output": ["Leah and Kerry went to the beach in December.", "Kerry put on her bathing suit and waded into the ocean!", "The water was so cold that Kerry's lips turned turned blue.", "Leah pulled her from the icy water, saving Kerry from frostbite.", "Kerry learned not to swim at the beach in cold weather."], "src": "Don't Swim in December", "trg": "Leah and Kerry went to the beach in December. Kerry put on her bathing suit and waded into the ocean! The water was so cold that Kerry's lips turned turned blue. Leah pulled her from the icy water, saving Kerry from frostbite. Kerry learned not to swim at the beach in cold weather."}
{"input": ["The Dress"], "output": ["Eliza needed a new dress for a party.", "She went to a department store and looks at their dresses.", "Eliza finds a purple dress that would look great for the party.", "The store does not have the dress in Eliza's size.", "Eliza is sad that she will have to keep looking for another dress."], "src": "The Dress", "trg": "Eliza needed a new dress for a party. She went to a department store and looks at their dresses. Eliza finds a purple dress that would look great for the party. The store does not have the dress in Eliza's size. Eliza is sad that she will have to keep looking for another dress."}
{"input": ["Customer Service"], "output": ["Jane walked into the home improvement store, ready to complain.", "Her new lawn mower would not crank, so she brought it back.", "She talked to the clerk, who asked for her receipt.", "She gave him the receipt, and she exchanged the mower for a new one.", "Jane took the new mower home, and it cranked immediately."], "src": "Customer Service", "trg": "Jane walked into the home improvement store, ready to complain. Her new lawn mower would not crank, so she brought it back. She talked to the clerk, who asked for her receipt. She gave him the receipt, and she exchanged the mower for a new one. Jane took the new mower home, and it cranked immediately."}
{"input": ["Summer Rain"], "output": ["The children laughed as it started raining on them.", "They splashed about and started throwing mud at each other.", "Nora looked aghast through the door and prepared to yell at them.", "She paused when she realized how much ridiculous fun they were having.", "Nora decided to laugh at their antics and to join them, instead."], "src": "Summer Rain", "trg": "The children laughed as it started raining on them. They splashed about and started throwing mud at each other. Nora looked aghast through the door and prepared to yell at them. She paused when she realized how much ridiculous fun they were having. Nora decided to laugh at their antics and to join them, instead."}
{"input": ["Karen's Trip"], "output": ["Karen's job requires long hours at work.", "She works upwards of 80 hours per week.", "Karen decides that she needs to relax and have some time off.", "She books a vacation to Mexico.", "Karen travels to Mexico and has a very relaxing vacation."], "src": "Karen's Trip", "trg": "Karen's job requires long hours at work. She works upwards of 80 hours per week. Karen decides that she needs to relax and have some time off. She books a vacation to Mexico. Karen travels to Mexico and has a very relaxing vacation."}
{"input": ["The Go Cart"], "output": ["The boys were so excited they couldn't even sleep that night.", "It was Christmas morning and they sprang out of bed.", "They ran downstairs to the tree.", "There it was!", "The brand new Go Cart they had wanted."], "src": "The Go Cart", "trg": "The boys were so excited they couldn't even sleep that night. It was Christmas morning and they sprang out of bed. They ran downstairs to the tree. There it was! The brand new Go Cart they had wanted."}
{"input": ["Too Bad"], "output": ["I was listening to the music saved on my phone.", "Since the volume was on the highest setting, I couldn't hear anything.", "My mom tried to call me, but I didn't respond since I didn't hear her.", "When I went to look for my leftover food, it was gone.", "My mom told me that she ate it."], "src": "Too Bad", "trg": "I was listening to the music saved on my phone. Since the volume was on the highest setting, I couldn't hear anything. My mom tried to call me, but I didn't respond since I didn't hear her. When I went to look for my leftover food, it was gone. My mom told me that she ate it."}
{"input": ["Jeff wins it all"], "output": ["Jeff needed a big amount of money.", "He had made some bad bets and was down big.", "Jeff decided he had to take extreme gamble.", "Jeff bet all of his life savings on the basketball game.", "Jeff won and covered the spread to win it all."], "src": "Jeff wins it all", "trg": "Jeff needed a big amount of money. He had made some bad bets and was down big. Jeff decided he had to take extreme gamble. Jeff bet all of his life savings on the basketball game. Jeff won and covered the spread to win it all."}
{"input": ["John Sells His House"], "output": ["John decided he wanted to move to a new state.", "Before he could move he needed to sell his house.", "A buyer offered John a good price for his house.", "John sold the house.", "He was happy that he could now move to a new state."], "src": "John Sells His House", "trg": "John decided he wanted to move to a new state. Before he could move he needed to sell his house. A buyer offered John a good price for his house. John sold the house. He was happy that he could now move to a new state."}
{"input": ["Night Club Drama"], "output": ["Sandy wanted to go clubbing.", "She was going to the hottest club in the city.", "She got to the club and started to have a few drinks.", "She saw her ex boyfriend who wanted to come talk to her.", "He caused a big scene when Sandy Refused."], "src": "Night Club Drama", "trg": "Sandy wanted to go clubbing. She was going to the hottest club in the city. She got to the club and started to have a few drinks. She saw her ex boyfriend who wanted to come talk to her. He caused a big scene when Sandy Refused."}
{"input": ["Let's Plan a Trip"], "output": ["Bobby wanted to take his family to the beach.", "He planned the itinerary carefully.", "When it was time to leave, they loaded up the car.", "THey spent the next five days relaxing on the sand.", "It was a great family trip!"], "src": "Let's Plan a Trip", "trg": "Bobby wanted to take his family to the beach. He planned the itinerary carefully. When it was time to leave, they loaded up the car. THey spent the next five days relaxing on the sand. It was a great family trip!"}
{"input": ["Jane's Painting"], "output": ["Jane wanted to become a better artist.", "She bought brushes and paint from the art store.", "She practiced her painting skills whenever she could.", "The next month, she entered an art contest.", "She was excited when her painting won a ribbon."], "src": "Jane's Painting", "trg": "Jane wanted to become a better artist. She bought brushes and paint from the art store. She practiced her painting skills whenever she could. The next month, she entered an art contest. She was excited when her painting won a ribbon."}
{"input": ["Halloween"], "output": ["I was going to a Halloween party.", "I looked through my clothes but could not find a costume.", "I cut up my old clothes and constructed a costume.", "I put my costume on and went to the party.", "My friends loved my costume."], "src": "Halloween", "trg": "I was going to a Halloween party. I looked through my clothes but could not find a costume. I cut up my old clothes and constructed a costume. I put my costume on and went to the party. My friends loved my costume."}
{"input": ["Allen the Poet"], "output": ["Allen thought he was a very talented poet.", "He attended college to study creative writing.", "In college, he met a boy named Carl.", "Carl told him that he wasn't very good.", "Because of this, Allen swore off poetry forever."], "src": "Allen the Poet", "trg": "Allen thought he was a very talented poet. He attended college to study creative writing. In college, he met a boy named Carl. Carl told him that he wasn't very good. Because of this, Allen swore off poetry forever."}
{"input": ["Scrambled Eggs"], "output": ["Joy and Lizzy wanted to make breakfast in bed for their mom.", "It was her birthday so she deserved something special.", "She like her eggs sunny side up.", "The girls tried but they kept breaking the eggs.", "So their mom had scrambled eggs instead."], "src": "Scrambled Eggs", "trg": "Joy and Lizzy wanted to make breakfast in bed for their mom. It was her birthday so she deserved something special. She like her eggs sunny side up. The girls tried but they kept breaking the eggs. So their mom had scrambled eggs instead."}
{"input": ["90210"], "output": ["Shannon was moving to Beverly Hills.", "She had won the lottery and bought a mansion.", "She felt like she didn't fit in.", "Everyone else was very thin and beautiful.", "Shannon decided to go back to Kentucky and be herself."], "src": "90210", "trg": "Shannon was moving to Beverly Hills. She had won the lottery and bought a mansion. She felt like she didn't fit in. Everyone else was very thin and beautiful. Shannon decided to go back to Kentucky and be herself."}
{"input": ["The Call"], "output": ["Jean had a job interview for a position she really wanted.", "The interviewer said the company would call the next day.", "That day, Jean discovered her phone had no dial tone.", "She frantically searched and finally saw her room phone off the hook.", "She fixed it and a minute later got the call: she was hired!"], "src": "The Call", "trg": "Jean had a job interview for a position she really wanted. The interviewer said the company would call the next day. That day, Jean discovered her phone had no dial tone. She frantically searched and finally saw her room phone off the hook. She fixed it and a minute later got the call: she was hired!"}
{"input": ["Suzy wants a toy"], "output": ["Suzy was a three year old girl.", "She wanted the famous paw patrol toy.", "She begged her daddy day and night for it.", "One day her daddy took her to the store.", "Suzy was so happy that daddy bought her the paw patrol toy!"], "src": "Suzy wants a toy", "trg": "Suzy was a three year old girl. She wanted the famous paw patrol toy. She begged her daddy day and night for it. One day her daddy took her to the store. Suzy was so happy that daddy bought her the paw patrol toy!"}
{"input": ["Babysitting"], "output": ["Two weeks ago my sister in law called up.", "She was watching her ten and seven year old grandchildren.", "They were misbehaving, and getting restless.", "She brought them down to our apartment for distraction.", "After watching tv for an hour, she took them home to their mother."], "src": "Babysitting", "trg": "Two weeks ago my sister in law called up. She was watching her ten and seven year old grandchildren. They were misbehaving, and getting restless. She brought them down to our apartment for distraction. After watching tv for an hour, she took them home to their mother."}
{"input": ["Baking a Cake"], "output": ["Anita wanted to bake a cake.", "She looked in her cupboard for ingredients.", "She needed cocoa powder but could not find any.", "Anita remembered that she had some chocolate bars.", "She melted the chocolate down and mixed it into the cake batter."], "src": "Baking a Cake", "trg": "Anita wanted to bake a cake. She looked in her cupboard for ingredients. She needed cocoa powder but could not find any. Anita remembered that she had some chocolate bars. She melted the chocolate down and mixed it into the cake batter."}
{"input": ["Unclear Hatred"], "output": ["Diana sneezed in class.", "Everyone immediately said bless you.", "On the other hand, I sneezed and got no response.", "I became more suspicious when the event happened again.", "Instead of being mad, I assumed that they were not mad at me."], "src": "Unclear Hatred", "trg": "Diana sneezed in class. Everyone immediately said bless you. On the other hand, I sneezed and got no response. I became more suspicious when the event happened again. Instead of being mad, I assumed that they were not mad at me."}
{"input": ["A Wonderful Day"], "output": ["I woke up early yesterday because I was going on a trip.", "I got dressed.", "I drove to Dunn's river falls.", "I explored the falls.", "I went home exhausted."], "src": "A Wonderful Day", "trg": "I woke up early yesterday because I was going on a trip. I got dressed. I drove to Dunn's river falls. I explored the falls. I went home exhausted."}
{"input": ["Cruise Vacation"], "output": ["Tim went on a cruise vacation.", "He relaxed in the hot tub every night.", "His favorite activity was exploring each island the boat stopped at.", "Tim bought many souvenirs.", "He was sad when his vacation was over."], "src": "Cruise Vacation", "trg": "Tim went on a cruise vacation. He relaxed in the hot tub every night. His favorite activity was exploring each island the boat stopped at. Tim bought many souvenirs. He was sad when his vacation was over."}
{"input": ["Ted buys a car"], "output": ["Teddy was looking for a new car.", "He decided to head to the dealership.", "He wanted to pick out the best one for him.", "He chose the ford mustang.", "Ted was so happy with his new car."], "src": "Ted buys a car", "trg": "Teddy was looking for a new car. He decided to head to the dealership. He wanted to pick out the best one for him. He chose the ford mustang. Ted was so happy with his new car."}
{"input": ["At work"], "output": ["Daniel was good at his work but he never listened to his staff.", "During a meeting, he refused all the good ideas of his employees.", "He even said there was no way to fix the problem they were facing.", "His own boss was very disappointed when Daniel had no solution.", "He had no choice but to demote Daniel and remove his privileges."], "src": "At work", "trg": "Daniel was good at his work but he never listened to his staff. During a meeting, he refused all the good ideas of his employees. He even said there was no way to fix the problem they were facing. His own boss was very disappointed when Daniel had no solution. He had no choice but to demote Daniel and remove his privileges."}
{"input": ["Mail Fanatic"], "output": ["Janie loved getting mail.", "She even loved getting bills.", "People thought she was crazy.", "One day she received a package and was so excited.", "It was a present and she realized this is why she loves mail."], "src": "Mail Fanatic", "trg": "Janie loved getting mail. She even loved getting bills. People thought she was crazy. One day she received a package and was so excited. It was a present and she realized this is why she loves mail."}
{"input": ["The Solo"], "output": ["Anthony auditioned for a solo.", "He blew the judges away.", "When it was time to perform, Anthony got cold feet.", "He gave himself a pep talk.", "Finally, he took the stage and sang."], "src": "The Solo", "trg": "Anthony auditioned for a solo. He blew the judges away. When it was time to perform, Anthony got cold feet. He gave himself a pep talk. Finally, he took the stage and sang."}
{"input": ["The Broken Vase"], "output": ["Kelly ran into the living room, frantically.", "As she entered, she accidentally bumped into the coffee table.", "The vase on the table crashed to the ground but broke in large pieces.", "Kelly quickly grabbed some glue and put the vase back together.", "She sat the repaired vase onto the table as if nothing happened."], "src": "The Broken Vase", "trg": "Kelly ran into the living room, frantically. As she entered, she accidentally bumped into the coffee table. The vase on the table crashed to the ground but broke in large pieces. Kelly quickly grabbed some glue and put the vase back together. She sat the repaired vase onto the table as if nothing happened."}
{"input": ["Blind Date"], "output": ["Anna was very nervous about her blind date later that evening.", "After many outfit changes, she decided on jeans and a sweater.", "Anna was five minutes early to the agreed upon restaurant.", "She was surprised to find herself enjoying her dinner date.", "After lingering over dessert for an hour, they planned a second date."], "src": "Blind Date", "trg": "Anna was very nervous about her blind date later that evening. After many outfit changes, she decided on jeans and a sweater. Anna was five minutes early to the agreed upon restaurant. She was surprised to find herself enjoying her dinner date. After lingering over dessert for an hour, they planned a second date."}
{"input": ["Bird House"], "output": ["Sarah was tired of seeing spiders in her room.", "So she decided to use special bug spray.", "But later, she read that birds are a better solution.", "So she built a birdhouse to attract birds to her backyard.", "And she didn't see spiders in her room anymore."], "src": "Bird House", "trg": "Sarah was tired of seeing spiders in her room. So she decided to use special bug spray. But later, she read that birds are a better solution. So she built a birdhouse to attract birds to her backyard. And she didn't see spiders in her room anymore."}
{"input": ["The Lily Pad"], "output": ["Angela was walking around the pond.", "She saw a frog resting on the lily pad.", "She threw a rock at it.", "She tore a hole in the lily pad!", "She thought she'd get in trouble, so she ran away."], "src": "The Lily Pad", "trg": "Angela was walking around the pond. She saw a frog resting on the lily pad. She threw a rock at it. She tore a hole in the lily pad! She thought she'd get in trouble, so she ran away."}
{"input": ["Rudeness"], "output": ["Sonia wanted to buy a beautiful dress for a wedding.", "She went to her favorite store and asked for help.", "But the saleswoman was very rude and didn't help her at all.", "Sonia had to go to three more stores before finding a good saleswoman.", "She finally managed to find one and bought a nice dress."], "src": "Rudeness", "trg": "Sonia wanted to buy a beautiful dress for a wedding. She went to her favorite store and asked for help. But the saleswoman was very rude and didn't help her at all. Sonia had to go to three more stores before finding a good saleswoman. She finally managed to find one and bought a nice dress."}
{"input": ["A Helping Hand"], "output": ["Megan was down on her luck.", "She wasn't doing very well and had just been laid off.", "Her friends got together and thought up a plan.", "They all came to Megan's to cheer her up.", "Her friends helped her anyway they could and she was happy."], "src": "A Helping Hand", "trg": "Megan was down on her luck. She wasn't doing very well and had just been laid off. Her friends got together and thought up a plan. They all came to Megan's to cheer her up. Her friends helped her anyway they could and she was happy."}
{"input": ["Bill has trouble"], "output": ["Bill is driving to work.", "His car begins to make a loud noise.", "He pulls over to see what's wrong.", "He opens the hood and smoke flies everywhere.", "He calls triple a and waits for help."], "src": "Bill has trouble", "trg": "Bill is driving to work. His car begins to make a loud noise. He pulls over to see what's wrong. He opens the hood and smoke flies everywhere. He calls triple a and waits for help."}
{"input": ["The Snowman"], "output": ["Vanessa didn't like winter or cold weather.", "Her parents were always trying to get her to play outside in the snow.", "Vanessa's parents showed her how to make a snowman from the snow.", "Vanessa loved the snowman so much that she built more snowmen.", "Now Vanessa's parents have to limit her time playing in the snow."], "src": "The Snowman", "trg": "Vanessa didn't like winter or cold weather. Her parents were always trying to get her to play outside in the snow. Vanessa's parents showed her how to make a snowman from the snow. Vanessa loved the snowman so much that she built more snowmen. Now Vanessa's parents have to limit her time playing in the snow."}
{"input": ["Rex"], "output": ["Sam's dog Rex escaped from their yard.", "Sam was distraught.", "He went out calling for Rex.", "Then he saw Rex come running up the street!", "Sam was so relieved, he almost cried!"], "src": "Rex", "trg": "Sam's dog Rex escaped from their yard. Sam was distraught. He went out calling for Rex. Then he saw Rex come running up the street! Sam was so relieved, he almost cried!"}
{"input": ["The Vacation"], "output": ["The parents wanted to take their family on a vacation.", "They chose to go to Rome as the vacation spot.", "In Rome the family visited Vatican City.", "In Vatican City they saw the Pope and ate delicious food.", "After two weeks the family returned home excited for the next vacation."], "src": "The Vacation", "trg": "The parents wanted to take their family on a vacation. They chose to go to Rome as the vacation spot. In Rome the family visited Vatican City. In Vatican City they saw the Pope and ate delicious food. After two weeks the family returned home excited for the next vacation."}
{"input": ["The Groundhog"], "output": ["Ella loved to garden in her backyard.", "One day, her garden had been destroyed by a groundhog!", "She wanted to get rid of it in a humane way.", "She caught it in a trap.", "Her garden was never dug up again."], "src": "The Groundhog", "trg": "Ella loved to garden in her backyard. One day, her garden had been destroyed by a groundhog! She wanted to get rid of it in a humane way. She caught it in a trap. Her garden was never dug up again."}
{"input": ["The Bully"], "output": ["Arthur did not want to go to school.", "A bully was always being mean to him.", "One day Arthur decided to stand up to the bully.", "When the bully pushed him, he pushed back.", "The bully was surprised and decided not to pick on him."], "src": "The Bully", "trg": "Arthur did not want to go to school. A bully was always being mean to him. One day Arthur decided to stand up to the bully. When the bully pushed him, he pushed back. The bully was surprised and decided not to pick on him."}
{"input": ["Cat wants to belong"], "output": ["One day two girls were walking home.", "Karen the first girl said did you hear that noise?", "It was something coming from the bushes.", "It was a poor orange kitty that nobody wanted.", "She meowed her way into the girl's heart and she took her home."], "src": "Cat wants to belong", "trg": "One day two girls were walking home. Karen the first girl said did you hear that noise? It was something coming from the bushes. It was a poor orange kitty that nobody wanted. She meowed her way into the girl's heart and she took her home."}
{"input": ["Chinatown"], "output": ["The kids went to Chinatown for the first time.", "They ate some good food.", "They bought fun souvenirs.", "They stared at the beautiful lanterns.", "It was like being in another country!"], "src": "Chinatown", "trg": "The kids went to Chinatown for the first time. They ate some good food. They bought fun souvenirs. They stared at the beautiful lanterns. It was like being in another country!"}
{"input": ["Jane gets a bad grade"], "output": ["Jane was having a hard time in school.", "She was partying too much and not giving school much attention.", "Jane decided she was going to cut out the partying.", "She tried her hardest to do well on this test.", "Her grade came back and it was an F."], "src": "Jane gets a bad grade", "trg": "Jane was having a hard time in school. She was partying too much and not giving school much attention. Jane decided she was going to cut out the partying. She tried her hardest to do well on this test. Her grade came back and it was an F."}
{"input": ["Baby Steps"], "output": ["Annie was frustrated that her one year old wasn't walking yet.", "All of her friends children were walking.", "She tried everything she could think of to help get her baby moving.", "She sat down in frustration when nothing worked.", "She realized her baby would walk when she was ready."], "src": "Baby Steps", "trg": "Annie was frustrated that her one year old wasn't walking yet. All of her friends children were walking. She tried everything she could think of to help get her baby moving. She sat down in frustration when nothing worked. She realized her baby would walk when she was ready."}
{"input": ["My Shopping Trip"], "output": ["Yesterday, I went shopping for shoes.", "I went to Shoe Carnival, looking for a great pair of running shoes.", "I found all kinds of colorful options, and it was very hard to choose.", "I picked a pair with rainbow colors, because it made me feel young.", "I walked out of the store very happy with my purchase."], "src": "My Shopping Trip", "trg": "Yesterday, I went shopping for shoes. I went to Shoe Carnival, looking for a great pair of running shoes. I found all kinds of colorful options, and it was very hard to choose. I picked a pair with rainbow colors, because it made me feel young. I walked out of the store very happy with my purchase."}
{"input": ["The Whale"], "output": ["Greg was kayaking in the ocean.", "All of a sudden, a huge whale popped up in front of him!", "The whale made a big splash.", "Gary wished he'd had his camera rolling.", "He told all his friends about the amazing experience."], "src": "The Whale", "trg": "Greg was kayaking in the ocean. All of a sudden, a huge whale popped up in front of him! The whale made a big splash. Gary wished he'd had his camera rolling. He told all his friends about the amazing experience."}
{"input": ["Ice Cream Day"], "output": ["Our apartment building hosted an ice cream party in June.", "They hired an ice cream truck to give out free ice cream.", "The truck was parked in the driveway, which was blocked off to traffic.", "We had ice cream and watched a lot of young children eat.", "The party lasted two hours, and we had a lot of fun."], "src": "Ice Cream Day", "trg": "Our apartment building hosted an ice cream party in June. They hired an ice cream truck to give out free ice cream. The truck was parked in the driveway, which was blocked off to traffic. We had ice cream and watched a lot of young children eat. The party lasted two hours, and we had a lot of fun."}
{"input": ["I should have cheated!"], "output": ["David was faced a particularly difficult exam.", "He expected to just pass based on it.", "However, he saw a person carelessly showing his exam.", "Noble David decided to not cheat.", "Unfortunately, David did not pass this difficult exam."], "src": "I should have cheated!", "trg": "David was faced a particularly difficult exam. He expected to just pass based on it. However, he saw a person carelessly showing his exam. Noble David decided to not cheat. Unfortunately, David did not pass this difficult exam."}
{"input": ["Francine Paints Her Nails"], "output": ["Francine decided she wanted to do something fun this weekend.", "She thought that painting her nails would help make her feel fun.", "She painted her nails a bright blue color.", "Afterwards, Francine felt very happy.", "She was glad that she had painted her nails."], "src": "Francine Paints Her Nails", "trg": "Francine decided she wanted to do something fun this weekend. She thought that painting her nails would help make her feel fun. She painted her nails a bright blue color. Afterwards, Francine felt very happy. She was glad that she had painted her nails."}
{"input": ["Chef Kira"], "output": ["Kira didn't know what to make for dinner.", "She searched the kitchen cabinets and refrigerator, taking inventory.", "Kira's sister suggested they order a pizza instead.", "Kira smiled, realizing they had pizza ingredients in the house.", "Kira and her sister made pizzas for dinner."], "src": "Chef Kira", "trg": "Kira didn't know what to make for dinner. She searched the kitchen cabinets and refrigerator, taking inventory. Kira's sister suggested they order a pizza instead. Kira smiled, realizing they had pizza ingredients in the house. Kira and her sister made pizzas for dinner."}
{"input": ["The Jail"], "output": ["A woman got a new job at the jail.", "It was full of dangerous criminals.", "She got to know a few of them.", "They became friends.", "She helped them escape."], "src": "The Jail", "trg": "A woman got a new job at the jail. It was full of dangerous criminals. She got to know a few of them. They became friends. She helped them escape."}
{"input": ["Food poisoning"], "output": ["On Monday I went to lunch with my friend.", "We went to a small Italian restaurant.", "I ordered pizza.", "At first I thought it tasted okay.", "Yet to my shock I got sick when I got home."], "src": "Food poisoning", "trg": "On Monday I went to lunch with my friend. We went to a small Italian restaurant. I ordered pizza. At first I thought it tasted okay. Yet to my shock I got sick when I got home."}
{"input": ["The Criminal"], "output": ["Dean met a man on the street that said he needed help.", "He felt bad for him, so he gave him a job at his church.", "The next day, Dean entered the church and was shocked.", "Everything of value was stolen!", "Dean never saw the man again."], "src": "The Criminal", "trg": "Dean met a man on the street that said he needed help. He felt bad for him, so he gave him a job at his church. The next day, Dean entered the church and was shocked. Everything of value was stolen! Dean never saw the man again."}
{"input": ["Actor"], "output": ["Tom was an actor.", "He had to do a cartwheel in one scene of the movie.", "The director did not like the cartwheel that Tom did.", "Tom had to do cartwheels all day until the director was happy.", "Tom went home with a backache."], "src": "Actor", "trg": "Tom was an actor. He had to do a cartwheel in one scene of the movie. The director did not like the cartwheel that Tom did. Tom had to do cartwheels all day until the director was happy. Tom went home with a backache."}
{"input": ["Sweet Tooth"], "output": ["Jessica wanted something cold and sweet to eat.", "She looked in her freezer but didn't see ice cream.", "Jessica saw some fruit on the counter.", "She put the fruit, ice and yogurt in a blender.", "Jessica enjoyed her healthy smoothie."], "src": "Sweet Tooth", "trg": "Jessica wanted something cold and sweet to eat. She looked in her freezer but didn't see ice cream. Jessica saw some fruit on the counter. She put the fruit, ice and yogurt in a blender. Jessica enjoyed her healthy smoothie."}
{"input": ["Rain"], "output": ["Kaya walked to school in the morning.", "It was a lovely day.", "But after class, it had begun to rain!", "Poor Kaya had brought no umbrella.", "She was forced to walk home in the rain."], "src": "Rain", "trg": "Kaya walked to school in the morning. It was a lovely day. But after class, it had begun to rain! Poor Kaya had brought no umbrella. She was forced to walk home in the rain."}
{"input": ["Dallas wants to wrestle"], "output": ["Dallas always wanted to be a professional wrestler.", "He decided he was gonna give his dream a shot.", "He knew he wasn't the biggest or the fastest.", "He was determined to become what he aspired to be.", "Dallas walked out into the ring and finally realized his dreams."], "src": "Dallas wants to wrestle", "trg": "Dallas always wanted to be a professional wrestler. He decided he was gonna give his dream a shot. He knew he wasn't the biggest or the fastest. He was determined to become what he aspired to be. Dallas walked out into the ring and finally realized his dreams."}
{"input": ["Gamers Need Love Too"], "output": ["Bill's older brother told him he'd never get a date.", "He spent too much time playing video games.", "One day he was at the video game store.", "A pretty girl came up beside him, asking his advice on a game.", "They hit it off so he asked her out and she said yes."], "src": "Gamers Need Love Too", "trg": "Bill's older brother told him he'd never get a date. He spent too much time playing video games. One day he was at the video game store. A pretty girl came up beside him, asking his advice on a game. They hit it off so he asked her out and she said yes."}
{"input": ["Stolen Gameboy"], "output": ["Mrs Arthur had rules about when her son could play video games.", "She caught him playing after hours and took the game away.", "Her son waited until she was not around, found the game, and took it.", "Mrs Arthur caught her son with the game again the next day.", "She had to punish her son more severely to teach him the lesson."], "src": "Stolen Gameboy", "trg": "Mrs Arthur had rules about when her son could play video games. She caught him playing after hours and took the game away. Her son waited until she was not around, found the game, and took it. Mrs Arthur caught her son with the game again the next day. She had to punish her son more severely to teach him the lesson."}
{"input": ["Brad gets a date"], "output": ["Brad needed to find a date to the prom.", "He asked just about every girl in school.", "One day a new girl came to his school.", "She was all alone and had no friends.", "Brad decided to ask her and she said yes!"], "src": "Brad gets a date", "trg": "Brad needed to find a date to the prom. He asked just about every girl in school. One day a new girl came to his school. She was all alone and had no friends. Brad decided to ask her and she said yes!"}
{"input": ["The Affair"], "output": ["The wife found out her husband and sister had an affair.", "She was horrified!", "She kicked the husband out and changed her phone number.", "She never spoke to either of them again.", "She found a great new husband who was much more caring."], "src": "The Affair", "trg": "The wife found out her husband and sister had an affair. She was horrified! She kicked the husband out and changed her phone number. She never spoke to either of them again. She found a great new husband who was much more caring."}
{"input": ["Aphids"], "output": ["Stephanie loved her garden and spent a lot of time there.", "One day, she noticed aphids attacking her plants.", "Stephanie knew that ladybugs could help.", "She bought one hundred ladybugs from a garden store.", "Stephanie released the bugs and they gobbled up all the aphids."], "src": "Aphids", "trg": "Stephanie loved her garden and spent a lot of time there. One day, she noticed aphids attacking her plants. Stephanie knew that ladybugs could help. She bought one hundred ladybugs from a garden store. Stephanie released the bugs and they gobbled up all the aphids."}
{"input": ["First Day"], "output": ["John was driving to work early one morning.", "He was taking the usual route that he knew well.", "He felt comfortable, so he began browsing through his phone.", "Suddenly, he blew a stop sign a careened off the road.", "He realized that using his phone while driving can mean real danger."], "src": "First Day", "trg": "John was driving to work early one morning. He was taking the usual route that he knew well. He felt comfortable, so he began browsing through his phone. Suddenly, he blew a stop sign a careened off the road. He realized that using his phone while driving can mean real danger."}
{"input": ["Phil plays soccer"], "output": ["Phil loves playing sports with his friends.", "All his friends love basketball, but Phil really likes soccer.", "Phil invited all his friends to play soccer with him on Friday.", "They all showed up and play soccer.", "Now Phil's friends love playing soccer!"], "src": "Phil plays soccer", "trg": "Phil loves playing sports with his friends. All his friends love basketball, but Phil really likes soccer. Phil invited all his friends to play soccer with him on Friday. They all showed up and play soccer. Now Phil's friends love playing soccer!"}
{"input": ["The College Visit"], "output": ["Joshua traveled to State College to visit the campus.", "He looked at the dorms and auditoriums.", "He really felt at home.", "He signed up for classes at the end of the visit.", "He knew this was the school for him!"], "src": "The College Visit", "trg": "Joshua traveled to State College to visit the campus. He looked at the dorms and auditoriums. He really felt at home. He signed up for classes at the end of the visit. He knew this was the school for him!"}
{"input": ["The Sewing Machine"], "output": ["Crystal decided to learn how to sew.", "She worked hard at cutting out the pattern.", "Then she lined it up and sewed the edges up.", "She had created a beautiful pillowcase!", "Crystal decided to try a quilt next."], "src": "The Sewing Machine", "trg": "Crystal decided to learn how to sew. She worked hard at cutting out the pattern. Then she lined it up and sewed the edges up. She had created a beautiful pillowcase! Crystal decided to try a quilt next."}
{"input": ["The Ram"], "output": ["The couple was hiking in the desert.", "They stumbled upon a ram.", "They were scared at first.", "But the ram just walked away from them.", "They were happy they'd seen such a beautiful animal in the wild."], "src": "The Ram", "trg": "The couple was hiking in the desert. They stumbled upon a ram. They were scared at first. But the ram just walked away from them. They were happy they'd seen such a beautiful animal in the wild."}
{"input": ["The Hair Cut"], "output": ["Susan was getting a haircut for a wedding she was going to be in.", "She was excited as she looked at the example pictures.", "As she looked through them she seen one she loved.", "She showed the hairdresser the cut that she had wanted.", "The hairdresser did a great job and Susan loved it!"], "src": "The Hair Cut", "trg": "Susan was getting a haircut for a wedding she was going to be in. She was excited as she looked at the example pictures. As she looked through them she seen one she loved. She showed the hairdresser the cut that she had wanted. The hairdresser did a great job and Susan loved it!"}
{"input": ["Jason wouldn't get a job"], "output": ["Jason was a healthy young man.", "He worked at taco bell with his brothers.", "One day he got into a big fight with his brother Matt.", "He quit the Job on the spot.", "Jason never wanted to get a real job again."], "src": "Jason wouldn't get a job", "trg": "Jason was a healthy young man. He worked at taco bell with his brothers. One day he got into a big fight with his brother Matt. He quit the Job on the spot. Jason never wanted to get a real job again."}
{"input": ["Pretty Pictures"], "output": ["The photographer was looking for something interesting to photograph.", "He happened to walk by a beautiful garden.", "It was full of lovely flowers.", "He started snapping picture after picture.", "The next month, he opened a show featuring the lovely flower photos."], "src": "Pretty Pictures", "trg": "The photographer was looking for something interesting to photograph. He happened to walk by a beautiful garden. It was full of lovely flowers. He started snapping picture after picture. The next month, he opened a show featuring the lovely flower photos."}
{"input": ["Sick as a Dog"], "output": ["Marlene took her dog for a walk.", "While they were out, Marlene got violently ill.", "A kind motorist stopped and offered to help.", "He drove Marlene to the Emergency Room.", "She was in the hospital for a whole week!"], "src": "Sick as a Dog", "trg": "Marlene took her dog for a walk. While they were out, Marlene got violently ill. A kind motorist stopped and offered to help. He drove Marlene to the Emergency Room. She was in the hospital for a whole week!"}
{"input": ["Talent Contest"], "output": ["Nick's school was having a talent contest.", "He decided to enter the contest and play his guitar.", "He'd never performed on stage before and was very nervous.", "Nick's nerves caused him to play poorly.", "He lost the contest and decided to never do it again."], "src": "Talent Contest", "trg": "Nick's school was having a talent contest. He decided to enter the contest and play his guitar. He'd never performed on stage before and was very nervous. Nick's nerves caused him to play poorly. He lost the contest and decided to never do it again."}
{"input": ["Bloated"], "output": ["Bob was looking at a house near the Missouri river.", "As the agent showed him the house, he saw something in the river.", "They went to take a closer look.", "Bob was aghast when he realized it was a bloated corpse.", "The agent said people drowning wouldn't affect the home's value."], "src": "Bloated", "trg": "Bob was looking at a house near the Missouri river. As the agent showed him the house, he saw something in the river. They went to take a closer look. Bob was aghast when he realized it was a bloated corpse. The agent said people drowning wouldn't affect the home's value."}
{"input": ["Jill's Surprise"], "output": ["Jill's birthday was Saturday.", "Her daughter wanted to surprise her, so she contacted all her friends.", "They all bought presents and showed up at the right time.", "Jill's daughter forgot to tell her she was having a party.", "So Jill didn't show up for her own birthday party."], "src": "Jill's Surprise", "trg": "Jill's birthday was Saturday. Her daughter wanted to surprise her, so she contacted all her friends. They all bought presents and showed up at the right time. Jill's daughter forgot to tell her she was having a party. So Jill didn't show up for her own birthday party."}
{"input": ["Ceiling Fan"], "output": ["There was a bug on the wall by the bed.", "Kate grabbed a shoe and went to kill it.", "She had to stand on the bed to reach the bug.", "Afterwards she turned and ran right into the ceiling fan.", "Luckily it was on low, and she wasn't hurt at all."], "src": "Ceiling Fan", "trg": "There was a bug on the wall by the bed. Kate grabbed a shoe and went to kill it. She had to stand on the bed to reach the bug. Afterwards she turned and ran right into the ceiling fan. Luckily it was on low, and she wasn't hurt at all."}
{"input": ["Tuna Fiend"], "output": ["Ellie's cat Jazz was a tuna fiend.", "Any time Ellie opened a can of tuna, Jazz knew about it.", "Ellie tried to trick Jazz by buying bagged tuna.", "As soon as Ellie opened it, Jazz was there.", "There was just no hiding tuna from Jazz!"], "src": "Tuna Fiend", "trg": "Ellie's cat Jazz was a tuna fiend. Any time Ellie opened a can of tuna, Jazz knew about it. Ellie tried to trick Jazz by buying bagged tuna. As soon as Ellie opened it, Jazz was there. There was just no hiding tuna from Jazz!"}
{"input": ["Genie's Mask"], "output": ["Genie made everyone at work feel uncomfortable today.", "She always seemed sneaky, but she had something up her sleeve.", "Next thing we knew, she was in the office talking to the boss.", "She was lying about several of us, and wanted us to get fired.", "Now we are all nervous and waiting to see what happens."], "src": "Genie's Mask", "trg": "Genie made everyone at work feel uncomfortable today. She always seemed sneaky, but she had something up her sleeve. Next thing we knew, she was in the office talking to the boss. She was lying about several of us, and wanted us to get fired. Now we are all nervous and waiting to see what happens."}
{"input": ["My Human Loves Me"], "output": ["Tom was tired of his small dog yapping around him.", "He put it in the basement and shut the door tightly.", "Tom cherished the sudden quiet and took a nice long nap.", "It rained torrentially while he slept and the basement flooded.", "Tom's little dog was trapped in the basement and drowned."], "src": "My Human Loves Me", "trg": "Tom was tired of his small dog yapping around him. He put it in the basement and shut the door tightly. Tom cherished the sudden quiet and took a nice long nap. It rained torrentially while he slept and the basement flooded. Tom's little dog was trapped in the basement and drowned."}
{"input": ["The Swan"], "output": ["A swan swam gracefully through the water.", "It was beautiful and white.", "It had a long orange beak.", "The crowd gathered and observed it.", "It was a beautiful creature."], "src": "The Swan", "trg": "A swan swam gracefully through the water. It was beautiful and white. It had a long orange beak. The crowd gathered and observed it. It was a beautiful creature."}
{"input": ["The Cruise"], "output": ["The family arrived at the port to take their cruise.", "They were so excited!", "At their first port, they got terribly lost.", "They missed the cruise leaving.", "They were stranded in Italy."], "src": "The Cruise", "trg": "The family arrived at the port to take their cruise. They were so excited! At their first port, they got terribly lost. They missed the cruise leaving. They were stranded in Italy."}
{"input": ["The Court Case"], "output": ["The new lawyer was happy to be practicing in a courtroom.", "She was determined to be totally prepared.", "On the first day of the trial, she gave a great opening statement.", "She felt very confident.", "The jury said that her client was not guilty."], "src": "The Court Case", "trg": "The new lawyer was happy to be practicing in a courtroom. She was determined to be totally prepared. On the first day of the trial, she gave a great opening statement. She felt very confident. The jury said that her client was not guilty."}
{"input": ["Rehab"], "output": ["Rosie started drinking alcohol at age 16.", "After high school, Rosie drank every night.", "One day, Rosie decided to drive her car after drinking.", "Rosie got into an accident by drunk driving.", "Rosie had to go to rehab for drunk driving."], "src": "Rehab", "trg": "Rosie started drinking alcohol at age 16. After high school, Rosie drank every night. One day, Rosie decided to drive her car after drinking. Rosie got into an accident by drunk driving. Rosie had to go to rehab for drunk driving."}
{"input": ["Jolly Rancher"], "output": ["Sam was eating a jolly rancher.", "All was going well until he chomped down.", "Suddenly he felt a sharp burst of pain.", "Sam has broken off a piece of his tooth.", "He rushed to the dentist and had emergency surgery."], "src": "Jolly Rancher", "trg": "Sam was eating a jolly rancher. All was going well until he chomped down. Suddenly he felt a sharp burst of pain. Sam has broken off a piece of his tooth. He rushed to the dentist and had emergency surgery."}
{"input": ["Weather problems"], "output": ["This afternoon, I was very intent on going to Big Sur.", "I took my car and drove for hours.", "Midway, I stopped to take some refreshments at a diner.", "When I came out, it was raining.", "I finally arrived in the middle of a storm, but I was still happy."], "src": "Weather problems", "trg": "This afternoon, I was very intent on going to Big Sur. I took my car and drove for hours. Midway, I stopped to take some refreshments at a diner. When I came out, it was raining. I finally arrived in the middle of a storm, but I was still happy."}
{"input": ["Finally Tall Enough"], "output": ["Billy wasn't able to ride the big roller coaster last year.", "He didn't meet the height requirement.", "He knew he had grown in the past year.", "He ran up to the measuring stick to see if he was finally tall enough.", "He made it by over an inch so he could finally get on it!"], "src": "Finally Tall Enough", "trg": "Billy wasn't able to ride the big roller coaster last year. He didn't meet the height requirement. He knew he had grown in the past year. He ran up to the measuring stick to see if he was finally tall enough. He made it by over an inch so he could finally get on it!"}
{"input": ["The Big Jump"], "output": ["Martin was ready for his biggest trick yet.", "He set up the ramp, making sure to line it up right.", "This was it, his big moment.", "He started pedaling towards the ramp full speed.", "He launched in the air, nearly clearing the whole driveway."], "src": "The Big Jump", "trg": "Martin was ready for his biggest trick yet. He set up the ramp, making sure to line it up right. This was it, his big moment. He started pedaling towards the ramp full speed. He launched in the air, nearly clearing the whole driveway."}
{"input": ["Love Note"], "output": ["Cam wrote a love note to a pretty girl in his class.", "He handed it to her as he walked to throw something away.", "She opened it and immediately wrote back.", "Cam picked up her response, from her desk.", "He read it and was happy she would sit with him at lunch."], "src": "Love Note", "trg": "Cam wrote a love note to a pretty girl in his class. He handed it to her as he walked to throw something away. She opened it and immediately wrote back. Cam picked up her response, from her desk. He read it and was happy she would sit with him at lunch."}
{"input": ["Slip and slide"], "output": ["Rachael really wanted to have a slip and slide.", "So she bought one and set it up.", "No one was using it so her brother felt bad.", "He decided to go for a run on it.", "But when he slid the ground was so hard it cut his leg."], "src": "Slip and slide", "trg": "Rachael really wanted to have a slip and slide. So she bought one and set it up. No one was using it so her brother felt bad. He decided to go for a run on it. But when he slid the ground was so hard it cut his leg."}
{"input": ["The Kitty"], "output": ["Abe heard some scratching on the door.", "He opened it and found a tiny kitten.", "He scooped her up and gave her a bowl of milk.", "He tried to pet her but she scratched him and hissed.", "Abe put the kitten back outside and told her to scram."], "src": "The Kitty", "trg": "Abe heard some scratching on the door. He opened it and found a tiny kitten. He scooped her up and gave her a bowl of milk. He tried to pet her but she scratched him and hissed. Abe put the kitten back outside and told her to scram."}
{"input": ["Cheap Jacket"], "output": ["I bought a cheap jacket.", "It was only a dollar.", "It fell apart the next day.", "I then decided to buy a hundred dollar jacket.", "That jacket lasted forever."], "src": "Cheap Jacket", "trg": "I bought a cheap jacket. It was only a dollar. It fell apart the next day. I then decided to buy a hundred dollar jacket. That jacket lasted forever."}
{"input": ["The Lamb"], "output": ["Janet went to a farm with her class.", "They were all having fun looking at the animals.", "Janet walked over to a lamb.", "She was given a snack to give the lamb and enjoyed feeding it.", "The rest of the day Janet stayed by the lambs side."], "src": "The Lamb", "trg": "Janet went to a farm with her class. They were all having fun looking at the animals. Janet walked over to a lamb. She was given a snack to give the lamb and enjoyed feeding it. The rest of the day Janet stayed by the lambs side."}
{"input": ["Computer Repair"], "output": ["Bea yelled out that the computer was broken again.", "Mike walked into their shared office and looked at her,  exasperated.", "Mike rolled his eyes.", "He approached Bea and the computer, sighing a long suffering sigh.", "Mike switched on the computer monitor."], "src": "Computer Repair", "trg": "Bea yelled out that the computer was broken again. Mike walked into their shared office and looked at her,  exasperated. Mike rolled his eyes. He approached Bea and the computer, sighing a long suffering sigh. Mike switched on the computer monitor."}
{"input": ["Monster Truck Rally"], "output": ["Bob took Laura to a Monster Truck Rally.", "They sat on the front row.", "Laura watched all the different trucks.", "She also saw different cars get crushed.", "It was Laura's first time at a Monster Truck Rally."], "src": "Monster Truck Rally", "trg": "Bob took Laura to a Monster Truck Rally. They sat on the front row. Laura watched all the different trucks. She also saw different cars get crushed. It was Laura's first time at a Monster Truck Rally."}
{"input": ["The Baby"], "output": ["Linda had a new baby.", "Her other kids weren't adjusting well.", "They baby cried all the time.", "Linda said it would get easier when the baby got older.", "The siblings were not pleased with the new addition."], "src": "The Baby", "trg": "Linda had a new baby. Her other kids weren't adjusting well. They baby cried all the time. Linda said it would get easier when the baby got older. The siblings were not pleased with the new addition."}
{"input": ["Smoker"], "output": ["I used to smoke a pack of cigarettes a day.", "I had tried many times to quit smoking.", "Finally, I was able to quit smoking by switching to e-cigarettes.", "Then I read that e-cigarettes are harmful to my health, too.", "Now I am trying to quit using e-cigarettes."], "src": "Smoker", "trg": "I used to smoke a pack of cigarettes a day. I had tried many times to quit smoking. Finally, I was able to quit smoking by switching to e-cigarettes. Then I read that e-cigarettes are harmful to my health, too. Now I am trying to quit using e-cigarettes."}
{"input": ["Skittles"], "output": ["I have a friend who fell in love with Skittles when we were five.", "He ate them every day, and would bring them in a container to my house.", "He liked the red ones the best, so he'd give me all the rest.", "We sat on the bed and ate them and drank chocolate milk.", "We did this every day after school for 3 years."], "src": "Skittles", "trg": "I have a friend who fell in love with Skittles when we were five. He ate them every day, and would bring them in a container to my house. He liked the red ones the best, so he'd give me all the rest. We sat on the bed and ate them and drank chocolate milk. We did this every day after school for 3 years."}
{"input": ["New Shoes"], "output": ["Our 2 year old granddaughter is fussy about shoes.", "She likes to wear only orange Crocs.", "Her day care will not let her wear Crocs for safety reasons.", "Her father took her to a shoe store.", "After two hours, she picked out a pair of shoes."], "src": "New Shoes", "trg": "Our 2 year old granddaughter is fussy about shoes. She likes to wear only orange Crocs. Her day care will not let her wear Crocs for safety reasons. Her father took her to a shoe store. After two hours, she picked out a pair of shoes."}
{"input": ["The Frog"], "output": ["Ben found a frog in the creek.", "It was green and slimy.", "He took it home and put it in a bucket.", "The next day, the frog was gone.", "He'd jumped out and escaped!"], "src": "The Frog", "trg": "Ben found a frog in the creek. It was green and slimy. He took it home and put it in a bucket. The next day, the frog was gone. He'd jumped out and escaped!"}
{"input": ["Butterfly magic"], "output": ["Noah was looking for a very special butterfly.", "He went to the woods and walked all day.", "When night fell, he made a fire and waited.", "Around midnight, in the pale moonlight, he saw one.", "He looked at it, was mesmerized and let it go."], "src": "Butterfly magic", "trg": "Noah was looking for a very special butterfly. He went to the woods and walked all day. When night fell, he made a fire and waited. Around midnight, in the pale moonlight, he saw one. He looked at it, was mesmerized and let it go."}
{"input": ["Funny Accent"], "output": ["Cam wanted to shake up his daily routine.", "When he went to school he began to talk with a Scottish accent.", "His friend thought it was hilarious.", "The teacher told him to stop doing this act.", "Cam refused and claimed that this was his normal voice."], "src": "Funny Accent", "trg": "Cam wanted to shake up his daily routine. When he went to school he began to talk with a Scottish accent. His friend thought it was hilarious. The teacher told him to stop doing this act. Cam refused and claimed that this was his normal voice."}
{"input": ["Shane Shaves His Beard"], "output": ["Shane noticed that his beard was becoming long and unprofessional.", "He decided he should shave it.", "It was difficult to shave because it had grown so long.", "When he had finally shaved, Shane felt much better.", "Shane was glad to look better now that he had shaved."], "src": "Shane Shaves His Beard", "trg": "Shane noticed that his beard was becoming long and unprofessional. He decided he should shave it. It was difficult to shave because it had grown so long. When he had finally shaved, Shane felt much better. Shane was glad to look better now that he had shaved."}
{"input": ["Jaime's Passion"], "output": ["Jaime has loved to cook food since he was a young boy.", "He went to college for business, but he always wanted a restaurant.", "Last year Jaime bought a building and opened his first restaurant.", "It's called Fit Eats and it serves really tasty, healthy food.", "Jaime can't keep up with orders sometimes he's so busy."], "src": "Jaime's Passion", "trg": "Jaime has loved to cook food since he was a young boy. He went to college for business, but he always wanted a restaurant. Last year Jaime bought a building and opened his first restaurant. It's called Fit Eats and it serves really tasty, healthy food. Jaime can't keep up with orders sometimes he's so busy."}
{"input": ["Wishing for Snow"], "output": ["Bonnie was not ready for the history test tomorrow.", "When she went to bed she wished it would snow.", "That way school would be cancelled so she could study more.", "She was excited when she woke to four inches of snow.", "She spent the whole day studying so she'd be ready for the test."], "src": "Wishing for Snow", "trg": "Bonnie was not ready for the history test tomorrow. When she went to bed she wished it would snow. That way school would be cancelled so she could study more. She was excited when she woke to four inches of snow. She spent the whole day studying so she'd be ready for the test."}
{"input": ["Gambling"], "output": ["Joan went to the casino to try her luck.", "She put $10 worth of quarters in the first slot machine she saw.", "She didn't win anything and was very disappointed.", "On her way home, she found $10 on the pavement.", "She smiled, took it, and went home with a light heart."], "src": "Gambling", "trg": "Joan went to the casino to try her luck. She put $10 worth of quarters in the first slot machine she saw. She didn't win anything and was very disappointed. On her way home, she found $10 on the pavement. She smiled, took it, and went home with a light heart."}
{"input": ["Bad makeup"], "output": ["Marnie was getting married.", "For her wedding, she needed her makeup done.", "As a result she hired a makeup artist to help her.", "When the makeup artist was finished, marine looked at it.", "She was horrified and ended up firing her,"], "src": "Bad makeup", "trg": "Marnie was getting married. For her wedding, she needed her makeup done. As a result she hired a makeup artist to help her. When the makeup artist was finished, marine looked at it. She was horrified and ended up firing her,"}
{"input": ["Door Handle Disaster!"], "output": ["Yesterday I received a huge box of door handles I had ordered.", "I opened it to reveal beautiful, shiny new handles.", "I carefully removed the old, ugly handles from my doors.", "The new latches and striker plates do not fit the openings on the doors!", "I must fix the new parts so that the doors close properly."], "src": "Door Handle Disaster!", "trg": "Yesterday I received a huge box of door handles I had ordered. I opened it to reveal beautiful, shiny new handles. I carefully removed the old, ugly handles from my doors. The new latches and striker plates do not fit the openings on the doors! I must fix the new parts so that the doors close properly."}
{"input": ["Hamburger"], "output": ["It was my first time cooking dinner for myself.", "I decided to stay simple and cooked a hamburger.", "As the meat cooked, my nose was treated with a wondrous smell.", "After it finished, I took it off the grill and slapped it on a bun.", "I wasted no time and took a huge bite of my perfect burger."], "src": "Hamburger", "trg": "It was my first time cooking dinner for myself. I decided to stay simple and cooked a hamburger. As the meat cooked, my nose was treated with a wondrous smell. After it finished, I took it off the grill and slapped it on a bun. I wasted no time and took a huge bite of my perfect burger."}
{"input": ["Mia the Model"], "output": ["Mia is very beautiful.", "Mia stays in good shape and eats healthy.", "Because of Mia's good looks, she decides to become a model.", "Mia moves to New York to pursue modeling.", "Mia walked the runway in her first fashion show last week."], "src": "Mia the Model", "trg": "Mia is very beautiful. Mia stays in good shape and eats healthy. Because of Mia's good looks, she decides to become a model. Mia moves to New York to pursue modeling. Mia walked the runway in her first fashion show last week."}
{"input": ["The boy and his boat"], "output": ["Larry was only 5 years old.", "He loved to go riding on his boat with is dad.", "His father became ill of cancer and passed away.", "Larry still to this day sails on the boat.", "He loves to imagine his father is still with him and his boat."], "src": "The boy and his boat", "trg": "Larry was only 5 years old. He loved to go riding on his boat with is dad. His father became ill of cancer and passed away. Larry still to this day sails on the boat. He loves to imagine his father is still with him and his boat."}
{"input": ["Up Close"], "output": ["My grandparents and I were going for a walk.", "We were walking near some pine trees and turned a corner.", "Suddenly, right in front of us, was a huge moose.", "It was so close that it scared us, but they told me not to run.", "We all stood still and soon the moose walked away without harm."], "src": "Up Close", "trg": "My grandparents and I were going for a walk. We were walking near some pine trees and turned a corner. Suddenly, right in front of us, was a huge moose. It was so close that it scared us, but they told me not to run. We all stood still and soon the moose walked away without harm."}
{"input": ["David's Gift"], "output": ["David has to buy his wife Sarah a gift for their anniversary.", "David went out all day on Friday to find a gift.", "He searched all over, but he couldn't find the perfect gift.", "Eventually he decided to cook her dinner instead.", "Sarah loved the dinner he cooked for her!"], "src": "David's Gift", "trg": "David has to buy his wife Sarah a gift for their anniversary. David went out all day on Friday to find a gift. He searched all over, but he couldn't find the perfect gift. Eventually he decided to cook her dinner instead. Sarah loved the dinner he cooked for her!"}
{"input": ["Turtle Hatching"], "output": ["The crowd waited at the turtle nest, as the eggs would hatch soon.", "An egg began to crack open, and the crowd got very quiet.", "The crowd cleared a path for the baby turtle to enter the water.", "The turtle entered the water successfully and the crowd cheered.", "They then went back to wait for the next egg to hatch."], "src": "Turtle Hatching", "trg": "The crowd waited at the turtle nest, as the eggs would hatch soon. An egg began to crack open, and the crowd got very quiet. The crowd cleared a path for the baby turtle to enter the water. The turtle entered the water successfully and the crowd cheered. They then went back to wait for the next egg to hatch."}
{"input": ["Lenny wins big"], "output": ["Lenny wasn't having any luck at the slots.", "He thought it just wasn't his day.", "He was down to his last quarter.", "He decided to put it in the slot and pull.", "Lenny's eyes lit up with joy as he hit the jackpot."], "src": "Lenny wins big", "trg": "Lenny wasn't having any luck at the slots. He thought it just wasn't his day. He was down to his last quarter. He decided to put it in the slot and pull. Lenny's eyes lit up with joy as he hit the jackpot."}
{"input": ["Gaming"], "output": ["Sam loved playing video games.", "Sam decided to become a video game developer.", "Sam studied very hard in school and went to college.", "After graduating college Sam was offered several jobs in gaming.", "Sam selected his dream job and designed his own video game."], "src": "Gaming", "trg": "Sam loved playing video games. Sam decided to become a video game developer. Sam studied very hard in school and went to college. After graduating college Sam was offered several jobs in gaming. Sam selected his dream job and designed his own video game."}
{"input": ["Marcy's Cookie"], "output": ["In 2014, Marcy adopted a poodle.", "She named her Cookie, because she resembled an oatmeal cookie.", "Cookie learned to protect Marcy's two daughters from harm.", "She went for walks with them every evening, and was allowed to swim.", "Cookie made the kids very happy that year."], "src": "Marcy's Cookie", "trg": "In 2014, Marcy adopted a poodle. She named her Cookie, because she resembled an oatmeal cookie. Cookie learned to protect Marcy's two daughters from harm. She went for walks with them every evening, and was allowed to swim. Cookie made the kids very happy that year."}
{"input": ["The Car Ride"], "output": ["Vivian set out on a long car ride.", "She had books and a crossword puzzle.", "She also brought a pillow and blanket.", "The ride took fourteen hours.", "Vivian didn't mind it because she was well-prepared."], "src": "The Car Ride", "trg": "Vivian set out on a long car ride. She had books and a crossword puzzle. She also brought a pillow and blanket. The ride took fourteen hours. Vivian didn't mind it because she was well-prepared."}
{"input": ["Kickball League"], "output": ["Barry loved to play kickball, since he was a little boy.", "Barry decided to organize a kickball team in his neighborhood.", "Barry received many individuals wanting to join the team.", "Barry had such a large response, that he had to organize several teams.", "Barry was thrilled that he could organize a local kickball league."], "src": "Kickball League", "trg": "Barry loved to play kickball, since he was a little boy. Barry decided to organize a kickball team in his neighborhood. Barry received many individuals wanting to join the team. Barry had such a large response, that he had to organize several teams. Barry was thrilled that he could organize a local kickball league."}
{"input": ["Hailey goes on vacation."], "output": ["Hailey is looking forward to her vacation and she has a lot to do to.", "She started doing her laundry to make sure her clothes were clean.", "When the clothes were done, she started to pack her suitcase.", "After everything was packed she went to bed early enough to get sleep.", "She walk up early the next day and it was time for her to travel."], "src": "Hailey goes on vacation.", "trg": "Hailey is looking forward to her vacation and she has a lot to do to. She started doing her laundry to make sure her clothes were clean. When the clothes were done, she started to pack her suitcase. After everything was packed she went to bed early enough to get sleep. She walk up early the next day and it was time for her to travel."}
{"input": ["Marble Floors"], "output": ["The couple was renovating their kitchen.", "The wife wanted marble floors.", "They installed them and she regretted it immediately.", "The floors were so hard to keep clean!", "She decided she would go back to wood floors when she could afford it."], "src": "Marble Floors", "trg": "The couple was renovating their kitchen. The wife wanted marble floors. They installed them and she regretted it immediately. The floors were so hard to keep clean! She decided she would go back to wood floors when she could afford it."}
{"input": ["The Deep End"], "output": ["Mimi had almost drowned in the ocean as a child.", "As a result, she was terrified of pools and never went in them.", "One day, her boyfriend invited her to his pool.", "She wanted to swim with him, but was so scared.", "She told him her fears and he held her hand as they swam together."], "src": "The Deep End", "trg": "Mimi had almost drowned in the ocean as a child. As a result, she was terrified of pools and never went in them. One day, her boyfriend invited her to his pool. She wanted to swim with him, but was so scared. She told him her fears and he held her hand as they swam together."}
{"input": ["Bob Changes His Diet"], "output": ["Bob was feeling very tired everyday.", "He decided to live a healthier lifestyle.", "Bob eliminated all processed foods from his diet.", "Bob started eating fruits and vegetables in all his meals.", "Bob had more energy after changing his diet."], "src": "Bob Changes His Diet", "trg": "Bob was feeling very tired everyday. He decided to live a healthier lifestyle. Bob eliminated all processed foods from his diet. Bob started eating fruits and vegetables in all his meals. Bob had more energy after changing his diet."}
{"input": ["Change of Plans"], "output": ["Ben made plans with Diana to watch a movie on Friday.", "As soon as he approached the theater, he waited for her.", "A few hours have passed and she still didn't show up.", "While building up frustration, Ben left and visited another friend.", "They spent the rest of the day playing basketball."], "src": "Change of Plans", "trg": "Ben made plans with Diana to watch a movie on Friday. As soon as he approached the theater, he waited for her. A few hours have passed and she still didn't show up. While building up frustration, Ben left and visited another friend. They spent the rest of the day playing basketball."}
{"input": ["The Incredible Day"], "output": ["We took our son to Incredible Pizza for his birthday.", "He spun the giant wheel, and won lots of points.", "He used them all in the arcade room.", "He enjoyed the bumper cars and laser tag.", "He ended the day with a nice toy from the rewards desk."], "src": "The Incredible Day", "trg": "We took our son to Incredible Pizza for his birthday. He spun the giant wheel, and won lots of points. He used them all in the arcade room. He enjoyed the bumper cars and laser tag. He ended the day with a nice toy from the rewards desk."}
{"input": ["The kings defeat"], "output": ["The King had a problem on his hands.", "Their was war going on in his Village.", "He knew he was going to have to go into Battle.", "The king and his town gave it all he had against the rebels.", "The king was caught and executed in his town."], "src": "The kings defeat", "trg": "The King had a problem on his hands. Their was war going on in his Village. He knew he was going to have to go into Battle. The king and his town gave it all he had against the rebels. The king was caught and executed in his town."}
{"input": ["What a Day"], "output": ["Sammy was tired of working, but she soldiered on.", "Finally, it was time to leave the office for the day.", "Being home, she thought  entering her garage, was wonderful.", "Then, a party surprised her when she opened her front door.", "She ate cake and enjoyed her friends and family."], "src": "What a Day", "trg": "Sammy was tired of working, but she soldiered on. Finally, it was time to leave the office for the day. Being home, she thought  entering her garage, was wonderful. Then, a party surprised her when she opened her front door. She ate cake and enjoyed her friends and family."}
{"input": ["Reunited at the Reunion"], "output": ["Tom always wondered if he'd ever see Sue again.", "She had decided to marry someone else and they had moved far away.", "Now, she was divorced and would be coming to the class reunion.", "Tom and Sue spent most of the reunion talking with each other.", "The two reunited lovebirds have been together ever since."], "src": "Reunited at the Reunion", "trg": "Tom always wondered if he'd ever see Sue again. She had decided to marry someone else and they had moved far away. Now, she was divorced and would be coming to the class reunion. Tom and Sue spent most of the reunion talking with each other. The two reunited lovebirds have been together ever since."}
{"input": ["Bills Bad Luck"], "output": ["Bill worked in a prison.", "His job was to maintain prison walls.", "He accidently left a hole open and a prisoner got out.", "He got fired for his mistake.", "Bill decided that the work was no longer for him anyway."], "src": "Bills Bad Luck", "trg": "Bill worked in a prison. His job was to maintain prison walls. He accidently left a hole open and a prisoner got out. He got fired for his mistake. Bill decided that the work was no longer for him anyway."}
{"input": ["Kyle's New Bike"], "output": ["Kyle wanted a new bike so he could ride with his friends.", "He didn't have enough money to buy one.", "Kyle set up a lemonade stand with help from his dad.", "He made enough money to buy a bike.", "He rode with his friends every day!"], "src": "Kyle's New Bike", "trg": "Kyle wanted a new bike so he could ride with his friends. He didn't have enough money to buy one. Kyle set up a lemonade stand with help from his dad. He made enough money to buy a bike. He rode with his friends every day!"}
{"input": ["Dog Park Love"], "output": ["John and his girlfriend of two years had broken up.", "To help get his mind off it, he took his dog to the dog park.", "He sat down on a bench after he unhooked his dog to go play.", "While he was there a very pretty girl started talking to him.", "He enjoyed himself so much he asked her out and she said yes!"], "src": "Dog Park Love", "trg": "John and his girlfriend of two years had broken up. To help get his mind off it, he took his dog to the dog park. He sat down on a bench after he unhooked his dog to go play. While he was there a very pretty girl started talking to him. He enjoyed himself so much he asked her out and she said yes!"}
{"input": ["Night cravings"], "output": ["Gina liked to wake up at night and eat something.", "She prepared toasts in the middle of the night with glee.", "Her husband who was aware of her behavior tried to help her stop.", "He changed the peanut butter jar with pickles.", "But Gina loved food so much, she didn't even noticed."], "src": "Night cravings", "trg": "Gina liked to wake up at night and eat something. She prepared toasts in the middle of the night with glee. Her husband who was aware of her behavior tried to help her stop. He changed the peanut butter jar with pickles. But Gina loved food so much, she didn't even noticed."}
{"input": ["Ned Was Bad"], "output": ["Ned was a very envious person.", "He liked to feel more important than anyone else.", "But the new boy was too popular for Ned's liking.", "He tried to fight the new boy, but lost.", "Now Ned knows not to let envy get the better of him."], "src": "Ned Was Bad", "trg": "Ned was a very envious person. He liked to feel more important than anyone else. But the new boy was too popular for Ned's liking. He tried to fight the new boy, but lost. Now Ned knows not to let envy get the better of him."}
{"input": ["Flag Football"], "output": ["Jimmy had never played football before.", "He was finally old enough for flag football.", "He got out on the field, excited to play.", "He threw the ball to his friend running down the field.", "He caught it and scored a touchdown."], "src": "Flag Football", "trg": "Jimmy had never played football before. He was finally old enough for flag football. He got out on the field, excited to play. He threw the ball to his friend running down the field. He caught it and scored a touchdown."}
{"input": ["Cut Finger"], "output": ["Sarah took the watermelon out of the refrigerator.", "She got a knife and began to cut it into slices.", "The knife slipped and cut her finger.", "She immediately rinsed off the cut, and saw it wasn't too deep.", "She got a band-aid, and continued cutting the watermelon."], "src": "Cut Finger", "trg": "Sarah took the watermelon out of the refrigerator. She got a knife and began to cut it into slices. The knife slipped and cut her finger. She immediately rinsed off the cut, and saw it wasn't too deep. She got a band-aid, and continued cutting the watermelon."}
{"input": ["Country Music Concert"], "output": ["Joanne loves country music.", "She listens to country music during her commute every day.", "She hears on the radio that her favorite artist is coming to town.", "Joanne buys tickets to her favorite country artist's concert.", "Joanne attends the concert and has a fun time."], "src": "Country Music Concert", "trg": "Joanne loves country music. She listens to country music during her commute every day. She hears on the radio that her favorite artist is coming to town. Joanne buys tickets to her favorite country artist's concert. Joanne attends the concert and has a fun time."}
{"input": ["The Concert"], "output": ["The boys were pumped.", "They were finally going to go see the band in concert.", "It had been advertised for a while and the day was finally here.", "They loaded up in the car and took off to the venue.", "The band played all night and they loved every minute of it."], "src": "The Concert", "trg": "The boys were pumped. They were finally going to go see the band in concert. It had been advertised for a while and the day was finally here. They loaded up in the car and took off to the venue. The band played all night and they loved every minute of it."}
{"input": ["Temptation"], "output": ["Cara had been faithful to her boyfriend tommy.", "They had been together for 2 years.", "Never once did they cheat on each other.", "One night Cara met up with an ex boyfriend Richard.", "She still had feelings for him and was all alone with Him."], "src": "Temptation", "trg": "Cara had been faithful to her boyfriend tommy. They had been together for 2 years. Never once did they cheat on each other. One night Cara met up with an ex boyfriend Richard. She still had feelings for him and was all alone with Him."}
{"input": ["Theo's Fear of Heights"], "output": ["Theo was a very nervous child with a long-time fear of heights.", "One hot summer day, his friends invited him to a water park.", "His crush, Lucy, was there and she loved slides, so Theo had an idea.", "Theo asked her to join him on a two-person toboggan, and she accepted!", "Together, they rode the slide, with Theo screaming, but happy as ever!"], "src": "Theo's Fear of Heights", "trg": "Theo was a very nervous child with a long-time fear of heights. One hot summer day, his friends invited him to a water park. His crush, Lucy, was there and she loved slides, so Theo had an idea. Theo asked her to join him on a two-person toboggan, and she accepted! Together, they rode the slide, with Theo screaming, but happy as ever!"}
{"input": ["Skimming"], "output": ["Shane worked as an accountant for a large company.", "Shane felt that he was not being paid enough for his work.", "Shane decided to start altering the accounts at work and hiding money.", "Shane took the money he hid from work.", "Shane stole over 4 million dollars from his employer."], "src": "Skimming", "trg": "Shane worked as an accountant for a large company. Shane felt that he was not being paid enough for his work. Shane decided to start altering the accounts at work and hiding money. Shane took the money he hid from work. Shane stole over 4 million dollars from his employer."}
{"input": ["Jill's Night Out"], "output": ["Jill was invited out to dinner with her friends from work.", "Jill accidentally spilled juice on her dress right before she left.", "She had to go to the store and buy a new dress.", "She quickly picked out a nice black dress for the dinner.", "Luckily she was able to still make it in time for the meal."], "src": "Jill's Night Out", "trg": "Jill was invited out to dinner with her friends from work. Jill accidentally spilled juice on her dress right before she left. She had to go to the store and buy a new dress. She quickly picked out a nice black dress for the dinner. Luckily she was able to still make it in time for the meal."}
{"input": ["The Apple Tree"], "output": ["Mary had an apple tree in her garden.", "The tree was full of apples.", "Mary climbed up the tree to pick the apples.", "She fell down from the tree.", "Mary broke her leg when she fell."], "src": "The Apple Tree", "trg": "Mary had an apple tree in her garden. The tree was full of apples. Mary climbed up the tree to pick the apples. She fell down from the tree. Mary broke her leg when she fell."}
{"input": ["Brownie the Pekingese"], "output": ["Brownie was a happy dog, a pekingese who looked like a mop.", "One day, Brownie started going blind.", "Brownie walked into a wall, hurting his nose.", "He was never able to smell food again.", "Brownie still ate healthy every day, even with a broken nose."], "src": "Brownie the Pekingese", "trg": "Brownie was a happy dog, a pekingese who looked like a mop. One day, Brownie started going blind. Brownie walked into a wall, hurting his nose. He was never able to smell food again. Brownie still ate healthy every day, even with a broken nose."}
{"input": ["Breaking my leg"], "output": ["I fell one day and hurt my leg seriously.", "My mom immediately took me to the emergency room.", "I was in tears the whole time.", "The doctor took a look and said it was broken.", "After an x-ray to confirm it, they wrapped it in a cast."], "src": "Breaking my leg", "trg": "I fell one day and hurt my leg seriously. My mom immediately took me to the emergency room. I was in tears the whole time. The doctor took a look and said it was broken. After an x-ray to confirm it, they wrapped it in a cast."}
{"input": ["The surprise"], "output": ["Amanda got home late from work.", "She opened her front door.", "She walked into the dark house.", "She turned on the lights.", "Suddenly a bunch of people hollered \"SURPRISE\" and threw confetti."], "src": "The surprise", "trg": "Amanda got home late from work. She opened her front door. She walked into the dark house. She turned on the lights. Suddenly a bunch of people hollered \"SURPRISE\" and threw confetti."}
{"input": ["Fred Spills Paint"], "output": ["Fred is painting his room red.", "After stepping down from the ladder he knocks over the paint bucket.", "He spills paint all over his room.", "Fred quickly tries to clean the spill up.", "After it is clean, he resumes painting."], "src": "Fred Spills Paint", "trg": "Fred is painting his room red. After stepping down from the ladder he knocks over the paint bucket. He spills paint all over his room. Fred quickly tries to clean the spill up. After it is clean, he resumes painting."}
{"input": ["Tim's Coffee"], "output": ["Tim is an avid coffee drinker.", "When he woke up this morning, his coffee maker was broken.", "He remembered he had a starbucks gift card.", "Tim waited in the drive-thru line for 15 minutes.", "He did not enjoy the coffee that he had bought."], "src": "Tim's Coffee", "trg": "Tim is an avid coffee drinker. When he woke up this morning, his coffee maker was broken. He remembered he had a starbucks gift card. Tim waited in the drive-thru line for 15 minutes. He did not enjoy the coffee that he had bought."}
{"input": ["Diane Takes A Ride"], "output": ["Diane has always been scared to drive since she was little.", "Her mom used to yell at her and make her feel bad about driving.", "Diane started taking driving classes to overcome her fear.", "She was nervous at first, but stuck with the classes.", "Six months later, Diane is driving everywhere she goes."], "src": "Diane Takes A Ride", "trg": "Diane has always been scared to drive since she was little. Her mom used to yell at her and make her feel bad about driving. Diane started taking driving classes to overcome her fear. She was nervous at first, but stuck with the classes. Six months later, Diane is driving everywhere she goes."}
{"input": ["Walking At Night"], "output": ["Bob was on the phone all day.", "It was raining something fierce when he finally wasn't.", "Bob was sad he hadn't been able to go for his daily walk.", "When it stopped raining he saw there was a full moon.", "Bob went for his walk at midnight and was happy."], "src": "Walking At Night", "trg": "Bob was on the phone all day. It was raining something fierce when he finally wasn't. Bob was sad he hadn't been able to go for his daily walk. When it stopped raining he saw there was a full moon. Bob went for his walk at midnight and was happy."}
{"input": ["The Performance"], "output": ["The artist picked up the microphone.", "His set was about to begin and he mentally prepared.", "Finally, it was time to enter the stage and he did.", "The curtains rose revealing an active and loud audience.", "The artist began his set amidst excited cheers."], "src": "The Performance", "trg": "The artist picked up the microphone. His set was about to begin and he mentally prepared. Finally, it was time to enter the stage and he did. The curtains rose revealing an active and loud audience. The artist began his set amidst excited cheers."}
{"input": ["Science Test"], "output": ["Niels had a science test in the morning.", "He stayed up late playing video games.", "He forgot to study for the test!", "He tried his best, but to no avail.", "Niels failed his test."], "src": "Science Test", "trg": "Niels had a science test in the morning. He stayed up late playing video games. He forgot to study for the test! He tried his best, but to no avail. Niels failed his test."}
{"input": ["Flag"], "output": ["Anna wanted a flag for her lawn.", "She went to the flag store.", "There, she chose a floral print flag.", "She paid for it and brought it home.", "There, she set it on her lawn."], "src": "Flag", "trg": "Anna wanted a flag for her lawn. She went to the flag store. There, she chose a floral print flag. She paid for it and brought it home. There, she set it on her lawn."}
{"input": ["Landscaping business"], "output": ["Andy has been mowing lawns in his town since he was five.", "Recently, Andy wanted to become a bit more financially independent.", "Andy decided that he should open his own landscaping business.", "Andy figured this would help him to achieve his financial goal.", "Andy was excited to announce the opening of his landscaping business."], "src": "Landscaping business", "trg": "Andy has been mowing lawns in his town since he was five. Recently, Andy wanted to become a bit more financially independent. Andy decided that he should open his own landscaping business. Andy figured this would help him to achieve his financial goal. Andy was excited to announce the opening of his landscaping business."}
{"input": ["The Mess"], "output": ["Lola had made a huge mess her in room.", "Her mom yelled that she needed to clean it up immediately.", "It took her four hours but it was finally clean.", "She invited friends over that evening.", "They made it just as messy again!"], "src": "The Mess", "trg": "Lola had made a huge mess her in room. Her mom yelled that she needed to clean it up immediately. It took her four hours but it was finally clean. She invited friends over that evening. They made it just as messy again!"}
{"input": ["Clint's Career"], "output": ["When Clint first began working, he wanted to be a storm chaser.", "He decked out his truck, and followed storms with his camera.", "After years of near misses, he got some really great tornado shots.", "His most popular images were of lightning, and he got an amazing view.", "He ended up quitting storm chasing to be a photographer."], "src": "Clint's Career", "trg": "When Clint first began working, he wanted to be a storm chaser. He decked out his truck, and followed storms with his camera. After years of near misses, he got some really great tornado shots. His most popular images were of lightning, and he got an amazing view. He ended up quitting storm chasing to be a photographer."}
{"input": ["Jam on bread"], "output": ["I always hated jam on bread.", "Everyone told me to try it.", "I always refused.", "One day I finally tried it.", "It was the best taste in the world."], "src": "Jam on bread", "trg": "I always hated jam on bread. Everyone told me to try it. I always refused. One day I finally tried it. It was the best taste in the world."}
{"input": ["The Dog"], "output": ["Hank bought a new dog.", "He took it home and started to train it.", "Within a day, the dog knew five tricks!", "It was the smartest dog Hank had ever seen.", "He bragged to all of his friends about his new dog."], "src": "The Dog", "trg": "Hank bought a new dog. He took it home and started to train it. Within a day, the dog knew five tricks! It was the smartest dog Hank had ever seen. He bragged to all of his friends about his new dog."}
{"input": ["Timmy's New Fish Tank"], "output": ["Timmy loves new projects, so he searched online for something new.", "He found a website showing how to put together aquarium landscapes.", "Timmy bought an aquarium kit and decor to put together his own tank.", "The project was harder than Timmy expected.", "The fish tank is only half put together in his living room now."], "src": "Timmy's New Fish Tank", "trg": "Timmy loves new projects, so he searched online for something new. He found a website showing how to put together aquarium landscapes. Timmy bought an aquarium kit and decor to put together his own tank. The project was harder than Timmy expected. The fish tank is only half put together in his living room now."}
{"input": ["The Cake"], "output": ["Danielle stayed up late to bake a cake.", "She let it cool and then started to decorate it.", "It was a beautiful cake with great decorations.", "She brought the cake to an office party.", "She was so proud when her coworkers complimented her work."], "src": "The Cake", "trg": "Danielle stayed up late to bake a cake. She let it cool and then started to decorate it. It was a beautiful cake with great decorations. She brought the cake to an office party. She was so proud when her coworkers complimented her work."}
{"input": ["Subscription"], "output": ["Ludo looked on the cable guide for a movie to watch.", "He found a movie that he was excited about.", "When he tried to start it he realized he needed a subscription.", "He bought the subscription.", "Ludo watched a lot of movies on the subscription during the next week."], "src": "Subscription", "trg": "Ludo looked on the cable guide for a movie to watch. He found a movie that he was excited about. When he tried to start it he realized he needed a subscription. He bought the subscription. Ludo watched a lot of movies on the subscription during the next week."}
{"input": ["Charlie's Broken Leg"], "output": ["When I found Charlie Horse under my bed, his leg was messed up.", "Upon closer look, the stuffing was starting to come out.", "The seams had ruptured.", "When I looked at my dog, he was also under the bed.", "He looked very guilty, leading me to believe he caused the damage."], "src": "Charlie's Broken Leg", "trg": "When I found Charlie Horse under my bed, his leg was messed up. Upon closer look, the stuffing was starting to come out. The seams had ruptured. When I looked at my dog, he was also under the bed. He looked very guilty, leading me to believe he caused the damage."}
{"input": ["Stuart Buys A Bowtie"], "output": ["Stuart had always liked fancy clothes.", "He dreamed of owning a bowtie for special occasions.", "One day he bought a beautiful yellow bowtie.", "He wore it for a special picnic with friends.", "Stuart was happy to have fancy clothes for the occasion."], "src": "Stuart Buys A Bowtie", "trg": "Stuart had always liked fancy clothes. He dreamed of owning a bowtie for special occasions. One day he bought a beautiful yellow bowtie. He wore it for a special picnic with friends. Stuart was happy to have fancy clothes for the occasion."}
{"input": ["Meredith's Mistake"], "output": ["Meredith was a very curious five year old.", "She pretended to drive her dad's truck.", "She accidentally hit the emergency brake.", "The truck rolled back into the street.", "It stayed in the street until her dad came home with the keys!"], "src": "Meredith's Mistake", "trg": "Meredith was a very curious five year old. She pretended to drive her dad's truck. She accidentally hit the emergency brake. The truck rolled back into the street. It stayed in the street until her dad came home with the keys!"}
{"input": ["Amish Country"], "output": ["The family took a trip to Amish Country.", "They shopped at lots of interesting stores.", "They learned a lot about their history.", "At the end of their tour, they bought a beautiful table.", "It was an enjoyable trip!"], "src": "Amish Country", "trg": "The family took a trip to Amish Country. They shopped at lots of interesting stores. They learned a lot about their history. At the end of their tour, they bought a beautiful table. It was an enjoyable trip!"}
{"input": ["No more rules!"], "output": ["Morgan's parents were very strict.", "They made very strict rules to their son Morgan.", "Morgan was fed up with this nonsense.", "So Morgan ran away but was found.", "His parents learned to be more lax with Morgan."], "src": "No more rules!", "trg": "Morgan's parents were very strict. They made very strict rules to their son Morgan. Morgan was fed up with this nonsense. So Morgan ran away but was found. His parents learned to be more lax with Morgan."}
{"input": ["The Clown"], "output": ["Sarah is having a birthday party this month.", "She wanted to have a circus in her backyard.", "Sarah's mother told her that a clown would be nice to have.", "Sarah hated clowns because they were scary.", "During her birthday, the clown made her feel happy many times."], "src": "The Clown", "trg": "Sarah is having a birthday party this month. She wanted to have a circus in her backyard. Sarah's mother told her that a clown would be nice to have. Sarah hated clowns because they were scary. During her birthday, the clown made her feel happy many times."}
{"input": ["Dolphin Cruise"], "output": ["Susan was very excited to take a dolphin cruise while in Florida.", "She bought the tickets in advance.", "She boarded the boat with a life jacket.", "On the water, she felt extremely sea sick.", "She came back to land feeling disappointed at not seeing an dolphins."], "src": "Dolphin Cruise", "trg": "Susan was very excited to take a dolphin cruise while in Florida. She bought the tickets in advance. She boarded the boat with a life jacket. On the water, she felt extremely sea sick. She came back to land feeling disappointed at not seeing an dolphins."}
{"input": ["Robert's adventure"], "output": ["Robert was bored with life, he need some entertainment.", "He decided to pack up and go on a cross country adventure.", "He invited his buddy Bryan and they left town.", "They traveled all the way from PA to CA.", "It was quite an eventful journey that had together."], "src": "Robert's adventure", "trg": "Robert was bored with life, he need some entertainment. He decided to pack up and go on a cross country adventure. He invited his buddy Bryan and they left town. They traveled all the way from PA to CA. It was quite an eventful journey that had together."}
{"input": ["Joe C"], "output": ["On July 10th, we went to Joe C's birthday party.", "He was turning 99 on July 13th.", "His daughter, a musician, had several friends sing and play music.", "Other guests recited poetry to Joe, an amateur poet.", "Despite his age, Joe stayed at the party well past midnight."], "src": "Joe C", "trg": "On July 10th, we went to Joe C's birthday party. He was turning 99 on July 13th. His daughter, a musician, had several friends sing and play music. Other guests recited poetry to Joe, an amateur poet. Despite his age, Joe stayed at the party well past midnight."}
{"input": ["First day of school"], "output": ["Allie was nervous for the first day of school.", "She was afraid she would make no friends.", "Luckily when she got there, some nice girls came up to her.", "The girls complemented Allie and asked her to play.", "Allie was happy to make some friends."], "src": "First day of school", "trg": "Allie was nervous for the first day of school. She was afraid she would make no friends. Luckily when she got there, some nice girls came up to her. The girls complemented Allie and asked her to play. Allie was happy to make some friends."}
{"input": ["Dance recital"], "output": ["Jenny was nervous about her dance recital.", "She practiced for two hours before she had to be on stage.", "After her performance, she received a standing ovation.", "Her dance instructor told her afterwards that she had the best dance.", "Jenny was so happy that she signed up for the next recital."], "src": "Dance recital", "trg": "Jenny was nervous about her dance recital. She practiced for two hours before she had to be on stage. After her performance, she received a standing ovation. Her dance instructor told her afterwards that she had the best dance. Jenny was so happy that she signed up for the next recital."}
{"input": ["Jeremy's Career"], "output": ["In college, Jeremy double majored in math and physics.", "After graduation, he realized he had no idea what he wanted to do.", "He finally decided to join the National Guard.", "He went away to boot camp and officer training camp.", "Now he has a career he loves as a military officer."], "src": "Jeremy's Career", "trg": "In college, Jeremy double majored in math and physics. After graduation, he realized he had no idea what he wanted to do. He finally decided to join the National Guard. He went away to boot camp and officer training camp. Now he has a career he loves as a military officer."}
{"input": ["More Important Things Than People"], "output": ["Bob was driving to see a house in Buena Vista.", "He got stuck in a long line of cars.", "There was a road construction crew only letting one lane go at a time.", "When it was Bob's lane's turn, he floored the accelerator.", "He ran over one of the workers and was arrested."], "src": "More Important Things Than People", "trg": "Bob was driving to see a house in Buena Vista. He got stuck in a long line of cars. There was a road construction crew only letting one lane go at a time. When it was Bob's lane's turn, he floored the accelerator. He ran over one of the workers and was arrested."}
{"input": ["Sleepy"], "output": ["Chris was feeling drowsy for some reason one day.", "He hurriedly finished the rest of his chores.", "Afterwards, he undressed and laid in his bed.", "He set his alarm for two hours later and fell asleep.", "But 20 minutes into his nap, the doorbell rang and woke him up."], "src": "Sleepy", "trg": "Chris was feeling drowsy for some reason one day. He hurriedly finished the rest of his chores. Afterwards, he undressed and laid in his bed. He set his alarm for two hours later and fell asleep. But 20 minutes into his nap, the doorbell rang and woke him up."}
{"input": ["School Play Audition"], "output": ["Barry decided that he wanted to audition for the part of Hamlet.", "Barry practiced his lines day in and day out.", "Barry was anxious but prepared for his audition for Hamlet.", "After the audition, Barry waited anxiously to hear from the judges.", "Barry was elated to hear that he got the part of Hamlet in the play."], "src": "School Play Audition", "trg": "Barry decided that he wanted to audition for the part of Hamlet. Barry practiced his lines day in and day out. Barry was anxious but prepared for his audition for Hamlet. After the audition, Barry waited anxiously to hear from the judges. Barry was elated to hear that he got the part of Hamlet in the play."}
{"input": ["Sprayed"], "output": ["Ann's cat Cora was sprayed by a skunk.", "Ann knew she would have to bathe Cora.", "Sure enough, Cora resisted!", "But Ann managed to scrub her clean.", "Soon Cora was dry and sweet-smelling once again!"], "src": "Sprayed", "trg": "Ann's cat Cora was sprayed by a skunk. Ann knew she would have to bathe Cora. Sure enough, Cora resisted! But Ann managed to scrub her clean. Soon Cora was dry and sweet-smelling once again!"}
{"input": ["Lisa's Restaurant"], "output": ["Lisa wants to start a new business.", "She decides to open a restaurant.", "She scouts the perfect location.", "She opened her restaurant in the best neighborhood in town.", "Her restaurant is very busy and has reservations full nightly."], "src": "Lisa's Restaurant", "trg": "Lisa wants to start a new business. She decides to open a restaurant. She scouts the perfect location. She opened her restaurant in the best neighborhood in town. Her restaurant is very busy and has reservations full nightly."}
{"input": ["New Family"], "output": ["Jenn and Bill fell in love and got married.", "A few months later, Jenn found out that she was pregnant.", "Bill was very excited and couldn't wait to be a father.", "They found out they were having a baby boy.", "Once the baby was born they named him Theodore."], "src": "New Family", "trg": "Jenn and Bill fell in love and got married. A few months later, Jenn found out that she was pregnant. Bill was very excited and couldn't wait to be a father. They found out they were having a baby boy. Once the baby was born they named him Theodore."}
{"input": ["The Ghost"], "output": ["Tom heard a strange noise in the attic.", "He went upstairs to see what it was.", "He saw a glowing, transparent person.", "They made a spooky gesture towards him.", "He ran away to tell his wife he'd seen a ghost."], "src": "The Ghost", "trg": "Tom heard a strange noise in the attic. He went upstairs to see what it was. He saw a glowing, transparent person. They made a spooky gesture towards him. He ran away to tell his wife he'd seen a ghost."}
{"input": ["Buttered Bread"], "output": ["Jake was all out of bread.", "He really wanted a peanut butter and jelly sandwich.", "Jake remembered he'd frozen a loaf in the freezer!", "He toasted two pieces of the frozen bread and made a sandwich.", "It turned out to be just as delicious as if it were fresh!"], "src": "Buttered Bread", "trg": "Jake was all out of bread. He really wanted a peanut butter and jelly sandwich. Jake remembered he'd frozen a loaf in the freezer! He toasted two pieces of the frozen bread and made a sandwich. It turned out to be just as delicious as if it were fresh!"}
{"input": ["Long Day"], "output": ["I visited the hospital this morning.", "As soon as I was registered, I took the elevator to the fourth floor.", "The nurse took my vitals and started my treatment.", "Before leaving, my child life specialist told me about a special event.", "I ended up leaving 2 hours later after attending the event."], "src": "Long Day", "trg": "I visited the hospital this morning. As soon as I was registered, I took the elevator to the fourth floor. The nurse took my vitals and started my treatment. Before leaving, my child life specialist told me about a special event. I ended up leaving 2 hours later after attending the event."}
{"input": ["Billy blows his car up"], "output": ["Billy was headed down the road.", "He heard a noise in his car.", "He ignored it and went faster.", "He decided to trace another driver on the highway.", "Billy totally blew his engine and was left on the side of the road."], "src": "Billy blows his car up", "trg": "Billy was headed down the road. He heard a noise in his car. He ignored it and went faster. He decided to trace another driver on the highway. Billy totally blew his engine and was left on the side of the road."}
{"input": ["The Botox Party"], "output": ["Glenda was invited to a spa party.", "She arrived and was surprised to see Botox being done.", "She felt uncomfortable and left.", "The next week, she saw all the party attendees.", "Their faces were frozen and strange looking."], "src": "The Botox Party", "trg": "Glenda was invited to a spa party. She arrived and was surprised to see Botox being done. She felt uncomfortable and left. The next week, she saw all the party attendees. Their faces were frozen and strange looking."}
{"input": ["Death Of A Marching Band"], "output": ["The school's marching band practiced for the game all week.", "They put in extra hours every night to perfect their routine.", "The day of the big game finally arrived!", "The whole band piled onto the bus, giddy with excitement.", "The bus spiraled off the road, killing everyone on it."], "src": "Death Of A Marching Band", "trg": "The school's marching band practiced for the game all week. They put in extra hours every night to perfect their routine. The day of the big game finally arrived! The whole band piled onto the bus, giddy with excitement. The bus spiraled off the road, killing everyone on it."}
{"input": ["He believed in him."], "output": ["Mario wanted to play tennis professionally.", "He asked his father to help him.", "His father thought it was a waste of time however.", "His brother believed in him and taught him.", "As a result, Mario actually became pretty good."], "src": "He believed in him.", "trg": "Mario wanted to play tennis professionally. He asked his father to help him. His father thought it was a waste of time however. His brother believed in him and taught him. As a result, Mario actually became pretty good."}
{"input": ["Replacing an Old Computer"], "output": ["James was playing video games on his computer.", "The game on his computer was running very slow.", "He realized it was due to his aging computer.", "James bought a brand new gaming computer from Best Buy.", "James was able to play his video game without any lag afterwards."], "src": "Replacing an Old Computer", "trg": "James was playing video games on his computer. The game on his computer was running very slow. He realized it was due to his aging computer. James bought a brand new gaming computer from Best Buy. James was able to play his video game without any lag afterwards."}
{"input": ["Custody"], "output": ["My sister in law's granddaughter lives in Maine.", "She has four children by three different men.", "Three weeks ago, Maine social services took custody of the children.", "The children, 11 to 2, had been left alone.", "My sister in law has taken temporary custody of the children."], "src": "Custody", "trg": "My sister in law's granddaughter lives in Maine. She has four children by three different men. Three weeks ago, Maine social services took custody of the children. The children, 11 to 2, had been left alone. My sister in law has taken temporary custody of the children."}
{"input": ["Dinner Time"], "output": ["John and Jane went out to dinner.", "They sat at the table and placed their order.", "The waiter brought them their food.", "John accidentally knocked over his plate!", "John had to clean up all of the food that he spilled."], "src": "Dinner Time", "trg": "John and Jane went out to dinner. They sat at the table and placed their order. The waiter brought them their food. John accidentally knocked over his plate! John had to clean up all of the food that he spilled."}
{"input": ["The Interview"], "output": ["The chef was preparing for a job interview.", "He practiced making his amazing appetizers.", "He served some to the owners of the restaurant.", "They loved them!", "The chef was hired immediately."], "src": "The Interview", "trg": "The chef was preparing for a job interview. He practiced making his amazing appetizers. He served some to the owners of the restaurant. They loved them! The chef was hired immediately."}
{"input": ["Lawn Getting Mowed"], "output": ["Larry sat on the porch.", "He yelled to his friend as he drove by.", "His friend sat on the porch with Larry.", "Larry's friend told him a great story.", "The story inspired Larry to mow the lawn."], "src": "Lawn Getting Mowed", "trg": "Larry sat on the porch. He yelled to his friend as he drove by. His friend sat on the porch with Larry. Larry's friend told him a great story. The story inspired Larry to mow the lawn."}
{"input": ["Lone Girl"], "output": ["Dessie wanted to meet a new mate.", "She went through many dating sites to no avail.", "Finally, she gave up and went to the library.", "Surprisingly, she met a handsome guy there and they exchanged numbers.", "After a few weeks, they were together in a relationship."], "src": "Lone Girl", "trg": "Dessie wanted to meet a new mate. She went through many dating sites to no avail. Finally, she gave up and went to the library. Surprisingly, she met a handsome guy there and they exchanged numbers. After a few weeks, they were together in a relationship."}
{"input": ["Eggplant Parmesan"], "output": ["Mary sliced the purple eggplant.", "Then she breaded each slice carefully before frying them.", "She layered each breaded slice into her casserole dish.", "She poured homemade marinara sauce in the dish.", "Finally, she sprinkled parmesan cheese on top and baked it."], "src": "Eggplant Parmesan", "trg": "Mary sliced the purple eggplant. Then she breaded each slice carefully before frying them. She layered each breaded slice into her casserole dish. She poured homemade marinara sauce in the dish. Finally, she sprinkled parmesan cheese on top and baked it."}
{"input": ["New Foods"], "output": ["Sophia was a picky eater.", "She only liked certain foods.", "Her mother decided to introduce new foods gradually.", "Initially, Sophia would not eat the new food.", "Eventually, she got used to trying different types of foods."], "src": "New Foods", "trg": "Sophia was a picky eater. She only liked certain foods. Her mother decided to introduce new foods gradually. Initially, Sophia would not eat the new food. Eventually, she got used to trying different types of foods."}
{"input": ["Legit Uni"], "output": ["Jim applied to college in another state.", "He had never lived by himself before.", "Jim's parents promised they'd help him move.", "He thought his worries were over then.", "Jim found out the university was a shill."], "src": "Legit Uni", "trg": "Jim applied to college in another state. He had never lived by himself before. Jim's parents promised they'd help him move. He thought his worries were over then. Jim found out the university was a shill."}
{"input": ["Lost Dog"], "output": ["The jenkins family were worried sick.", "Their dog Bandit had been missing for weeks.", "They had all but lost hope at ever finding him again.", "They posted flyers all throughout the town.", "Until one day their phone rang and someone said they had found Bandit!"], "src": "Lost Dog", "trg": "The jenkins family were worried sick. Their dog Bandit had been missing for weeks. They had all but lost hope at ever finding him again. They posted flyers all throughout the town. Until one day their phone rang and someone said they had found Bandit!"}
{"input": ["A new pet"], "output": ["A little girl asked for a pet for her birthday.", "She did not know what kind of pet she wanted.", "Her parents surprised her and bought her a puppy.", "They gave her the puppy after her other gifts.", "The girl was very happy with her new pet."], "src": "A new pet", "trg": "A little girl asked for a pet for her birthday. She did not know what kind of pet she wanted. Her parents surprised her and bought her a puppy. They gave her the puppy after her other gifts. The girl was very happy with her new pet."}
{"input": ["The King Wins"], "output": ["There was a war in the kingdom.", "A rival kingdom wanted to take the king's land.", "The king sent many troops into the war.", "The king and his people rose above the evil forces.", "The king and his army was victorious in their defense."], "src": "The King Wins", "trg": "There was a war in the kingdom. A rival kingdom wanted to take the king's land. The king sent many troops into the war. The king and his people rose above the evil forces. The king and his army was victorious in their defense."}
{"input": ["National Parks"], "output": ["The family made it their goal to go to twenty national parks.", "They drove around all summer.", "They visited about half of their goal that year.", "They plan on trying again next summer.", "They made a lot of memories doing it."], "src": "National Parks", "trg": "The family made it their goal to go to twenty national parks. They drove around all summer. They visited about half of their goal that year. They plan on trying again next summer. They made a lot of memories doing it."}
{"input": ["The Snowstorm"], "output": ["The snow was piling up outside.", "The weatherman said it would continue all night.", "The kids were hoping they would get a snowday.", "The next morning, there were huge drifts in the street.", "School was cancelled for the day!"], "src": "The Snowstorm", "trg": "The snow was piling up outside. The weatherman said it would continue all night. The kids were hoping they would get a snowday. The next morning, there were huge drifts in the street. School was cancelled for the day!"}
{"input": ["Train Sets are Boring"], "output": ["Thomas bought a train set.", "His father helped him set it up in the garage.", "They ran the train around the track for a few minutes.", "Thomas thought that it was pretty boring.", "He gave the train set to his neighbor the next day."], "src": "Train Sets are Boring", "trg": "Thomas bought a train set. His father helped him set it up in the garage. They ran the train around the track for a few minutes. Thomas thought that it was pretty boring. He gave the train set to his neighbor the next day."}
{"input": ["Video games with my friends"], "output": ["A few years ago, me and some friends decided to play video games.", "We brought over all our consoles to my friends house.", "We set them up in the living room together.", "We played video games all night that night.", "I had a great time playing video games with my friends."], "src": "Video games with my friends", "trg": "A few years ago, me and some friends decided to play video games. We brought over all our consoles to my friends house. We set them up in the living room together. We played video games all night that night. I had a great time playing video games with my friends."}
{"input": ["Best man needed"], "output": ["Lawrence was going to get married.", "His life was going great.", "Just one thing was missing.", "He needed a best man.", "He found his long lost best friend through Facebook and asked him."], "src": "Best man needed", "trg": "Lawrence was going to get married. His life was going great. Just one thing was missing. He needed a best man. He found his long lost best friend through Facebook and asked him."}
{"input": ["James' Job"], "output": ["James just turned sixteen years old.", "His dad told him that he needs to get a job.", "James decides to go to Walmart to fill out an application.", "He fills out the application and gets the job.", "James now has a job."], "src": "James' Job", "trg": "James just turned sixteen years old. His dad told him that he needs to get a job. James decides to go to Walmart to fill out an application. He fills out the application and gets the job. James now has a job."}
{"input": ["The Polygraph"], "output": ["Richard was accused of assaulting a woman.", "He denied it.", "He took a polygraph test.", "He passed with flying colors.", "The charges were soon dropped."], "src": "The Polygraph", "trg": "Richard was accused of assaulting a woman. He denied it. He took a polygraph test. He passed with flying colors. The charges were soon dropped."}
{"input": ["Molly's Big Raise"], "output": ["Molly had been working at the same job for years.", "She worked hard and was well respected.", "Molly wanted a raise but was anxious about asking for one.", "One day, she gathered the courage to ask her boss for a raise.", "She got her raise, and was happy and self-assured."], "src": "Molly's Big Raise", "trg": "Molly had been working at the same job for years. She worked hard and was well respected. Molly wanted a raise but was anxious about asking for one. One day, she gathered the courage to ask her boss for a raise. She got her raise, and was happy and self-assured."}
{"input": ["Joe the Concierge"], "output": ["We had a new concierge for the 3 to 11 pm shift.", "Joe was quiet and looked tough.", "He took a lot of breaks, and was not at his desk often.", "He also did not like to record incoming deliveries.", "After receiving a lot of complaints, the management fired Joe."], "src": "Joe the Concierge", "trg": "We had a new concierge for the 3 to 11 pm shift. Joe was quiet and looked tough. He took a lot of breaks, and was not at his desk often. He also did not like to record incoming deliveries. After receiving a lot of complaints, the management fired Joe."}
{"input": ["Baby Shower"], "output": ["Angelique decided to throw a baby shower for expected baby girl.", "She bought invitations and invited all of her friends.", "She got decorations, and ordered a cake for the event.", "She bought a new dress to wear to the shower.", "On the day of the shower, her friends and family gave her many gifts."], "src": "Baby Shower", "trg": "Angelique decided to throw a baby shower for expected baby girl. She bought invitations and invited all of her friends. She got decorations, and ordered a cake for the event. She bought a new dress to wear to the shower. On the day of the shower, her friends and family gave her many gifts."}
{"input": ["Dishonesty"], "output": ["Silvia had to give a big speech at work.", "She asked her friend Albert to listen to it and give his opinion.", "Albert listened to the speech but wasn't convinced it was good.", "Despite his own dislike for the speech, he complimented Silvia.", "Silvia made her speech and looked like a fool without knowing why."], "src": "Dishonesty", "trg": "Silvia had to give a big speech at work. She asked her friend Albert to listen to it and give his opinion. Albert listened to the speech but wasn't convinced it was good. Despite his own dislike for the speech, he complimented Silvia. Silvia made her speech and looked like a fool without knowing why."}
{"input": ["The Waffles"], "output": ["Tony made a huge batch of waffles.", "He called his family to the breakfast table.", "They all gobbled them up.", "They told Tony to make waffles every Saturday morning.", "He was happy to make it a tradition!"], "src": "The Waffles", "trg": "Tony made a huge batch of waffles. He called his family to the breakfast table. They all gobbled them up. They told Tony to make waffles every Saturday morning. He was happy to make it a tradition!"}
{"input": ["Water"], "output": ["Determined to drink more water, I carried a water bottle everywhere.", "One thing that I have omitted is making the sure the bottle is closed.", "One time, I put the bottle of water in my bag with the cap off.", "I soon discovered the water had soaked my books completely.", "Fortunately, my books were still readable after that event."], "src": "Water", "trg": "Determined to drink more water, I carried a water bottle everywhere. One thing that I have omitted is making the sure the bottle is closed. One time, I put the bottle of water in my bag with the cap off. I soon discovered the water had soaked my books completely. Fortunately, my books were still readable after that event."}
{"input": ["The Pharmacy"], "output": ["Kari decided she wanted to be a pharmacist.", "She took an internship at a local pharmacy.", "On the third day, she was so bored that she just walked out.", "She decided it was not the occupation for her.", "Next, she considered being a dancer."], "src": "The Pharmacy", "trg": "Kari decided she wanted to be a pharmacist. She took an internship at a local pharmacy. On the third day, she was so bored that she just walked out. She decided it was not the occupation for her. Next, she considered being a dancer."}
{"input": ["Decked"], "output": ["Bob's foot crashed through the rotted board.", "He looked with dismay and noticed they were all rotting.", "Bob called a handyman for an estimate to replace it all.", "The handyman quoted him a very reasonable amount to do the job.", "Bob agreed to the price and went inside to prop his foot up."], "src": "Decked", "trg": "Bob's foot crashed through the rotted board. He looked with dismay and noticed they were all rotting. Bob called a handyman for an estimate to replace it all. The handyman quoted him a very reasonable amount to do the job. Bob agreed to the price and went inside to prop his foot up."}
{"input": ["Roberto's Job Search"], "output": ["Roberto moved to New York City to be with his girlfriend of 4 years.", "He moved in with her and her family.", "Her dad told him if he didn't find a job he would have to leave.", "He interviewed for several positions but didn't get any of them.", "With no place to live, he had to move back to California."], "src": "Roberto's Job Search", "trg": "Roberto moved to New York City to be with his girlfriend of 4 years. He moved in with her and her family. Her dad told him if he didn't find a job he would have to leave. He interviewed for several positions but didn't get any of them. With no place to live, he had to move back to California."}
{"input": ["Anniversary Gift"], "output": ["James wanted to buy his wife a nice anniversary gift.", "He asked his boss if he could work some overtime to pay for it.", "James ended up working six days a week for three weeks straight.", "He was very happy when he saw his paycheck with the overtime on it.", "James went to the store and bought his wife a diamond necklace."], "src": "Anniversary Gift", "trg": "James wanted to buy his wife a nice anniversary gift. He asked his boss if he could work some overtime to pay for it. James ended up working six days a week for three weeks straight. He was very happy when he saw his paycheck with the overtime on it. James went to the store and bought his wife a diamond necklace."}
{"input": ["The Steakhouse"], "output": ["The couple dined at a new steakhouse.", "THey each got huge cuts of meat.", "THey couldn't finish their steaks.", "They were happy until they saw the bill.", "It had cost $400!"], "src": "The Steakhouse", "trg": "The couple dined at a new steakhouse. THey each got huge cuts of meat. THey couldn't finish their steaks. They were happy until they saw the bill. It had cost $400!"}
{"input": ["Coaster Time"], "output": ["Beth and her family went to the amusement park.", "Beth was nervous to ride the big roller coaster.", "She was afraid she would get sick from the ride.", "Beth faced her fears and rode the coaster.", "It was so much fun, she decided to come back the next day."], "src": "Coaster Time", "trg": "Beth and her family went to the amusement park. Beth was nervous to ride the big roller coaster. She was afraid she would get sick from the ride. Beth faced her fears and rode the coaster. It was so much fun, she decided to come back the next day."}
{"input": ["The Itinerary"], "output": ["The parents were planning a trip.", "They wanted to take their kids someplace exotic.", "They couldn't agree on a spot.", "They flipped a coin and the wife won.", "They'd be going to Italy!"], "src": "The Itinerary", "trg": "The parents were planning a trip. They wanted to take their kids someplace exotic. They couldn't agree on a spot. They flipped a coin and the wife won. They'd be going to Italy!"}
{"input": ["Maureen Plays Golf"], "output": ["Maureen had always wanted to learn how to play golf.", "However, she was worried it would be hard.", "She practiced golf every day for a year.", "Finally she was a golf expert.", "Maureen was happy she had learned how to play golf."], "src": "Maureen Plays Golf", "trg": "Maureen had always wanted to learn how to play golf. However, she was worried it would be hard. She practiced golf every day for a year. Finally she was a golf expert. Maureen was happy she had learned how to play golf."}
{"input": ["Ted breaks down"], "output": ["Ted is driving his car down the road.", "He starts to feel a bad rumble.", "He pulls over to check it out.", "There was a nail in his tire.", "Ted couldn't believe his luck as he called triple a."], "src": "Ted breaks down", "trg": "Ted is driving his car down the road. He starts to feel a bad rumble. He pulls over to check it out. There was a nail in his tire. Ted couldn't believe his luck as he called triple a."}
{"input": ["Denver"], "output": ["My friend Jess texted me some photos of Denver.", "She was visiting from NH and was at Union Station.", "She knew I loved trains and sent me some photos.", "I thanked her very much and asked how she was doing.", "She said she loved being in Denver."], "src": "Denver", "trg": "My friend Jess texted me some photos of Denver. She was visiting from NH and was at Union Station. She knew I loved trains and sent me some photos. I thanked her very much and asked how she was doing. She said she loved being in Denver."}
{"input": ["Terrified"], "output": ["When I was young I went to a slumber party at my friend Tim's house.", "There was a giant thunderstorm that night.", "Tim had a fear of lightning.", "Every time the sky flashed he hid under his bed.", "I never stayed at Tim's again."], "src": "Terrified", "trg": "When I was young I went to a slumber party at my friend Tim's house. There was a giant thunderstorm that night. Tim had a fear of lightning. Every time the sky flashed he hid under his bed. I never stayed at Tim's again."}
{"input": ["Tim and Katie's trip to scoops."], "output": ["Tim and Katie were enjoying their beach vacation.", "On their way back to the hotel from the beach, Katie spotted Scoops.", "Scoops was an ice cream shop in a building shaped like a cone.", "Katie and Tim went in for ice cream sundaes.", "They were the most delicious ice cream sundaes they ever had."], "src": "Tim and Katie's trip to scoops.", "trg": "Tim and Katie were enjoying their beach vacation. On their way back to the hotel from the beach, Katie spotted Scoops. Scoops was an ice cream shop in a building shaped like a cone. Katie and Tim went in for ice cream sundaes. They were the most delicious ice cream sundaes they ever had."}
{"input": ["The Goal Dress"], "output": ["Shayla was asked to be a bridesmaid at her friend's wedding.", "Shayla was excited but also nervous because she was fat.", "She bought a goal dress and worked hard to lose weight.", "The day of the wedding came.", "Shayla was proud that she could finally fit into the dress."], "src": "The Goal Dress", "trg": "Shayla was asked to be a bridesmaid at her friend's wedding. Shayla was excited but also nervous because she was fat. She bought a goal dress and worked hard to lose weight. The day of the wedding came. Shayla was proud that she could finally fit into the dress."}
{"input": ["The Putt"], "output": ["It had all come down to this.", "Ken was on the last hole of the course.", "The ball was 10 feet from the cup and he needed the putt to win.", "He set up and practiced his swing.", "He hit the putt and sunk it!"], "src": "The Putt", "trg": "It had all come down to this. Ken was on the last hole of the course. The ball was 10 feet from the cup and he needed the putt to win. He set up and practiced his swing. He hit the putt and sunk it!"}
{"input": ["Freshman Fears"], "output": ["My coworker's daughter started high school in September.", "She was a good soccer player in middle school.", "She went to try out for junior varsity soccer.", "When she got to the field she froze and did not try.", "My coworker said his daughter was just too afraid."], "src": "Freshman Fears", "trg": "My coworker's daughter started high school in September. She was a good soccer player in middle school. She went to try out for junior varsity soccer. When she got to the field she froze and did not try. My coworker said his daughter was just too afraid."}
{"input": ["Traveling"], "output": ["Ross wanted to try something new.", "He wanted to take a new job in Vietnam.", "Ross was scared to get to Vietnam because he was terrified to fly.", "Ross attended therapy for 2 months before he felt ready to fly.", "Ross made it through the entire flight with no anxiety."], "src": "Traveling", "trg": "Ross wanted to try something new. He wanted to take a new job in Vietnam. Ross was scared to get to Vietnam because he was terrified to fly. Ross attended therapy for 2 months before he felt ready to fly. Ross made it through the entire flight with no anxiety."}
{"input": ["Buying a computer"], "output": ["Melissa drove to the local computer shop to see what they had.", "As she walked in the door, the clerk on staff greeted her.", "They walked around while Melissa asked a number of questions.", "In about 30 minutes, she decided on a mid-range desktop.", "She paid the cashier and left the store with the computer in hand."], "src": "Buying a computer", "trg": "Melissa drove to the local computer shop to see what they had. As she walked in the door, the clerk on staff greeted her. They walked around while Melissa asked a number of questions. In about 30 minutes, she decided on a mid-range desktop. She paid the cashier and left the store with the computer in hand."}
{"input": ["A Day at the Races"], "output": ["Julia and her boyfriend Hank were going to the races.", "Neither of them had been to a horse race before.", "They day came and they went to the race.", "They loved all the pomp and circumstance of the races.", "It was a wonderful time that they would not forget soon."], "src": "A Day at the Races", "trg": "Julia and her boyfriend Hank were going to the races. Neither of them had been to a horse race before. They day came and they went to the race. They loved all the pomp and circumstance of the races. It was a wonderful time that they would not forget soon."}
{"input": ["Death of a Maple"], "output": ["My parents planted a maple tree on the day that I was born.", "Every time they saw the tree growing taller, they thought of me.", "By the time I left for college, the tree was taller than their house.", "But the maple tree was rotted from disease.", "My parents cried as they cut their beloved tree down."], "src": "Death of a Maple", "trg": "My parents planted a maple tree on the day that I was born. Every time they saw the tree growing taller, they thought of me. By the time I left for college, the tree was taller than their house. But the maple tree was rotted from disease. My parents cried as they cut their beloved tree down."}
{"input": ["The Snake"], "output": ["Emilia was walking by the pond.", "She thought she was stepping over a big stick.", "The stick moved!", "It was a giant snake.", "She ran away screaming."], "src": "The Snake", "trg": "Emilia was walking by the pond. She thought she was stepping over a big stick. The stick moved! It was a giant snake. She ran away screaming."}
{"input": ["The Tree"], "output": ["Ann planted a tree when she was very young.", "As she aged, the tree did, too.", "When she graduated from high school, the tree was twenty feet tall.", "Ann moved away a long time ago.", "When she visited last week, she drove by again to see how tall it is."], "src": "The Tree", "trg": "Ann planted a tree when she was very young. As she aged, the tree did, too. When she graduated from high school, the tree was twenty feet tall. Ann moved away a long time ago. When she visited last week, she drove by again to see how tall it is."}
{"input": ["Jude's Guitar"], "output": ["Jude thought he was a great guitar player.", "He took lessons from his friend Ryan.", "Ryan told him he needed to practice much more to be great.", "Jude was determined to practice every spare second he had.", "A few weeks later, Ryan loved how Jude played!"], "src": "Jude's Guitar", "trg": "Jude thought he was a great guitar player. He took lessons from his friend Ryan. Ryan told him he needed to practice much more to be great. Jude was determined to practice every spare second he had. A few weeks later, Ryan loved how Jude played!"}
{"input": ["A New Job"], "output": ["Dan recently had his second interview with a law firm.", "Dan had been waiting for a week to hear about being hired.", "As Dan was about to start his job search again, Dan's phone rang.", "Dan answered the phone, and got the news that he had got the job!", "Dan was so elated that he would be the new lawyer at the firm."], "src": "A New Job", "trg": "Dan recently had his second interview with a law firm. Dan had been waiting for a week to hear about being hired. As Dan was about to start his job search again, Dan's phone rang. Dan answered the phone, and got the news that he had got the job! Dan was so elated that he would be the new lawyer at the firm."}
{"input": ["Work Lunch"], "output": ["Someone kept taking Kayla's work lunch from the office fridge.", "Kayla wanted to find a way to stop the lunch thief.", "She decided to make the most disgusting lunch she could.", "The man that stole her lunch had to go home sick!", "Nobody touched Kayla's lunch ever again."], "src": "Work Lunch", "trg": "Someone kept taking Kayla's work lunch from the office fridge. Kayla wanted to find a way to stop the lunch thief. She decided to make the most disgusting lunch she could. The man that stole her lunch had to go home sick! Nobody touched Kayla's lunch ever again."}
{"input": ["John Makes A Sandwich"], "output": ["John realizes that he hasn't eaten anything all morning.", "He is beginning to feel hungry.", "John decides to make himself a sandwich to eat.", "He fills the sandwich with meat and vegetables.", "John is glad that he got something to eat this morning."], "src": "John Makes A Sandwich", "trg": "John realizes that he hasn't eaten anything all morning. He is beginning to feel hungry. John decides to make himself a sandwich to eat. He fills the sandwich with meat and vegetables. John is glad that he got something to eat this morning."}
{"input": ["Beauty Salon"], "output": ["Cathy recently graduated from beauty school.", "One day on her walk, Cathy saw a help wanted sign at a hair salon.", "Cathy decided to fill out an application for the job.", "A week later, Cathy was called for an interview at the salon.", "Cathy did so well at the interview, that they hired her on the spot."], "src": "Beauty Salon", "trg": "Cathy recently graduated from beauty school. One day on her walk, Cathy saw a help wanted sign at a hair salon. Cathy decided to fill out an application for the job. A week later, Cathy was called for an interview at the salon. Cathy did so well at the interview, that they hired her on the spot."}
{"input": ["Rainy Day Kitties"], "output": ["The cats were yowling at the door to be let out.", "When the door opened and they saw the rain, they stopped dead.", "They looked out at the rain falling in apparent disgust.", "They quickly backed away from the door and the rain.", "Curling up in a ball, they slept until the rain ended."], "src": "Rainy Day Kitties", "trg": "The cats were yowling at the door to be let out. When the door opened and they saw the rain, they stopped dead. They looked out at the rain falling in apparent disgust. They quickly backed away from the door and the rain. Curling up in a ball, they slept until the rain ended."}
{"input": ["Pokemon Hunters"], "output": ["The kids all gathered to play Pokemon Go.", "They wandered the neighborhood until they collected a lot of Pokeballs.", "When they got home, their parents were mad.", "They didn't know where they'd gone!", "The kids were grounded from their phones."], "src": "Pokemon Hunters", "trg": "The kids all gathered to play Pokemon Go. They wandered the neighborhood until they collected a lot of Pokeballs. When they got home, their parents were mad. They didn't know where they'd gone! The kids were grounded from their phones."}
{"input": ["Roller Derby Team"], "output": ["Bailey had been an avid roller derby fan.", "She longed for the day she could be on a team.", "Recently, Bailey saw a flyer for roller derby team auditions.", "Bailey decided she would sign up for the team auditions.", "Bailey was excited to audition for the roller derby team."], "src": "Roller Derby Team", "trg": "Bailey had been an avid roller derby fan. She longed for the day she could be on a team. Recently, Bailey saw a flyer for roller derby team auditions. Bailey decided she would sign up for the team auditions. Bailey was excited to audition for the roller derby team."}
{"input": ["The Leak"], "output": ["Tommy noticed a pipe was leaking a little bit.", "He went upstairs that night and took a shower.", "When he came down later, he noticed a water spot on the ceiling.", "He didn't know what to do, so he ignored it.", "The next day, the ceiling came crashing down!"], "src": "The Leak", "trg": "Tommy noticed a pipe was leaking a little bit. He went upstairs that night and took a shower. When he came down later, he noticed a water spot on the ceiling. He didn't know what to do, so he ignored it. The next day, the ceiling came crashing down!"}
{"input": ["Maria Talks About Momo"], "output": ["Maria went inside and put her takeaway on the kitchen table.", "Maria's boyfriend saw Maria's takeaway and asked what she bought.", "Maria said that she went to the new Nepalese restaurant and got momo.", "Maria's boyfriend asked her what momo are.", "Maria told him they're like Chinese dumplings, but a little different."], "src": "Maria Talks About Momo", "trg": "Maria went inside and put her takeaway on the kitchen table. Maria's boyfriend saw Maria's takeaway and asked what she bought. Maria said that she went to the new Nepalese restaurant and got momo. Maria's boyfriend asked her what momo are. Maria told him they're like Chinese dumplings, but a little different."}
{"input": ["The red coat"], "output": ["Ben wanted a new coat for winter.", "He couldn't make up his mind what color he wanted.", "Until one day walking down the street with his friend.", "He saw it the red coat of his dreams.", "Ben knew he had to have it and rushed into the store to buy it."], "src": "The red coat", "trg": "Ben wanted a new coat for winter. He couldn't make up his mind what color he wanted. Until one day walking down the street with his friend. He saw it the red coat of his dreams. Ben knew he had to have it and rushed into the store to buy it."}
{"input": ["Flight to the Moon"], "output": ["Lawrence always wanted to be an astronaut.", "He trained and studied hard.", "He passed the astronaut test on the first try.", "He was overjoyed to learn that his first mission would be to the moon.", "Lawrence flew to the moon and back on the spaceship."], "src": "Flight to the Moon", "trg": "Lawrence always wanted to be an astronaut. He trained and studied hard. He passed the astronaut test on the first try. He was overjoyed to learn that his first mission would be to the moon. Lawrence flew to the moon and back on the spaceship."}
{"input": ["The Pasta"], "output": ["Mario had perfected his pasta recipe.", "He wouldn't tell anyone what made it so special.", "One day, a girl peeked into the kitchen and saw him using cinnamon.", "She told everyone in town.", "Soon, they could all make pasta just like Mario!"], "src": "The Pasta", "trg": "Mario had perfected his pasta recipe. He wouldn't tell anyone what made it so special. One day, a girl peeked into the kitchen and saw him using cinnamon. She told everyone in town. Soon, they could all make pasta just like Mario!"}
{"input": ["Broken hearted"], "output": ["Mark did not want to go to work today.", "Yesterday, Mark was dumped by his girlfriend.", "Mark was heartbroken, because he was going to propose.", "Mark attempted to call her, but she would not answer.", "Mark felt so sad, because he is now a single man."], "src": "Broken hearted", "trg": "Mark did not want to go to work today. Yesterday, Mark was dumped by his girlfriend. Mark was heartbroken, because he was going to propose. Mark attempted to call her, but she would not answer. Mark felt so sad, because he is now a single man."}
{"input": ["Smart"], "output": ["Matt thought he was smarter than any of the other students.", "He decided to take on a very difficult programming exercise.", "Everyone in the class thought he would be able to solve it right away.", "After two nights he realized he had no idea what he was doing.", "Matt dropped the class rather than admit to failure."], "src": "Smart", "trg": "Matt thought he was smarter than any of the other students. He decided to take on a very difficult programming exercise. Everyone in the class thought he would be able to solve it right away. After two nights he realized he had no idea what he was doing. Matt dropped the class rather than admit to failure."}
{"input": ["Jeff breaks down"], "output": ["Jeff was going to his company picnic.", "His car was making a strange noise.", "He ignored it and kept driving.", "A mile from the picnic Jeff's car just stopped.", "He got outside and popped the hood and his engine was toast."], "src": "Jeff breaks down", "trg": "Jeff was going to his company picnic. His car was making a strange noise. He ignored it and kept driving. A mile from the picnic Jeff's car just stopped. He got outside and popped the hood and his engine was toast."}
{"input": ["The Garage Sale"], "output": ["The neighborhood garage sale was approaching.", "Bonnie worked to price all the things she was selling.", "She sat them out of tables in her driveway.", "Soon, hoards of shoppers appeared on the block.", "She sold everything she had out!"], "src": "The Garage Sale", "trg": "The neighborhood garage sale was approaching. Bonnie worked to price all the things she was selling. She sat them out of tables in her driveway. Soon, hoards of shoppers appeared on the block. She sold everything she had out!"}
{"input": ["Travel Dreams"], "output": ["Barry always dreamed of going to Jamaica for vacation.", "Barry recently saw an affordable vacation package to Jamaica.", "Barry decided to purchase the vacation package the next day.", "However, when Barry went to purchase the package, they were sold out.", "Barry was so disappointed that he missed out on the vacation package."], "src": "Travel Dreams", "trg": "Barry always dreamed of going to Jamaica for vacation. Barry recently saw an affordable vacation package to Jamaica. Barry decided to purchase the vacation package the next day. However, when Barry went to purchase the package, they were sold out. Barry was so disappointed that he missed out on the vacation package."}
{"input": ["The New Toy"], "output": ["Danny had been very well behaved this week.", "His mother decided he had deserved a prize.", "She took him to the local toy store and allowed him to get one thing.", "Danny chose to get a dinosaur who roared loudly.", "They went home and Danny played with his new toy all night."], "src": "The New Toy", "trg": "Danny had been very well behaved this week. His mother decided he had deserved a prize. She took him to the local toy store and allowed him to get one thing. Danny chose to get a dinosaur who roared loudly. They went home and Danny played with his new toy all night."}
{"input": ["Rain"], "output": ["Cindy just left the house to go for a run.", "She was on mile two when it started to get dark.", "She did not think remember any rain in the forecast so she kept going.", "By mile four, the bottom had fallen out.", "When Cindy got home she was completely soaked."], "src": "Rain", "trg": "Cindy just left the house to go for a run. She was on mile two when it started to get dark. She did not think remember any rain in the forecast so she kept going. By mile four, the bottom had fallen out. When Cindy got home she was completely soaked."}
{"input": ["The Couch"], "output": ["Ross was moving across town.", "He had a huge couch that he needed to move.", "He asked five friends to help him.", "They all carried a side and lugged it down the stairs.", "It took them an hour to get it in the truck!"], "src": "The Couch", "trg": "Ross was moving across town. He had a huge couch that he needed to move. He asked five friends to help him. They all carried a side and lugged it down the stairs. It took them an hour to get it in the truck!"}
{"input": ["New Video Game"], "output": ["John wanted the latest new video game.", "He didn't have enough money.", "He decided to get a job at the grocery store.", "His first paycheck gave him enough money to get the game!", "John was very happy to get to play his new game."], "src": "New Video Game", "trg": "John wanted the latest new video game. He didn't have enough money. He decided to get a job at the grocery store. His first paycheck gave him enough money to get the game! John was very happy to get to play his new game."}
{"input": ["Dinner with coworkers"], "output": ["On May 18th, my wife and I had dinner with 3 of my former coworkers.", "I am retired but still stay in touch.", "We met at Salvatore's, an Italian restaurant in downtown Boston.", "We had no reservations and had to sit at the bar.", "We had a great time catching up, and vowed to meet soon."], "src": "Dinner with coworkers", "trg": "On May 18th, my wife and I had dinner with 3 of my former coworkers. I am retired but still stay in touch. We met at Salvatore's, an Italian restaurant in downtown Boston. We had no reservations and had to sit at the bar. We had a great time catching up, and vowed to meet soon."}
{"input": ["Tom's Life in Ohio"], "output": ["Tom met his ex-boyfriend online when he was 16.", "He moved to Ohio to live with him.", "Tom went to college and made lots of friends.", "They broke up after 5 years together.", "Tom stayed in Ohio because of the life he had built there."], "src": "Tom's Life in Ohio", "trg": "Tom met his ex-boyfriend online when he was 16. He moved to Ohio to live with him. Tom went to college and made lots of friends. They broke up after 5 years together. Tom stayed in Ohio because of the life he had built there."}
{"input": ["Sarah's Little Succulents"], "output": ["Sarah really likes to take care of succulents.", "She thinks they're adorable little plants.", "While shopping, she found a neglected little succulent.", "She decided to buy the plant and bring it home to nurse it.", "Now the plant is doing really well and has several young sprouts."], "src": "Sarah's Little Succulents", "trg": "Sarah really likes to take care of succulents. She thinks they're adorable little plants. While shopping, she found a neglected little succulent. She decided to buy the plant and bring it home to nurse it. Now the plant is doing really well and has several young sprouts."}
{"input": ["On Time"], "output": ["Rhonda was already late when heading to the airport for a flight.", "On the way, an accident caused heavy traffic.", "The traffic let up but then she came across a parade event.", "Rhonda thought the world was against her but was determined.", "She made it to the gate right as they were about to close the door."], "src": "On Time", "trg": "Rhonda was already late when heading to the airport for a flight. On the way, an accident caused heavy traffic. The traffic let up but then she came across a parade event. Rhonda thought the world was against her but was determined. She made it to the gate right as they were about to close the door."}
{"input": ["New Job"], "output": ["I remember when I started working at my current job.", "The first day was very scary.", "I had never worked at a place like this before.", "After a few weeks I got used to this sort of work.", "Now, I love working here and I don't want to leave."], "src": "New Job", "trg": "I remember when I started working at my current job. The first day was very scary. I had never worked at a place like this before. After a few weeks I got used to this sort of work. Now, I love working here and I don't want to leave."}
{"input": ["Moving"], "output": ["Kay met Chad online.", "Kay and chad grew close.", "Kay decided to move across the country to live with Chad.", "Kay rented a Uhaul and drove across the country.", "Kay now happily lives with Chad."], "src": "Moving", "trg": "Kay met Chad online. Kay and chad grew close. Kay decided to move across the country to live with Chad. Kay rented a Uhaul and drove across the country. Kay now happily lives with Chad."}
{"input": ["The Vacation House"], "output": ["Bob took his family to their vacation house.", "They arrived and went to the beach.", "At the beach, Bob got a nasty sunburn.", "His wife scolded him for not wearing sunscreen.", "The burn was so bad, it ruined his vacation."], "src": "The Vacation House", "trg": "Bob took his family to their vacation house. They arrived and went to the beach. At the beach, Bob got a nasty sunburn. His wife scolded him for not wearing sunscreen. The burn was so bad, it ruined his vacation."}
{"input": ["Miley's car is toast"], "output": ["Miley was on a road trip.", "She was having a great time driving across the country.", "Suddenly she heard a loud ticking noise.", "She pulled over to see what was wrong.", "Miley called her dad for help with her overheating car."], "src": "Miley's car is toast", "trg": "Miley was on a road trip. She was having a great time driving across the country. Suddenly she heard a loud ticking noise. She pulled over to see what was wrong. Miley called her dad for help with her overheating car."}
{"input": ["Jackie's Cookies"], "output": ["Every evening, Jackie ate cookies after dinner.", "Her favorite cookies were chocolate chip.", "One day, she accidentally bought cookies with raisins.", "She didn't enjoy the taste of those cookies at all.", "Jackie decided to give the raisin cookies to her neighbors."], "src": "Jackie's Cookies", "trg": "Every evening, Jackie ate cookies after dinner. Her favorite cookies were chocolate chip. One day, she accidentally bought cookies with raisins. She didn't enjoy the taste of those cookies at all. Jackie decided to give the raisin cookies to her neighbors."}
{"input": ["Crusty"], "output": ["Ana liked to chew on the cap of her pen.", "When she went to the dentist he made a surprised exclamation.", "He found blue plastic coating the tops of her teeth!", "The dentist cleaned Ana's teeth and got all the plastic off them.", "He then told her she really needed to stop chewing on her pens."], "src": "Crusty", "trg": "Ana liked to chew on the cap of her pen. When she went to the dentist he made a surprised exclamation. He found blue plastic coating the tops of her teeth! The dentist cleaned Ana's teeth and got all the plastic off them. He then told her she really needed to stop chewing on her pens."}
{"input": ["Mature Lady"], "output": ["I confessed to my friend that I loved her.", "When she said that she didn't have the same feelings, I was mad.", "I ended up yelling her and ran away.", "Ironically, she gave me a small hug when we saw each other again.", "I isolated her from the crowd and apologized to her."], "src": "Mature Lady", "trg": "I confessed to my friend that I loved her. When she said that she didn't have the same feelings, I was mad. I ended up yelling her and ran away. Ironically, she gave me a small hug when we saw each other again. I isolated her from the crowd and apologized to her."}
{"input": ["The Fundraiser"], "output": ["The committee wanted to raise $1000 for the new playground balls.", "They had a bake sale.", "At the end of the day, they counted all their money.", "They had reached their goal!", "They went and bought the new balls the next day."], "src": "The Fundraiser", "trg": "The committee wanted to raise $1000 for the new playground balls. They had a bake sale. At the end of the day, they counted all their money. They had reached their goal! They went and bought the new balls the next day."}
{"input": ["Bad Kitten"], "output": ["I got a new kitten.", "The kitten was bad.", "It ate my shoes.", "I then trained it to be good.", "It was a good kitten from then on."], "src": "Bad Kitten", "trg": "I got a new kitten. The kitten was bad. It ate my shoes. I then trained it to be good. It was a good kitten from then on."}
{"input": ["The Dentist"], "output": ["Billy never brushed his teeth.", "He also ate lots of candy.", "Billy ended up with cavities.", "The dentist gave Billy lots of fillings.", "Billy brushes his teeth regularly now."], "src": "The Dentist", "trg": "Billy never brushed his teeth. He also ate lots of candy. Billy ended up with cavities. The dentist gave Billy lots of fillings. Billy brushes his teeth regularly now."}
{"input": ["Allergic reaction"], "output": ["Jill was outside playing.", "All of a sudden she was stung by a bee.", "Her arm became very swollen and red.", "Jill had to go to the hospital.", "She was having an allergic reaction to the bee sting."], "src": "Allergic reaction", "trg": "Jill was outside playing. All of a sudden she was stung by a bee. Her arm became very swollen and red. Jill had to go to the hospital. She was having an allergic reaction to the bee sting."}
{"input": ["Trouble"], "output": ["Jane couldn't understand why she was in time out.", "She looked around her room where all the toys were still on the floor.", "Her mom wanted her to pick them up before dinner.", "Jane though had just played with the toys.", "Jane decided to pick up her toys and then apologized to her mom."], "src": "Trouble", "trg": "Jane couldn't understand why she was in time out. She looked around her room where all the toys were still on the floor. Her mom wanted her to pick them up before dinner. Jane though had just played with the toys. Jane decided to pick up her toys and then apologized to her mom."}
{"input": ["Long Hair"], "output": ["I have had long hair most of my life.", "I've been getting a bit annoyed with it lately as it is boring now.", "I spent months wavering on whether to cut it.", "In a sudden moment of determination I lopped off my pony tail.", "I was worried I would regret it, but it's great!"], "src": "Long Hair", "trg": "I have had long hair most of my life. I've been getting a bit annoyed with it lately as it is boring now. I spent months wavering on whether to cut it. In a sudden moment of determination I lopped off my pony tail. I was worried I would regret it, but it's great!"}
{"input": ["The nerd"], "output": ["The nerd woke up every morning excited for school.", "The nerd always made sure to arrive to his classes on time.", "Every class the nerd was made fun of for trying to hard in school.", "The nerd reported the bullies to the principal.", "The principal gave the bullies detention and the nerd was happy."], "src": "The nerd", "trg": "The nerd woke up every morning excited for school. The nerd always made sure to arrive to his classes on time. Every class the nerd was made fun of for trying to hard in school. The nerd reported the bullies to the principal. The principal gave the bullies detention and the nerd was happy."}
{"input": ["Hearing"], "output": ["My ex coworker Ann had a hearing last week.", "Ann was having an affair with a man.", "The man's wife found out and left threatening voice mails.", "Ann filed a complaint in court.", "The case was dismissed after the wife promised to stop threatening."], "src": "Hearing", "trg": "My ex coworker Ann had a hearing last week. Ann was having an affair with a man. The man's wife found out and left threatening voice mails. Ann filed a complaint in court. The case was dismissed after the wife promised to stop threatening."}
{"input": ["Friendly's"], "output": ["Two weeks ago we went to Friendly's for breakfast.", "The prices were half off during weekdays.", "There were many regulars at the restaurant.", "I had an omelet and my wife had bacon and eggs.", "We were lukewarm about the food, but loved the prices."], "src": "Friendly's", "trg": "Two weeks ago we went to Friendly's for breakfast. The prices were half off during weekdays. There were many regulars at the restaurant. I had an omelet and my wife had bacon and eggs. We were lukewarm about the food, but loved the prices."}
{"input": ["Desmond wants to be a star"], "output": ["Desmond loved to play basketball.", "He wanted to be the very best at the game.", "He worked day and night to be just like his idol.", "The school was holding try outs to make the team.", "Desmond took the coach's breath away and is now a star for the team."], "src": "Desmond wants to be a star", "trg": "Desmond loved to play basketball. He wanted to be the very best at the game. He worked day and night to be just like his idol. The school was holding try outs to make the team. Desmond took the coach's breath away and is now a star for the team."}
{"input": ["The Mask"], "output": ["Gary was shopping at a Halloween store.", "He found a terrifying mask.", "He bought it and put it on when he pulled into his driveway.", "He approached the house and tapped on the window.", "His mother screamed and fainted when she saw him!"], "src": "The Mask", "trg": "Gary was shopping at a Halloween store. He found a terrifying mask. He bought it and put it on when he pulled into his driveway. He approached the house and tapped on the window. His mother screamed and fainted when she saw him!"}
{"input": ["Friends in Low Places"], "output": ["David lost both of his legs in the war and was in a wheelchair.", "His fiancee left him and many of his friends stopped seeing him.", "He was feeling very sorry for himself and was depressed.", "He began working at the VA hospital and met people worse off than him.", "After making many new friends there, David also met his new wife!"], "src": "Friends in Low Places", "trg": "David lost both of his legs in the war and was in a wheelchair. His fiancee left him and many of his friends stopped seeing him. He was feeling very sorry for himself and was depressed. He began working at the VA hospital and met people worse off than him. After making many new friends there, David also met his new wife!"}
{"input": ["Frank Does Handstands"], "output": ["Frank had always wanted to exercise more.", "A friend recommended he try doing handstands.", "At first Frank found it difficult, but eventually he became good.", "Now he does handstands every day.", "Frank is glad he exercises more now."], "src": "Frank Does Handstands", "trg": "Frank had always wanted to exercise more. A friend recommended he try doing handstands. At first Frank found it difficult, but eventually he became good. Now he does handstands every day. Frank is glad he exercises more now."}
{"input": ["The Ballerina"], "output": ["Jerry was a hard working dancer.", "She practiced and rehearsed everyday.", "Her dream was to go to Juilliard.", "She would make it someday she knew.", "She audition several times and was invited to the school."], "src": "The Ballerina", "trg": "Jerry was a hard working dancer. She practiced and rehearsed everyday. Her dream was to go to Juilliard. She would make it someday she knew. She audition several times and was invited to the school."}
{"input": ["Arden wanted his wife's attention"], "output": ["Arden laid in bed while his wife worked on her crowdsourcing website.", "Arden was getting extremely bored and he longed for her attention.", "He tried to watch television to pass the time while she finished work.", "He then rolled over to his wife and started talking to her.", "His wife realized he wanted her and stopped working to be with him."], "src": "Arden wanted his wife's attention", "trg": "Arden laid in bed while his wife worked on her crowdsourcing website. Arden was getting extremely bored and he longed for her attention. He tried to watch television to pass the time while she finished work. He then rolled over to his wife and started talking to her. His wife realized he wanted her and stopped working to be with him."}
{"input": ["Jessie's 40th"], "output": ["Jessie's birthday was coming up the following Monday.", "She told all her coworkers about it as she headed out.", "Jessie made a point of telling everyone none of them were invited.", "She thought they'd understand she was only joking.", "Jessie didn't like her boss's early present of a pink slip."], "src": "Jessie's 40th", "trg": "Jessie's birthday was coming up the following Monday. She told all her coworkers about it as she headed out. Jessie made a point of telling everyone none of them were invited. She thought they'd understand she was only joking. Jessie didn't like her boss's early present of a pink slip."}
{"input": ["Tiny Bugs"], "output": ["Two weeks ago my wife noticed tiny flies near our window.", "The flies were outside, and she paid them no mind.", "Later that night she found the flies on the bedroom ceiling.", "We sprayed the bugs and shut the window.", "The next day we had the screen replaced."], "src": "Tiny Bugs", "trg": "Two weeks ago my wife noticed tiny flies near our window. The flies were outside, and she paid them no mind. Later that night she found the flies on the bedroom ceiling. We sprayed the bugs and shut the window. The next day we had the screen replaced."}
{"input": ["Jen's and Kate's sleepover"], "output": ["Kate's mom dropped her off at Jen's house.", "Kate and Jen were having a sleeping over.", "They played Checkers where Jen won.", "They decided to watch movies and eat popcorn.", "During one of the movies both Jen and Kate fell asleep."], "src": "Jen's and Kate's sleepover", "trg": "Kate's mom dropped her off at Jen's house. Kate and Jen were having a sleeping over. They played Checkers where Jen won. They decided to watch movies and eat popcorn. During one of the movies both Jen and Kate fell asleep."}
{"input": ["Piano Recital"], "output": ["Ally had a big piano recital coming up.", "She was very nervous that she would make a mistake.", "Ally practiced for hours every day leading up to the recital.", "When Ally finally played her piece, she didn't miss a single note!", "Ally took a bow during the audience's applause."], "src": "Piano Recital", "trg": "Ally had a big piano recital coming up. She was very nervous that she would make a mistake. Ally practiced for hours every day leading up to the recital. When Ally finally played her piece, she didn't miss a single note! Ally took a bow during the audience's applause."}
{"input": ["Polaroid"], "output": ["Callie bought an old Polaroid camera.", "She took it to a family picnic.", "Then she snapped a few fun photos.", "But the camera did not work!", "Callie was so disappointed!"], "src": "Polaroid", "trg": "Callie bought an old Polaroid camera. She took it to a family picnic. Then she snapped a few fun photos. But the camera did not work! Callie was so disappointed!"}
{"input": ["The Delay"], "output": ["The family arrived at the airport with plenty of time.", "They waited patiently for their plane.", "It never arrived.", "The weather had delayed the flight.", "They missed their whole vacation because of it!"], "src": "The Delay", "trg": "The family arrived at the airport with plenty of time. They waited patiently for their plane. It never arrived. The weather had delayed the flight. They missed their whole vacation because of it!"}
{"input": ["Dream"], "output": ["Last night I dreamed about my friends in NH.", "I dreamed my friend's daughter broke up with her boyfriend.", "As a result her grades in college were falling.", "Her parents were furious and demanded she get her grades up.", "I woke up and realized it was all a bad dream."], "src": "Dream", "trg": "Last night I dreamed about my friends in NH. I dreamed my friend's daughter broke up with her boyfriend. As a result her grades in college were falling. Her parents were furious and demanded she get her grades up. I woke up and realized it was all a bad dream."}
{"input": ["Jitters"], "output": ["The surgeon was handed the tool.", "Nervously, she palmed the scalpel.", "The assistants watched her, anticipation in their faces.", "The surgeon breathed out and audible sigh, calming herself.", "She began to operate, all nervousness fading away."], "src": "Jitters", "trg": "The surgeon was handed the tool. Nervously, she palmed the scalpel. The assistants watched her, anticipation in their faces. The surgeon breathed out and audible sigh, calming herself. She began to operate, all nervousness fading away."}
{"input": ["Climbing"], "output": ["The mountain loomed on the horizon.", "They had their gear all packed, it was time to go.", "It was a direct vertical ascent, almost 1000 feet straight up.", "They began slowly making their way up.", "The summit would take days, but they knew it would be worth it."], "src": "Climbing", "trg": "The mountain loomed on the horizon. They had their gear all packed, it was time to go. It was a direct vertical ascent, almost 1000 feet straight up. They began slowly making their way up. The summit would take days, but they knew it would be worth it."}
{"input": ["Going Skiing"], "output": ["I stood at the ramp and looked down the mountain.", "My heart began racing.", "The instructor said some encouraging words to me.", "I calmed down, and started down the ramp.", "By the time I got to the bottom, I was ready to go again."], "src": "Going Skiing", "trg": "I stood at the ramp and looked down the mountain. My heart began racing. The instructor said some encouraging words to me. I calmed down, and started down the ramp. By the time I got to the bottom, I was ready to go again."}
{"input": ["The Model"], "output": ["The model worked very hard to get ready for the fashion show.", "She only ate healthy food.", "She spent hours at the gym.", "When it was time, she walked down the runway proudly.", "All of the designers wanted her in their show."], "src": "The Model", "trg": "The model worked very hard to get ready for the fashion show. She only ate healthy food. She spent hours at the gym. When it was time, she walked down the runway proudly. All of the designers wanted her in their show."}
{"input": ["New school"], "output": ["Kelly just moved to a new town.", "She was quite nervous to move there.", "She was worried she would not make any friends.", "However to her dismay as she walked in the school she made some.", "Everything seemed automatically better."], "src": "New school", "trg": "Kelly just moved to a new town. She was quite nervous to move there. She was worried she would not make any friends. However to her dismay as she walked in the school she made some. Everything seemed automatically better."}
{"input": ["The Half Court Shot"], "output": ["The Vikings basketball team always has a halftime contest.", "John was picked to try and make a half court shot.", "He grabbed a basketball and threw it as hard as he could.", "He made the shot!", "John won one hundred dollars for making the shot."], "src": "The Half Court Shot", "trg": "The Vikings basketball team always has a halftime contest. John was picked to try and make a half court shot. He grabbed a basketball and threw it as hard as he could. He made the shot! John won one hundred dollars for making the shot."}
{"input": ["Worry about Mexico"], "output": ["I was very worried about studying abroad in Mexico.", "I spoke very good Spanish, but I wasn't sure if it would be enough.", "I was nervous the entire plane ride to Mexico City.", "When I got there, my host family greeted me with open arms.", "They told me not to worry because I spoke great Spanish."], "src": "Worry about Mexico", "trg": "I was very worried about studying abroad in Mexico. I spoke very good Spanish, but I wasn't sure if it would be enough. I was nervous the entire plane ride to Mexico City. When I got there, my host family greeted me with open arms. They told me not to worry because I spoke great Spanish."}
{"input": ["Drone"], "output": ["Bobby always wanted a drone he could fly around his yard.", "Bobby dropped hints to his parents about the drone.", "Bobby wrote a letter to Santa about the drone.", "He finally awoke on Christmas morning and unwrapped a box.", "It was a huge state of the art drone!"], "src": "Drone", "trg": "Bobby always wanted a drone he could fly around his yard. Bobby dropped hints to his parents about the drone. Bobby wrote a letter to Santa about the drone. He finally awoke on Christmas morning and unwrapped a box. It was a huge state of the art drone!"}
{"input": ["Greg wins the game"], "output": ["Greg is playing in a basketball game.", "There are only a few ticks on the clock left.", "The ball is passed to Greg.", "He puts up the shot and it goes in!", "The crowd screams and Greg is a local hero!"], "src": "Greg wins the game", "trg": "Greg is playing in a basketball game. There are only a few ticks on the clock left. The ball is passed to Greg. He puts up the shot and it goes in! The crowd screams and Greg is a local hero!"}
{"input": ["The Compromise"], "output": ["Justin and Melanie were moving in together.", "Melanie adored cats and asked when they could adopt one.", "Justin informed her he was badly allergic to cat fur.", "Melanie was heartbroken and really wanted a feline companion.", "She found a hairless cat and brought it home, and Justin was fine."], "src": "The Compromise", "trg": "Justin and Melanie were moving in together. Melanie adored cats and asked when they could adopt one. Justin informed her he was badly allergic to cat fur. Melanie was heartbroken and really wanted a feline companion. She found a hairless cat and brought it home, and Justin was fine."}
{"input": ["The Saxophonist"], "output": ["Bill was about to again step on stage at the underground club.", "He always plays the saxophone here, but today is father is here.", "Bill's father is a very talented but retired and judging saxophonist.", "Bill nervously steps up and plays his first song.", "Bill's father nods his approval and Bill plays many more songs."], "src": "The Saxophonist", "trg": "Bill was about to again step on stage at the underground club. He always plays the saxophone here, but today is father is here. Bill's father is a very talented but retired and judging saxophonist. Bill nervously steps up and plays his first song. Bill's father nods his approval and Bill plays many more songs."}
{"input": ["Johnny Goes Fishing"], "output": ["Johnny decided he needed to get out of the house.", "He went for a short fishing trip.", "Johnny caught a huge salmon when fishing.", "He was very proud.", "Johnny was glad he left the house."], "src": "Johnny Goes Fishing", "trg": "Johnny decided he needed to get out of the house. He went for a short fishing trip. Johnny caught a huge salmon when fishing. He was very proud. Johnny was glad he left the house."}
{"input": ["Bad headache"], "output": ["Today I went to the beach.", "I was feeling great at first, however then I started getting sick.", "My head was throbbing and I needed to leave.", "When I got home I took Motrin.", "Thankfully when I took it, I was cured."], "src": "Bad headache", "trg": "Today I went to the beach. I was feeling great at first, however then I started getting sick. My head was throbbing and I needed to leave. When I got home I took Motrin. Thankfully when I took it, I was cured."}
{"input": ["Mcdonald's"], "output": ["Anita had a craving for Mcdonald's.", "She asked her husband to go grab some food.", "Her husband wanted to eat Burger King instead.", "They flipped a coin to decide what to eat.", "Anita won the coin toss and her husband got Mcdonald's."], "src": "Mcdonald's", "trg": "Anita had a craving for Mcdonald's. She asked her husband to go grab some food. Her husband wanted to eat Burger King instead. They flipped a coin to decide what to eat. Anita won the coin toss and her husband got Mcdonald's."}
{"input": ["Scrabble Friends"], "output": ["Yesterday I went to a friend's house to play Scrabble.", "We have been Scrabble buddies for many years.", "We played three games, and the competition was fierce.", "My friend won two games and I was very disappointed.", "Luckily, my friend made a peach pie and offered it as consolation!"], "src": "Scrabble Friends", "trg": "Yesterday I went to a friend's house to play Scrabble. We have been Scrabble buddies for many years. We played three games, and the competition was fierce. My friend won two games and I was very disappointed. Luckily, my friend made a peach pie and offered it as consolation!"}
{"input": ["Hunting Trip"], "output": ["Thomas had never been hunting before.", "Dennis said he would be happy to take home.", "They both went to the sporting good store and bought supplies.", "After the finished shopping they both went hunting.", "Thomas shot his first deer and enjoyed his hunting trip."], "src": "Hunting Trip", "trg": "Thomas had never been hunting before. Dennis said he would be happy to take home. They both went to the sporting good store and bought supplies. After the finished shopping they both went hunting. Thomas shot his first deer and enjoyed his hunting trip."}
{"input": ["Too Much"], "output": ["Matt rubbed his eyes.", "He looked over at Cherise who hadn't blinked in five minutes.", "He gave her a warning about too much video games.", "She shrugged and continued playing.", "Finally, exasperated, Matt grabbed the controller from her hand."], "src": "Too Much", "trg": "Matt rubbed his eyes. He looked over at Cherise who hadn't blinked in five minutes. He gave her a warning about too much video games. She shrugged and continued playing. Finally, exasperated, Matt grabbed the controller from her hand."}
{"input": ["Joey gets the job"], "output": ["Joey wanted a new gaming system.", "He asked his parents but they said No.", "Joey decided to get a job to get the console.", "Joey applied for a local fast food restaurant.", "Joey aced his interview and got the job."], "src": "Joey gets the job", "trg": "Joey wanted a new gaming system. He asked his parents but they said No. Joey decided to get a job to get the console. Joey applied for a local fast food restaurant. Joey aced his interview and got the job."}
{"input": ["Lorrie's Bad day"], "output": ["Lorrie was driving down the road.", "She heard a noise coming from her truck.", "She got out to look at it.", "It was smoking everywhere.", "She was stranded for hours before help came."], "src": "Lorrie's Bad day", "trg": "Lorrie was driving down the road. She heard a noise coming from her truck. She got out to look at it. It was smoking everywhere. She was stranded for hours before help came."}
{"input": ["Book lover"], "output": ["Mona went to the library to borrow a book.", "When she arrived, the library was closed.", "Mona wasn't happy about this and went to a bookstore.", "She found the book she wanted very fast and paid for it.", "She went back home and read the book all night."], "src": "Book lover", "trg": "Mona went to the library to borrow a book. When she arrived, the library was closed. Mona wasn't happy about this and went to a bookstore. She found the book she wanted very fast and paid for it. She went back home and read the book all night."}
{"input": ["Agoraphobia"], "output": ["Nic and his friends went to a party.", "There were a lot of people and they got separated.", "Nic didn't like to be in a crowd alone and started panicking.", "He hid in a closet and found a girl who was also afraid.", "They started talking about their fears and became fast friends."], "src": "Agoraphobia", "trg": "Nic and his friends went to a party. There were a lot of people and they got separated. Nic didn't like to be in a crowd alone and started panicking. He hid in a closet and found a girl who was also afraid. They started talking about their fears and became fast friends."}
{"input": ["The Grahams"], "output": ["The Grahams are one of my favorite families.", "They go to Florida every summer to visit their elderly family members.", "The grandma loves to play scrabble when they get there, late at night.", "She always bakes a lemon meringue pie for them.", "They really enjoy their long visits during the summer."], "src": "The Grahams", "trg": "The Grahams are one of my favorite families. They go to Florida every summer to visit their elderly family members. The grandma loves to play scrabble when they get there, late at night. She always bakes a lemon meringue pie for them. They really enjoy their long visits during the summer."}
{"input": ["The Present"], "output": ["Barry was given a present for his birthday.", "The problem is that his birthday is not for another couple of weeks.", "Barry longed to see the inside of his birthday present.", "He shook the present many times to try to guess what was inside.", "Barry finally peeked inside the present one day and saw a remote car!"], "src": "The Present", "trg": "Barry was given a present for his birthday. The problem is that his birthday is not for another couple of weeks. Barry longed to see the inside of his birthday present. He shook the present many times to try to guess what was inside. Barry finally peeked inside the present one day and saw a remote car!"}
{"input": ["Playing in a Band"], "output": ["Martin enjoyed playing the guitar.", "He had always wanted to be in a band.", "One day he met a new friend who played the drums.", "Martin and his friend formed their own band.", "They had fun playing their music at parties."], "src": "Playing in a Band", "trg": "Martin enjoyed playing the guitar. He had always wanted to be in a band. One day he met a new friend who played the drums. Martin and his friend formed their own band. They had fun playing their music at parties."}
{"input": ["The Babysitter"], "output": ["Anna showed up to babysit the kids.", "She brought books and crafts.", "She thought they would all have a fun time.", "The kids threw things and tied her to a chair.", "She never babysat those kids again!"], "src": "The Babysitter", "trg": "Anna showed up to babysit the kids. She brought books and crafts. She thought they would all have a fun time. The kids threw things and tied her to a chair. She never babysat those kids again!"}
{"input": ["The Laptop"], "output": ["Brandon needed to buy a new laptop for school.", "He went to the store and found a perfect laptop.", "The laptop was not in his price range.", "The salesman said Brandon qualified for six month financing.", "Brandon decided to take the offer and went home with his laptop."], "src": "The Laptop", "trg": "Brandon needed to buy a new laptop for school. He went to the store and found a perfect laptop. The laptop was not in his price range. The salesman said Brandon qualified for six month financing. Brandon decided to take the offer and went home with his laptop."}
{"input": ["Small Fish"], "output": ["Barry was fishing at a small lake near his house.", "Barry wanted to catch a big bass for dinner tonight.", "Barry felt a tug on his line, and immediately began to reel it in.", "Barry was excited to see the size of the fish he had caught.", "However, to Barry's surprise, the fish was a very, small baby fish."], "src": "Small Fish", "trg": "Barry was fishing at a small lake near his house. Barry wanted to catch a big bass for dinner tonight. Barry felt a tug on his line, and immediately began to reel it in. Barry was excited to see the size of the fish he had caught. However, to Barry's surprise, the fish was a very, small baby fish."}
{"input": ["Glamorous"], "output": ["The girl primped in the mirror.", "She fixed her hair and makeup.", "When she was finished, she looked beautiful.", "Her date was stunned when he saw her.", "He couldn't believe such a beautiful girl agreed to date him!"], "src": "Glamorous", "trg": "The girl primped in the mirror. She fixed her hair and makeup. When she was finished, she looked beautiful. Her date was stunned when he saw her. He couldn't believe such a beautiful girl agreed to date him!"}
{"input": ["Mountain climbing"], "output": ["A few years back, my brother went mountain climbing in Utah.", "He climbed a very tall structure over many hours.", "When he arrived on top, he realized he had no more water.", "He had to climb down while being very thirsty.", "The first thing he did when he reached town was to drink water."], "src": "Mountain climbing", "trg": "A few years back, my brother went mountain climbing in Utah. He climbed a very tall structure over many hours. When he arrived on top, he realized he had no more water. He had to climb down while being very thirsty. The first thing he did when he reached town was to drink water."}
{"input": ["The Triathlon"], "output": ["Hoda was training for the triathlon.", "She was a bad swimmer, so it was a lot of work.", "After many months of training, she was finally able to finish.", "Her time wasn't very good, but it didn't matter.", "She was just happy to be finished!"], "src": "The Triathlon", "trg": "Hoda was training for the triathlon. She was a bad swimmer, so it was a lot of work. After many months of training, she was finally able to finish. Her time wasn't very good, but it didn't matter. She was just happy to be finished!"}
{"input": ["Washer"], "output": ["My sister in law's washer died this spring.", "Her husband is very frugal, and did not want to buy a new unit.", "After months of lobbying, he gave in this summer.", "He nearly fainted when he found out the washer cost $850.", "His wife is very happy, however."], "src": "Washer", "trg": "My sister in law's washer died this spring. Her husband is very frugal, and did not want to buy a new unit. After months of lobbying, he gave in this summer. He nearly fainted when he found out the washer cost $850. His wife is very happy, however."}
{"input": ["Ellie's dance recital."], "output": ["Ellie had just completed her first year of ballet classes.", "Ellie loved ballet and was very happy.", "On the day of her recital, Ellie was so excited.", "She wore a beautiful pink dress with a tutu and a bun in her hair.", "Ellie shined on stage and did a fantastic job,the audience cheered!"], "src": "Ellie's dance recital.", "trg": "Ellie had just completed her first year of ballet classes. Ellie loved ballet and was very happy. On the day of her recital, Ellie was so excited. She wore a beautiful pink dress with a tutu and a bun in her hair. Ellie shined on stage and did a fantastic job,the audience cheered!"}
{"input": ["Miles Chews Gum"], "output": ["Miles noticed that his breath smelled bad.", "He decided to get some gum to chew.", "Miles bought a pack of strawberry flavored gum.", "He began to chew one stick of the gum.", "Soon he noticed that his breath did not smell bad any longer."], "src": "Miles Chews Gum", "trg": "Miles noticed that his breath smelled bad. He decided to get some gum to chew. Miles bought a pack of strawberry flavored gum. He began to chew one stick of the gum. Soon he noticed that his breath did not smell bad any longer."}
{"input": ["LuLu"], "output": ["Lulu is terrified of needles.", "This morning, she had to go to the vet to get a shot.", "When the technician walked in, Lulu saw the needle.", "She got so scared, she stood up and let out what sounded like a scream.", "The tech was very careful, and did not hurt her."], "src": "LuLu", "trg": "Lulu is terrified of needles. This morning, she had to go to the vet to get a shot. When the technician walked in, Lulu saw the needle. She got so scared, she stood up and let out what sounded like a scream. The tech was very careful, and did not hurt her."}
{"input": ["The Dishes"], "output": ["The couple was registering for wedding gifts.", "They couldn't agree on what dishes they wanted.", "The bride got really mad and stormed off.", "THe groom cancelled the wedding.", "It was the first wedding that had ever been called off in Pier 1."], "src": "The Dishes", "trg": "The couple was registering for wedding gifts. They couldn't agree on what dishes they wanted. The bride got really mad and stormed off. THe groom cancelled the wedding. It was the first wedding that had ever been called off in Pier 1."}
{"input": ["Sleeping Problems"], "output": ["Last night, I didn't go to sleep until 1 AM.", "At 4 AM, my cat woke me up by biting my toes.", "I was very annoyed with him because I had to wake up at 5.", "I went to a different room where he couldn't enter.", "I slept blissfully until my alarm went off an hour later."], "src": "Sleeping Problems", "trg": "Last night, I didn't go to sleep until 1 AM. At 4 AM, my cat woke me up by biting my toes. I was very annoyed with him because I had to wake up at 5. I went to a different room where he couldn't enter. I slept blissfully until my alarm went off an hour later."}
{"input": ["The Party"], "output": ["Sam invited her whole class to her party.", "The morning of the party, she put together the goodie bags.", "She was so excited to see everyone!", "No one showed up, though.", "Sam felt embarrassed and sad."], "src": "The Party", "trg": "Sam invited her whole class to her party. The morning of the party, she put together the goodie bags. She was so excited to see everyone! No one showed up, though. Sam felt embarrassed and sad."}
{"input": ["We've Been Robbed"], "output": ["Tanner was known to overreact.", "When he got in his car he couldn't find his wallet or sunglasses.", "He always left them in the same spot.", "He instantly starts panicking assuming someone broke in.", "His wife then stepped outside holding both, he left them in the house."], "src": "We've Been Robbed", "trg": "Tanner was known to overreact. When he got in his car he couldn't find his wallet or sunglasses. He always left them in the same spot. He instantly starts panicking assuming someone broke in. His wife then stepped outside holding both, he left them in the house."}
{"input": ["Moral decision"], "output": ["Michael was walking on the busy street.", "He found a $20 bill on the floor and looked around him.", "People were going by, but no one stopped next to him.", "Michael asked around to see if anyone lost a bill.", "When no one answered, he put the bill in his wallet and continued on."], "src": "Moral decision", "trg": "Michael was walking on the busy street. He found a $20 bill on the floor and looked around him. People were going by, but no one stopped next to him. Michael asked around to see if anyone lost a bill. When no one answered, he put the bill in his wallet and continued on."}
{"input": ["Jim Wins"], "output": ["Jim was going to make a bet.", "He was going to make it a big one.", "He decided he needed to take on a challenge.", "He bet all of his money on this race.", "The day of the race comes and Jim wins it all!"], "src": "Jim Wins", "trg": "Jim was going to make a bet. He was going to make it a big one. He decided he needed to take on a challenge. He bet all of his money on this race. The day of the race comes and Jim wins it all!"}
{"input": ["The Catcher"], "output": ["Darnell was a great baseball player.", "He was always working hard and practicing.", "Darnell was his team's catcher.", "Darnell was very good at his position.", "At the end of the season Darnell won mvp for his team."], "src": "The Catcher", "trg": "Darnell was a great baseball player. He was always working hard and practicing. Darnell was his team's catcher. Darnell was very good at his position. At the end of the season Darnell won mvp for his team."}
{"input": ["The Babysitter"], "output": ["Amy's mom told her to babysit her little brother Kyle.", "Amy was annoyed because she would rather go to the mall.", "Kyle asked Amy to play a game.", "The two ended up having a lot of fun together.", "Amy said that she would babysit Kyle any time."], "src": "The Babysitter", "trg": "Amy's mom told her to babysit her little brother Kyle. Amy was annoyed because she would rather go to the mall. Kyle asked Amy to play a game. The two ended up having a lot of fun together. Amy said that she would babysit Kyle any time."}
{"input": ["The Consequences of Trisha's Carelessness"], "output": ["Trisha's mom warned her not to spill anything on the hardwood floor.", "Trisha was careless and spilled some soda.", "She tried to mop it up but didn't do a very thorough job.", "The floor was stained from being wet for a long time.", "This weekend, Trisha will be taught how to spot finish a wood floor."], "src": "The Consequences of Trisha's Carelessness", "trg": "Trisha's mom warned her not to spill anything on the hardwood floor. Trisha was careless and spilled some soda. She tried to mop it up but didn't do a very thorough job. The floor was stained from being wet for a long time. This weekend, Trisha will be taught how to spot finish a wood floor."}
{"input": ["Jellyfish"], "output": ["John went swimming.", "He was bit by a jellyfish.", "His leg swelled up.", "John went to the hospital.", "The swelling was taken care of."], "src": "Jellyfish", "trg": "John went swimming. He was bit by a jellyfish. His leg swelled up. John went to the hospital. The swelling was taken care of."}
{"input": ["Prom Approach"], "output": ["Robert was always nervous when talking with girls.", "Rob decided he wanted to ask Katie to the prom.", "Rob spent thirty minutes rehearsing his speech for Katie.", "Rob finally approached Katie, his heart in his throat.", "Rob asked her, and Katie said yes!"], "src": "Prom Approach", "trg": "Robert was always nervous when talking with girls. Rob decided he wanted to ask Katie to the prom. Rob spent thirty minutes rehearsing his speech for Katie. Rob finally approached Katie, his heart in his throat. Rob asked her, and Katie said yes!"}
{"input": ["Darkness"], "output": ["Amanda was scared of the dark.", "She did not want to go to bed.", "She was sure that she saw shadows on the wall.", "Her father gave her a flashlight.", "She used the flashlight and went to bed."], "src": "Darkness", "trg": "Amanda was scared of the dark. She did not want to go to bed. She was sure that she saw shadows on the wall. Her father gave her a flashlight. She used the flashlight and went to bed."}
{"input": ["Harsh Foul"], "output": ["Ian became angry throughout the basketball team.", "None of his team wanted to pass the ball.", "In addition, his opponents were constantly blocking him.", "Ian took out his frustrating my knocking an opponent down.", "Since he injured the person, the coach removed him from the game."], "src": "Harsh Foul", "trg": "Ian became angry throughout the basketball team. None of his team wanted to pass the ball. In addition, his opponents were constantly blocking him. Ian took out his frustrating my knocking an opponent down. Since he injured the person, the coach removed him from the game."}
{"input": ["Festival"], "output": ["My friends and I went to a music festival.", "We got to see eighty different bands.", "The atmosphere was like a carnival.", "We danced until daybreak each day.", "By the end of the weekend, we were exhausted and happy."], "src": "Festival", "trg": "My friends and I went to a music festival. We got to see eighty different bands. The atmosphere was like a carnival. We danced until daybreak each day. By the end of the weekend, we were exhausted and happy."}
{"input": ["Cold soup"], "output": ["Joey's mom called him for lunch.", "He kept playing his video game.", "About an hour later he want downstairs to a bowl of cold soup.", "He complained to his mother.", "She told him if he had come when she called it world be hot soup."], "src": "Cold soup", "trg": "Joey's mom called him for lunch. He kept playing his video game. About an hour later he want downstairs to a bowl of cold soup. He complained to his mother. She told him if he had come when she called it world be hot soup."}
{"input": ["Yoga"], "output": ["My girlfriend loves to do yoga.", "She always tries to get me to do it.", "I finally gave in a tried even though I am not very flexible.", "I pulled a muscle in my back the first move.", "She felt so bad that she babied me for weeks."], "src": "Yoga", "trg": "My girlfriend loves to do yoga. She always tries to get me to do it. I finally gave in a tried even though I am not very flexible. I pulled a muscle in my back the first move. She felt so bad that she babied me for weeks."}
{"input": ["Moving Out"], "output": ["I had lived with my best friend for four years.", "When I met my fiancee I knew we were going start a life.", "When I asked her to move in with me she said yes.", "I couldn't figure out how to tell my best friend though.", "So I just moved out while he was working and left a note."], "src": "Moving Out", "trg": "I had lived with my best friend for four years. When I met my fiancee I knew we were going start a life. When I asked her to move in with me she said yes. I couldn't figure out how to tell my best friend though. So I just moved out while he was working and left a note."}
{"input": ["My Disney Bag"], "output": ["I have a huge Disney bag that I bought five years ago.", "I've been using it ever since I bought it, and it hasn't even faded.", "I keep it in my closet when I'm not using it that day.", "I want a new one, but I love this one too much.", "I am keeping the bag to give to my daughter someday."], "src": "My Disney Bag", "trg": "I have a huge Disney bag that I bought five years ago. I've been using it ever since I bought it, and it hasn't even faded. I keep it in my closet when I'm not using it that day. I want a new one, but I love this one too much. I am keeping the bag to give to my daughter someday."}
{"input": ["The Lost Eye"], "output": ["I had a favorite stuffed animal when I was younger.", "It was a tiger named Tigey.", "I always played with Tigey, but one day I forgot him outside.", "It rained that night and one of Tiger's eyes fell out.", "I learned to take care of my things If I want to keep them nice."], "src": "The Lost Eye", "trg": "I had a favorite stuffed animal when I was younger. It was a tiger named Tigey. I always played with Tigey, but one day I forgot him outside. It rained that night and one of Tiger's eyes fell out. I learned to take care of my things If I want to keep them nice."}
{"input": ["Juice"], "output": ["I don't really like most juices.", "I prefer plain water.", "We bought a bunch of pineapple-orange juice.", "Like usual, I told my husband he could have all of it.", "But it turns out I really like that one and there is not much left!"], "src": "Juice", "trg": "I don't really like most juices. I prefer plain water. We bought a bunch of pineapple-orange juice. Like usual, I told my husband he could have all of it. But it turns out I really like that one and there is not much left!"}
{"input": ["Reading Influencer"], "output": ["Beth learned to read in first grade.", "She loved reading so much that her parents got her a library card.", "Beth took many books out of the library and read frequently.", "She decided her favorite genre of books was mystery.", "Beth convinced all her friends to join her in reading mystery books."], "src": "Reading Influencer", "trg": "Beth learned to read in first grade. She loved reading so much that her parents got her a library card. Beth took many books out of the library and read frequently. She decided her favorite genre of books was mystery. Beth convinced all her friends to join her in reading mystery books."}
{"input": ["Tent Living"], "output": ["Jennifer and her husband decided to move to another state.", "When they got there, they found jobs right away.", "They needed a place to live and found a perfect apartment.", "Unfortunately the apartment would not be ready for a month.", "The two of them ended up living in a tent for a month."], "src": "Tent Living", "trg": "Jennifer and her husband decided to move to another state. When they got there, they found jobs right away. They needed a place to live and found a perfect apartment. Unfortunately the apartment would not be ready for a month. The two of them ended up living in a tent for a month."}
{"input": ["The Dress"], "output": ["Jess ordered a beautiful dress.", "She was anxious for it to arrive in the mail.", "When she opened it, it fit beautifully!", "It was her favorite item in her closet.", "She wore it every week."], "src": "The Dress", "trg": "Jess ordered a beautiful dress. She was anxious for it to arrive in the mail. When she opened it, it fit beautifully! It was her favorite item in her closet. She wore it every week."}
{"input": ["Aaron Plays Rugby"], "output": ["Aaron decides he wants to organize a sports game with friends.", "He asks if they want to play rugby.", "Aaron and his friends get together at a park to play rugby.", "After playing they all go to a nearby pub for a beer.", "Aaron is satisfied that he organized a game with his friends."], "src": "Aaron Plays Rugby", "trg": "Aaron decides he wants to organize a sports game with friends. He asks if they want to play rugby. Aaron and his friends get together at a park to play rugby. After playing they all go to a nearby pub for a beer. Aaron is satisfied that he organized a game with his friends."}
{"input": ["Cheap Thrills"], "output": ["Sia didn't have any cash.", "Her boyfriend had come over earlier.", "They danced all through her house.", "Sia was very happy.", "She decided it was okay she didn't have money to go out."], "src": "Cheap Thrills", "trg": "Sia didn't have any cash. Her boyfriend had come over earlier. They danced all through her house. Sia was very happy. She decided it was okay she didn't have money to go out."}
{"input": ["Connor car breaks down"], "output": ["Connor is driving down the road.", "He thinks he smells something burning.", "His car starts to make a loud noise.", "Connor pulls over to check it out.", "His car engine is blown up!"], "src": "Connor car breaks down", "trg": "Connor is driving down the road. He thinks he smells something burning. His car starts to make a loud noise. Connor pulls over to check it out. His car engine is blown up!"}
{"input": ["Counter Pizza"], "output": ["James loved pizza.", "One night he forgot to put the pizza away.", "When he woke up he saw it was left out all night.", "He grabbed a piece a took a huge bite.", "James loved cold counter pizza even more then when it was fresh."], "src": "Counter Pizza", "trg": "James loved pizza. One night he forgot to put the pizza away. When he woke up he saw it was left out all night. He grabbed a piece a took a huge bite. James loved cold counter pizza even more then when it was fresh."}
{"input": ["Gregs winning bet"], "output": ["Greg was going to press his luck.", "He had been down a few thousand dollars at the casino.", "He was desperate for a winner.", "He decided to bet it all on Horse number 9.", "To his delight the horse took first place and Greg Won it all back."], "src": "Gregs winning bet", "trg": "Greg was going to press his luck. He had been down a few thousand dollars at the casino. He was desperate for a winner. He decided to bet it all on Horse number 9. To his delight the horse took first place and Greg Won it all back."}
{"input": ["Jimmy and Timmy"], "output": ["Jimmy and Timmy both loved to bowl.", "Jimmy got more strikes but Timmy had higher scores.", "They decided to enter a doubles tournament together.", "Jimmy practiced hard and Timmy practiced hard.", "When the tournament day arrived, they bowled well and won 5th place."], "src": "Jimmy and Timmy", "trg": "Jimmy and Timmy both loved to bowl. Jimmy got more strikes but Timmy had higher scores. They decided to enter a doubles tournament together. Jimmy practiced hard and Timmy practiced hard. When the tournament day arrived, they bowled well and won 5th place."}
{"input": ["Turkey Replacement"], "output": ["Bev had baked a lovely turkey for her family's Thanksgiving dinner.", "Everyone was at the table waiting.", "She went into the kitchen to take the turkey into the dining room.", "Just as she turned the corner she saw her big dog running off with it.", "After she got it away from him, she made hamburgers for her family."], "src": "Turkey Replacement", "trg": "Bev had baked a lovely turkey for her family's Thanksgiving dinner. Everyone was at the table waiting. She went into the kitchen to take the turkey into the dining room. Just as she turned the corner she saw her big dog running off with it. After she got it away from him, she made hamburgers for her family."}
{"input": ["Guitar lessons"], "output": ["Joe wanted to learn how to play guitar to impress Cindy.", "Joe saved up his money so he could take lessons.", "When he had enough money saved, Joe scheduled some lessons.", "Joe practiced really hard and now he knows how to play guitar.", "Joe played his guitar for Cindy, and she was really impressed."], "src": "Guitar lessons", "trg": "Joe wanted to learn how to play guitar to impress Cindy. Joe saved up his money so he could take lessons. When he had enough money saved, Joe scheduled some lessons. Joe practiced really hard and now he knows how to play guitar. Joe played his guitar for Cindy, and she was really impressed."}
{"input": ["Jason Becomes A Lawyer"], "output": ["Jason had always dreamed of being a lawyer.", "He knew it would be hard work.", "He studied hard to finish law school and the bar exam.", "When he was complete, he felt great.", "Jason was proud that he was finally a lawyer."], "src": "Jason Becomes A Lawyer", "trg": "Jason had always dreamed of being a lawyer. He knew it would be hard work. He studied hard to finish law school and the bar exam. When he was complete, he felt great. Jason was proud that he was finally a lawyer."}
{"input": ["Mud Pies"], "output": ["Jamie and Susie were making mud pies together.", "They were having fun pretending to be real life chefs.", "Jamie got so carried away he forgot the pies were real.", "He took a big bite of one!", "Susie laughed as mud oozed down Jamie's chin."], "src": "Mud Pies", "trg": "Jamie and Susie were making mud pies together. They were having fun pretending to be real life chefs. Jamie got so carried away he forgot the pies were real. He took a big bite of one! Susie laughed as mud oozed down Jamie's chin."}
{"input": ["Pinball wizard"], "output": ["Caroline walked to the store.", "She saw a new pinball game.", "She got two dollars worth of quarters.", "She played the pinball game for an hour.", "She got her name on the machine for highest score."], "src": "Pinball wizard", "trg": "Caroline walked to the store. She saw a new pinball game. She got two dollars worth of quarters. She played the pinball game for an hour. She got her name on the machine for highest score."}
{"input": ["Painting"], "output": ["Jamie thought she was amazing at art.", "She painted a piece that she displayed in a cafe.", "She arrived there early to watch.", "A couple of people stopped to take a look.", "No one bought her painting."], "src": "Painting", "trg": "Jamie thought she was amazing at art. She painted a piece that she displayed in a cafe. She arrived there early to watch. A couple of people stopped to take a look. No one bought her painting."}
{"input": ["New Headphones"], "output": ["I needed some new headphones.", "I saw them at the store for nine dollars.", "The cashier insisted that they were fifteen dollars.", "I got the manager.", "The manager gave me the headphones for nine dollars."], "src": "New Headphones", "trg": "I needed some new headphones. I saw them at the store for nine dollars. The cashier insisted that they were fifteen dollars. I got the manager. The manager gave me the headphones for nine dollars."}
{"input": ["A Championship Swim"], "output": ["David was the newest swimmer on a prestigious swim team.", "The team was competing in an important swim meet.", "David was nervous about his race at the meet.", "Seeing this, his teammates assured David he was a great swimmer.", "Inspired by his teammates faith in him, David won his race!"], "src": "A Championship Swim", "trg": "David was the newest swimmer on a prestigious swim team. The team was competing in an important swim meet. David was nervous about his race at the meet. Seeing this, his teammates assured David he was a great swimmer. Inspired by his teammates faith in him, David won his race!"}
{"input": ["First Credit Card"], "output": ["Ed got his first credit card.", "He ate out eight times the first month he had it.", "He also bought himself some new electronics.", "He was shocked when he got his first bill.", "He vowed he would be more careful in his spending."], "src": "First Credit Card", "trg": "Ed got his first credit card. He ate out eight times the first month he had it. He also bought himself some new electronics. He was shocked when he got his first bill. He vowed he would be more careful in his spending."}
{"input": ["New Career"], "output": ["Bekah was tired of her job at the coffee shop.", "She decided to enroll in community college to develop her skills.", "After she completed college she began searching for a new career.", "She received many interviews at places that interested her.", "Bekah was offered a position and began her new career."], "src": "New Career", "trg": "Bekah was tired of her job at the coffee shop. She decided to enroll in community college to develop her skills. After she completed college she began searching for a new career. She received many interviews at places that interested her. Bekah was offered a position and began her new career."}
{"input": ["Off-road"], "output": ["Ian decided to take a road trip to visit his girlfriend.", "He drove all the way from California to Arizona that rainy night.", "As he drove through the mountains, the rain began to make the road sli.", "Ian screamed as the car careened off the road before hitting a tree.", "Ian was grateful to be alive even if his car was damaged."], "src": "Off-road", "trg": "Ian decided to take a road trip to visit his girlfriend. He drove all the way from California to Arizona that rainy night. As he drove through the mountains, the rain began to make the road sli. Ian screamed as the car careened off the road before hitting a tree. Ian was grateful to be alive even if his car was damaged."}
{"input": ["Suzy goes to school"], "output": ["Suzana was about to first start school.", "She was only 5 years old.", "Her daddy walked her to school.", "He wiped away the tears from his face.", "Suzy went to the classroom to learn for the first time."], "src": "Suzy goes to school", "trg": "Suzana was about to first start school. She was only 5 years old. Her daddy walked her to school. He wiped away the tears from his face. Suzy went to the classroom to learn for the first time."}
{"input": ["The Frenemy"], "output": ["Ashley was not a very good friend.", "She was negative when she spoke to her friends.", "She made them feel bad, not good.", "On Tuesday, her friends all told her they didn't like her anymore.", "Ashley decided she needed to work on her attitude."], "src": "The Frenemy", "trg": "Ashley was not a very good friend. She was negative when she spoke to her friends. She made them feel bad, not good. On Tuesday, her friends all told her they didn't like her anymore. Ashley decided she needed to work on her attitude."}
{"input": ["Coffee Burn"], "output": ["Tim woke up early for work.", "He made himself a cup of coffee.", "As he was about to take a sip, he burned his tongue.", "His tongue started to swell up.", "Tim had to go to the doctor to treat his burn."], "src": "Coffee Burn", "trg": "Tim woke up early for work. He made himself a cup of coffee. As he was about to take a sip, he burned his tongue. His tongue started to swell up. Tim had to go to the doctor to treat his burn."}
{"input": ["Politics"], "output": ["Phil loved to follow politics.", "He constantly talked about politics and read the newspaper.", "Phil went to college to study politics.", "After graduation, Phil got a job reporting on politics for the news.", "Phil now travels the country covering political stories."], "src": "Politics", "trg": "Phil loved to follow politics. He constantly talked about politics and read the newspaper. Phil went to college to study politics. After graduation, Phil got a job reporting on politics for the news. Phil now travels the country covering political stories."}
{"input": ["Ophelia Knits A Sweater"], "output": ["Ophelia had always wanted to learn to knit.", "She decided to try knitting a sweater.", "She worked very hard, knitting every day on the train to work.", "Finally her sweater was complete.", "Ophelia was glad that she had learned to knit."], "src": "Ophelia Knits A Sweater", "trg": "Ophelia had always wanted to learn to knit. She decided to try knitting a sweater. She worked very hard, knitting every day on the train to work. Finally her sweater was complete. Ophelia was glad that she had learned to knit."}
{"input": ["Dream"], "output": ["Hector wanted to be an actor.", "He decided to learn about the craft and take acting lessons.", "He then headed for Hollywood in hopes of having some success.", "He went to a lot of auditions and finally got chosen for a role.", "He was very happy and delighted to finally reach his dream."], "src": "Dream", "trg": "Hector wanted to be an actor. He decided to learn about the craft and take acting lessons. He then headed for Hollywood in hopes of having some success. He went to a lot of auditions and finally got chosen for a role. He was very happy and delighted to finally reach his dream."}
{"input": ["Soup Kitchen Volunteer"], "output": ["Cathy recently had the feeling of wanting to serve others.", "Cathy asked her mother for organizations that serve others.", "Cathy found a local soup kitchen that feeds the homeless.", "After meeting with the president, Cathy was asked to volunteer.", "Cathy thoroughly enjoyed volunteering at the soup kitchen."], "src": "Soup Kitchen Volunteer", "trg": "Cathy recently had the feeling of wanting to serve others. Cathy asked her mother for organizations that serve others. Cathy found a local soup kitchen that feeds the homeless. After meeting with the president, Cathy was asked to volunteer. Cathy thoroughly enjoyed volunteering at the soup kitchen."}
{"input": ["Painting Lines"], "output": ["Abby was painting the center line on the highway.", "He started daydreaming.", "He looked back to see that the line was crooked.", "He went back and painted over the line with black.", "He got home three hours late from that mistake."], "src": "Painting Lines", "trg": "Abby was painting the center line on the highway. He started daydreaming. He looked back to see that the line was crooked. He went back and painted over the line with black. He got home three hours late from that mistake."}
{"input": ["Going Down the River"], "output": ["Sarah was excited about going on the trip.", "Her and her friends were going to float down the river.", "They had all bought tubes to float down the river in.", "The day came and they all jumped on their tubes in the river.", "They spent the day floating, relaxing, and having a good time."], "src": "Going Down the River", "trg": "Sarah was excited about going on the trip. Her and her friends were going to float down the river. They had all bought tubes to float down the river in. The day came and they all jumped on their tubes in the river. They spent the day floating, relaxing, and having a good time."}
{"input": ["An Old Friend"], "output": ["After taking a long trip, Billy came back to town.", "He walked down main street and into a coffee shop.", "In the show he saw his friend, James.", "James was very excited to see Billy for the first time in years.", "James bought Billy a cup of coffee to celebrate."], "src": "An Old Friend", "trg": "After taking a long trip, Billy came back to town. He walked down main street and into a coffee shop. In the show he saw his friend, James. James was very excited to see Billy for the first time in years. James bought Billy a cup of coffee to celebrate."}
{"input": ["Harry"], "output": ["My niece's 7 year old son Harry has anger issues.", "Last month he threw his glasses into some bushes.", "He hates his glasses.", "His mother did not discipline him at all.", "I feel Harry is a disturbed child."], "src": "Harry", "trg": "My niece's 7 year old son Harry has anger issues. Last month he threw his glasses into some bushes. He hates his glasses. His mother did not discipline him at all. I feel Harry is a disturbed child."}
{"input": ["Starting School"], "output": ["Leilani woke up early for her first day of school.", "She got dressed and ready for the day.", "Her mom dropped her off in front of the school.", "The teacher greeted her at the classroom door.", "Leilani took her seat and was ready to start her day."], "src": "Starting School", "trg": "Leilani woke up early for her first day of school. She got dressed and ready for the day. Her mom dropped her off in front of the school. The teacher greeted her at the classroom door. Leilani took her seat and was ready to start her day."}
{"input": ["The Checkers Game"], "output": ["Abby and Justin were playing checkers.", "Justin suddenly pointed at the window and gestured to someone.", "Abby turned around to see who it was.", "While she was distracted, Justin moved some pieces closer.", "Abby did not notice that Justin cheated to win the game."], "src": "The Checkers Game", "trg": "Abby and Justin were playing checkers. Justin suddenly pointed at the window and gestured to someone. Abby turned around to see who it was. While she was distracted, Justin moved some pieces closer. Abby did not notice that Justin cheated to win the game."}
{"input": ["Track Meet"], "output": ["Julia lined up on the line to begin her 100 yard dash.", "The gun sounded and she took off.", "She jumped the first hurdle with ease.", "She jumped the second hurdle with ease.", "She crossed the finish line in first place, and got a gold medal."], "src": "Track Meet", "trg": "Julia lined up on the line to begin her 100 yard dash. The gun sounded and she took off. She jumped the first hurdle with ease. She jumped the second hurdle with ease. She crossed the finish line in first place, and got a gold medal."}
{"input": ["Netflix"], "output": ["Chad is going through a breakup.", "He hasn't left the couch in days.", "He just watches hours of nature documentaries on Netflix.", "The words are you still watching appeared on his screen.", "He clicks yes and nothing, his batteries were dead just like his soul."], "src": "Netflix", "trg": "Chad is going through a breakup. He hasn't left the couch in days. He just watches hours of nature documentaries on Netflix. The words are you still watching appeared on his screen. He clicks yes and nothing, his batteries were dead just like his soul."}
{"input": ["Credit Fraud"], "output": ["Carla went shopping and her credit card was declined.", "She checked her account online to see what the issue could be.", "She noticed hundreds of dollars in charges that she hadn't made!", "Carla called her bank to report fraud.", "The bank returned her money in less than an hour."], "src": "Credit Fraud", "trg": "Carla went shopping and her credit card was declined. She checked her account online to see what the issue could be. She noticed hundreds of dollars in charges that she hadn't made! Carla called her bank to report fraud. The bank returned her money in less than an hour."}
{"input": ["The Heat"], "output": ["It was 90 degrees when Harold woke up.", "It got even hotter during the day.", "Harold stayed inside and drank cold lemonade.", "In the evening, he went for a short walk.", "He returned home covered in sweat!"], "src": "The Heat", "trg": "It was 90 degrees when Harold woke up. It got even hotter during the day. Harold stayed inside and drank cold lemonade. In the evening, he went for a short walk. He returned home covered in sweat!"}
{"input": ["6 Week Course"], "output": ["I entered my Biochemistry class with confidence during the first day.", "Since I spent hours studying, I had no doubt that I would fail.", "However, I ended up failing my first two tests.", "Although there was no way of passing the class, I still tried.", "I ended up failing and took this experience as a learning one."], "src": "6 Week Course", "trg": "I entered my Biochemistry class with confidence during the first day. Since I spent hours studying, I had no doubt that I would fail. However, I ended up failing my first two tests. Although there was no way of passing the class, I still tried. I ended up failing and took this experience as a learning one."}
{"input": ["Transit Gift"], "output": ["I retired from my job in 2012.", "I worked for a mass transit agency.", "I was a big collector of transit souvenirs.", "Last week the mail room manager sent me a new souvenir fare card.", "I sent him a note thanking him for his generosity."], "src": "Transit Gift", "trg": "I retired from my job in 2012. I worked for a mass transit agency. I was a big collector of transit souvenirs. Last week the mail room manager sent me a new souvenir fare card. I sent him a note thanking him for his generosity."}
{"input": ["Symphonic"], "output": ["I went to see a performance of the local symphony.", "All their instruments were out of tune and their timing was off.", "I cringed all the way through two of their songs.", "Just as I prepared to depart, I read the performance notes.", "This symphony was composed of the local deaf and blind musicians."], "src": "Symphonic", "trg": "I went to see a performance of the local symphony. All their instruments were out of tune and their timing was off. I cringed all the way through two of their songs. Just as I prepared to depart, I read the performance notes. This symphony was composed of the local deaf and blind musicians."}
{"input": ["Jack and the Cat"], "output": ["Jack was on his way to violin practice when he saw a cat.", "The cat was small and had tabby colored fur .", "Jack reached down to pet the cat.", "The cat became frightened and ran away.", "Jack felt sad that the cat left so quickly."], "src": "Jack and the Cat", "trg": "Jack was on his way to violin practice when he saw a cat. The cat was small and had tabby colored fur . Jack reached down to pet the cat. The cat became frightened and ran away. Jack felt sad that the cat left so quickly."}
{"input": ["Scooter Injury"], "output": ["Selena got a shiny new scooter for Christmas.", "She raced it down the driveway in front of her house.", "This time, she left the kickstand down, and didn't realize it.", "She put her foot down to kick, and the kickstand stabbed her.", "She began to bleed but her mom was there to help clean the wound."], "src": "Scooter Injury", "trg": "Selena got a shiny new scooter for Christmas. She raced it down the driveway in front of her house. This time, she left the kickstand down, and didn't realize it. She put her foot down to kick, and the kickstand stabbed her. She began to bleed but her mom was there to help clean the wound."}
{"input": ["Ted Discovers a Topic of Interest"], "output": ["Ted was never a big fan of reading books.", "He often thought he should read more, but he just wasn't interested.", "One day at a friend's house, he saw a biography of a former president.", "Ted started reading this book and found it fascinating.", "Now, Ted reads at least one biography every week."], "src": "Ted Discovers a Topic of Interest", "trg": "Ted was never a big fan of reading books. He often thought he should read more, but he just wasn't interested. One day at a friend's house, he saw a biography of a former president. Ted started reading this book and found it fascinating. Now, Ted reads at least one biography every week."}
{"input": ["Trying teas"], "output": ["John always loved the smell of tea.", "One day he decided to try them all and went to the market.", "He bought all the types of tea they had and went back home.", "He brewed over sixty different teas and tasted them all.", "In the end, he realized he preferred the one he always bought."], "src": "Trying teas", "trg": "John always loved the smell of tea. One day he decided to try them all and went to the market. He bought all the types of tea they had and went back home. He brewed over sixty different teas and tasted them all. In the end, he realized he preferred the one he always bought."}
{"input": ["A Satisfying Solution"], "output": ["Every day when Aaron gets home from work, he is very tired.", "His young dog always wants to play, go for walks and be active.", "A new family moved in next door, and the young boy was bored.", "Aaron asked the boy if he'd like to play with the dog in the evening.", "The neighbor boy and the dog now spend a lot of fun time together."], "src": "A Satisfying Solution", "trg": "Every day when Aaron gets home from work, he is very tired. His young dog always wants to play, go for walks and be active. A new family moved in next door, and the young boy was bored. Aaron asked the boy if he'd like to play with the dog in the evening. The neighbor boy and the dog now spend a lot of fun time together."}
{"input": ["Justin's Internship"], "output": ["Justin always wanted to move away from home.", "He got his opportunity after he graduated college.", "He started an internship 1250 miles away from his hometown.", "He missed his family and friends.", "He moved back home when the internship was over."], "src": "Justin's Internship", "trg": "Justin always wanted to move away from home. He got his opportunity after he graduated college. He started an internship 1250 miles away from his hometown. He missed his family and friends. He moved back home when the internship was over."}
{"input": ["Dinner Mistake"], "output": ["Whitney was meeting her best friend for dinner.", "They had agreed on a Mexican restaurant.", "Whitney got there first and reserved a table.", "Brooke called Whitney to ask where she was.", "They apparently went to the same place but in different towns."], "src": "Dinner Mistake", "trg": "Whitney was meeting her best friend for dinner. They had agreed on a Mexican restaurant. Whitney got there first and reserved a table. Brooke called Whitney to ask where she was. They apparently went to the same place but in different towns."}
{"input": ["Imagination"], "output": ["Johnny had a vivid imagination.", "He always thought about new characters and different stories.", "Johnny took a creative writing class and began to write novels.", "Johnny used his incredible imagination to write interesting books.", "Johnny became a best-selling author."], "src": "Imagination", "trg": "Johnny had a vivid imagination. He always thought about new characters and different stories. Johnny took a creative writing class and began to write novels. Johnny used his incredible imagination to write interesting books. Johnny became a best-selling author."}
{"input": ["Ryan's Riddle"], "output": ["Ryan read a riddle in a newspaper.", "The newspaper claimed a prize for anyone who could solve the riddle.", "Ryan spent days trying to figure out the riddle.", "Finally, he sent in the answer to the newspaper.", "His prize ended up being a cheap plastic ring."], "src": "Ryan's Riddle", "trg": "Ryan read a riddle in a newspaper. The newspaper claimed a prize for anyone who could solve the riddle. Ryan spent days trying to figure out the riddle. Finally, he sent in the answer to the newspaper. His prize ended up being a cheap plastic ring."}
{"input": ["Smelly Monday"], "output": ["Lionel arrives home after work to a terrible smell.", "He searches each room slowly, sniffing all of the surfaces.", "The smell grows stronger as he reaches the back of the house.", "He opens the back door and finds raw sewage all over the yard.", "His plumbing bill ends up costing half his paycheck."], "src": "Smelly Monday", "trg": "Lionel arrives home after work to a terrible smell. He searches each room slowly, sniffing all of the surfaces. The smell grows stronger as he reaches the back of the house. He opens the back door and finds raw sewage all over the yard. His plumbing bill ends up costing half his paycheck."}
{"input": ["Missing Ingredient"], "output": ["Shelly's husband Rick asked her to make lasagna for dinner.", "Shelly went to the store to buy the ingredients.", "When she got home she unpacked the groceries.", "She realized she forgot to buy the noodles.", "Shelly had to make hamburgers instead."], "src": "Missing Ingredient", "trg": "Shelly's husband Rick asked her to make lasagna for dinner. Shelly went to the store to buy the ingredients. When she got home she unpacked the groceries. She realized she forgot to buy the noodles. Shelly had to make hamburgers instead."}
{"input": ["The new art teacher"], "output": ["Andy recently graduated from college with his degree in art.", "Andy decided to apply for the art teaching job at a local high school.", "Andy was selected for an interview with the principal for the job.", "After a month of waiting, Andy got the call he was waiting for.", "Andy was excited that he was hired as the new art teacher!"], "src": "The new art teacher", "trg": "Andy recently graduated from college with his degree in art. Andy decided to apply for the art teaching job at a local high school. Andy was selected for an interview with the principal for the job. After a month of waiting, Andy got the call he was waiting for. Andy was excited that he was hired as the new art teacher!"}
{"input": ["Dog problem"], "output": ["Ken took his neighbor's dog for a walk.", "He played with the dog in the park for an hour.", "When it was time to go home, he stopped for ice cream.", "While Ken was paying for his ice cream cone, the dog got away.", "Ken dropped the ice cream and run after the dog."], "src": "Dog problem", "trg": "Ken took his neighbor's dog for a walk. He played with the dog in the park for an hour. When it was time to go home, he stopped for ice cream. While Ken was paying for his ice cream cone, the dog got away. Ken dropped the ice cream and run after the dog."}
{"input": ["Linda gets a new friend"], "output": ["One day linda was driving down the road tired from work.", "Her eyes were feeling heavy until she spotted something on the road.", "It was a brown dog.", "Linda decided to pick the pup up since it didn't have a collar.", "Linda and the dog became best friends."], "src": "Linda gets a new friend", "trg": "One day linda was driving down the road tired from work. Her eyes were feeling heavy until she spotted something on the road. It was a brown dog. Linda decided to pick the pup up since it didn't have a collar. Linda and the dog became best friends."}
{"input": ["Infinite Jest Footnotes"], "output": ["I started reading Infinite Jest last week.", "It is a 1,078 page novel.", "I was into page 300 when I realized the author wrote footnotes.", "It took me two hours to catch up on the footnotes.", "I am on page 700, and will be relieved to finish this wild novel."], "src": "Infinite Jest Footnotes", "trg": "I started reading Infinite Jest last week. It is a 1,078 page novel. I was into page 300 when I realized the author wrote footnotes. It took me two hours to catch up on the footnotes. I am on page 700, and will be relieved to finish this wild novel."}
{"input": ["A Day of Skiing"], "output": ["The Wheeler family were very happy.", "They were on a wonderful ski trip out West.", "The Wheelers were skiing and having a wonderful time.", "They all skied down so many slopes.", "The entire family felt closer and had a very good trip."], "src": "A Day of Skiing", "trg": "The Wheeler family were very happy. They were on a wonderful ski trip out West. The Wheelers were skiing and having a wonderful time. They all skied down so many slopes. The entire family felt closer and had a very good trip."}
{"input": ["An Unusual Trip to the Cinema"], "output": ["My boyfriend and I decided to go see a new movie.", "We went to the theater and purchased the tickets.", "We really wanted to see a specific movie.", "We entered the theater and found it was the wrong movie playing.", "We went back to the entrance and was able to see the correct movie."], "src": "An Unusual Trip to the Cinema", "trg": "My boyfriend and I decided to go see a new movie. We went to the theater and purchased the tickets. We really wanted to see a specific movie. We entered the theater and found it was the wrong movie playing. We went back to the entrance and was able to see the correct movie."}
{"input": ["The Navy"], "output": ["Ben wanted to be in the Navy.", "He trained all week to get more fit.", "Ben decided that it was too hard and wanted to quit.", "His mother told him to never quit.", "Ben signed up and passed his fitness test!"], "src": "The Navy", "trg": "Ben wanted to be in the Navy. He trained all week to get more fit. Ben decided that it was too hard and wanted to quit. His mother told him to never quit. Ben signed up and passed his fitness test!"}
{"input": ["The Dinner"], "output": ["Marvin asked his wife to prepare a dinner for his business associates.", "She wasn't a very good cook, so she called a restaurant.", "They brought her a catered meal.", "All the guests raved about the food.", "She just smiled and pretended she'd made it all."], "src": "The Dinner", "trg": "Marvin asked his wife to prepare a dinner for his business associates. She wasn't a very good cook, so she called a restaurant. They brought her a catered meal. All the guests raved about the food. She just smiled and pretended she'd made it all."}
{"input": ["Smith Family Trip"], "output": ["The smith's wanted to get away.", "They decided to travel to the Bahama's.", "The family had the best time swimming and surfing.", "They had the time of their lives.", "The smith family decided the Bahama's would be their tradition."], "src": "Smith Family Trip", "trg": "The smith's wanted to get away. They decided to travel to the Bahama's. The family had the best time swimming and surfing. They had the time of their lives. The smith family decided the Bahama's would be their tradition."}
{"input": ["The Roadtrip"], "output": ["The couple had never driven cross-country.", "They set out on a Sunday and planned to travel for a month.", "The drive got very boring after a few days.", "Instead of continuing on, they decided to give up and turn back.", "THey were happy to be back in their own home."], "src": "The Roadtrip", "trg": "The couple had never driven cross-country. They set out on a Sunday and planned to travel for a month. The drive got very boring after a few days. Instead of continuing on, they decided to give up and turn back. THey were happy to be back in their own home."}
{"input": ["John burns the biscuits"], "output": ["John was having a get together with friends.", "He was making his grandmother's biscuit recipe.", "Friends begin to arrive and John is all over the house.", "John greets and meets with all his friends.", "John totally forgets about the biscuits until it's too late."], "src": "John burns the biscuits", "trg": "John was having a get together with friends. He was making his grandmother's biscuit recipe. Friends begin to arrive and John is all over the house. John greets and meets with all his friends. John totally forgets about the biscuits until it's too late."}
{"input": ["Salty People"], "output": ["I walked on campus and noticed a friend who I didn't see in a while.", "I tried to approach her in a friendly manner and say hi.", "When she saw her, she had a bad grin on her face.", "She remembers me however, she rushed our conversation.", "Afterwards, she quickly walked away."], "src": "Salty People", "trg": "I walked on campus and noticed a friend who I didn't see in a while. I tried to approach her in a friendly manner and say hi. When she saw her, she had a bad grin on her face. She remembers me however, she rushed our conversation. Afterwards, she quickly walked away."}
{"input": ["The Magician"], "output": ["The couple had never gone to a magic show before.", "They were excited to see what would happen.", "The magician came out and began to perform his tricks.", "They were amazed and loved every second.", "The couple had a wonderful time and both agreed to go again."], "src": "The Magician", "trg": "The couple had never gone to a magic show before. They were excited to see what would happen. The magician came out and began to perform his tricks. They were amazed and loved every second. The couple had a wonderful time and both agreed to go again."}
{"input": ["Jasper Eats A Gyro"], "output": ["Jasper has been working all afternoon and is quite hungry.", "He decides to take a break and eat a gyro.", "Jasper buys a gyro from the restaurant near his office.", "After eating it, he feels ready to work again.", "He's glad that he no longer feels so hungry."], "src": "Jasper Eats A Gyro", "trg": "Jasper has been working all afternoon and is quite hungry. He decides to take a break and eat a gyro. Jasper buys a gyro from the restaurant near his office. After eating it, he feels ready to work again. He's glad that he no longer feels so hungry."}
{"input": ["The Turtle"], "output": ["The kids had a pet turtle.", "It was green with a big shell.", "They fed it carrots every night.", "They worried that he was lonely.", "They bought a second turtle to keep him company."], "src": "The Turtle", "trg": "The kids had a pet turtle. It was green with a big shell. They fed it carrots every night. They worried that he was lonely. They bought a second turtle to keep him company."}
{"input": ["Pizza Lasagna"], "output": ["Xander loved totino's frozen pizza's.", "He would always cook three at a time and eat them all.", "One day he got creative and stacked them on top of each other.", "He threw some cheese on it and made a pizza lasagna.", "Xander now owns a million dollar company selling frozen pizza."], "src": "Pizza Lasagna", "trg": "Xander loved totino's frozen pizza's. He would always cook three at a time and eat them all. One day he got creative and stacked them on top of each other. He threw some cheese on it and made a pizza lasagna. Xander now owns a million dollar company selling frozen pizza."}
{"input": ["The Game"], "output": ["Ashley started playing an online game.", "She met a few people and liked to chat with them.", "She got sucked into the game and played many hours.", "Soon, she was addicted.", "She had to cancel her internet service to get her life back."], "src": "The Game", "trg": "Ashley started playing an online game. She met a few people and liked to chat with them. She got sucked into the game and played many hours. Soon, she was addicted. She had to cancel her internet service to get her life back."}
{"input": ["Plans Ruined"], "output": ["I challenged my friend to a game of basketball.", "After several hours, rain drops started to pour from the sky.", "Outside started to rain within seconds.", "My friend and I ran to the car in the front parking lot.", "We decided to visit another place."], "src": "Plans Ruined", "trg": "I challenged my friend to a game of basketball. After several hours, rain drops started to pour from the sky. Outside started to rain within seconds. My friend and I ran to the car in the front parking lot. We decided to visit another place."}
{"input": ["the vacuum"], "output": ["Lisa bought a new vacuum.", "It sucked up her wedding ring!", "She had to take it apart to find the ring.", "Now the vacuum is broken.", "Lisa learned an expensive lesson."], "src": "the vacuum", "trg": "Lisa bought a new vacuum. It sucked up her wedding ring! She had to take it apart to find the ring. Now the vacuum is broken. Lisa learned an expensive lesson."}
{"input": ["Beard"], "output": ["My cousin's younger sister came to a wedding with a man.", "She was 40 and unmarried, although beautiful.", "I had assumed she was a lesbian until I saw the man.", "My kids said he could be a beard, drawing a quizzical look.", "They explained a beard is a male cover."], "src": "Beard", "trg": "My cousin's younger sister came to a wedding with a man. She was 40 and unmarried, although beautiful. I had assumed she was a lesbian until I saw the man. My kids said he could be a beard, drawing a quizzical look. They explained a beard is a male cover."}
{"input": ["Unexpected Squirrel"], "output": ["The family had finally picked out a Christmas tree.", "They spent half a day searching at six different tree lots.", "Don't put the tree in the living room to sit before decorating it.", "All of a sudden he noticed movement in the branches.", "There was a squirrel that had been living in the tree!"], "src": "Unexpected Squirrel", "trg": "The family had finally picked out a Christmas tree. They spent half a day searching at six different tree lots. Don't put the tree in the living room to sit before decorating it. All of a sudden he noticed movement in the branches. There was a squirrel that had been living in the tree!"}
{"input": ["The Hurricane"], "output": ["The news warned that a strong hurricane was coming.", "The forecaster stated that everyone should evacuate their homes.", "Harold stubbornly refused to evacuate and stayed home.", "The hurricane came and ravaged many parts of the area.", "Harold was lucky and his home suffered minor damage."], "src": "The Hurricane", "trg": "The news warned that a strong hurricane was coming. The forecaster stated that everyone should evacuate their homes. Harold stubbornly refused to evacuate and stayed home. The hurricane came and ravaged many parts of the area. Harold was lucky and his home suffered minor damage."}
{"input": ["New Cast"], "output": ["Susie broke her ankle and went to the orthopedic doctor.", "The doctor gave her options for a new cast color for her ankle.", "Susie chose pink, to compliment her outfit.", "The doctor used a special saw to take the old cast off.", "Then, the doctor put a new pink cast on Susie's ankle."], "src": "New Cast", "trg": "Susie broke her ankle and went to the orthopedic doctor. The doctor gave her options for a new cast color for her ankle. Susie chose pink, to compliment her outfit. The doctor used a special saw to take the old cast off. Then, the doctor put a new pink cast on Susie's ankle."}
{"input": ["Grass Isn't Always Greener"], "output": ["Stan hated living in a small town.", "He spent hours working on his resume and applying to jobs.", "Because of his hard work, he found a job in a big city.", "Stan was thrilled to leave his small town and start his big city job.", "After a few months, Stan became homesick for small town life."], "src": "Grass Isn't Always Greener", "trg": "Stan hated living in a small town. He spent hours working on his resume and applying to jobs. Because of his hard work, he found a job in a big city. Stan was thrilled to leave his small town and start his big city job. After a few months, Stan became homesick for small town life."}
