{"text": "David noticed he had put on a lot of weight recently.", "contrastive": "\"We're seeing record flooding levels across the northern part of our state.", "similar": "David has recently gained a significant amount of weight."}
{"text": "He examined his habits to try and figure out the reason.", "contrastive": "\"He was a good child, a wonderful, sweet, loving child,\" Joangela Howard told CNN affiliate WSVN.", "similar": "He investigates his daily routines in an effort to determine the cause."}
{"text": "He realized he'd been eating too much fast food lately.", "contrastive": "Oxlade-Chamberlain.", "similar": "He has been consuming excessive amounts of fast food in recent times."}
{"text": "He stopped going to burger places and started a vegetarian diet.", "contrastive": "Van Gaal pushed a young Pique over at his grandfather's house .", "similar": "He gives up on burger places and adopts a vegetarian lifestyle."}
{"text": "After a few weeks, he started to feel much better.", "contrastive": "The bankruptcy leaves the federal government unlikely to get the loan money back.", "similar": "He recovers from his illness after a few weeks."}
{"text": "Tom had a very short temper.", "contrastive": "there's just this stage in a guy's life where they need to be free and .", "similar": "Tom was known for having a quick temper."}
{"text": "One day a guest made him very angry.", "contrastive": "SCROLL DOWN FOR VIDEO .", "similar": "A guest's unexpected visit made him extremely angry one day."}
{"text": "He punched a hole in the wall of his house.", "contrastive": "Tests revealed that a Mediterranean diet and possible calorie restriction lowered the incidence of age-related disease.", "similar": "He damages the wall of his house with his fist."}
{"text": "Tom's guest became afraid and left quickly.", "contrastive": "Regardless of all that's happened in the past few months, I'm still at the top of my game.", "similar": "Tom's guest suddenly felt fearful and departed hastily."}
{"text": "Tom sat on his couch filled with regret about his actions.", "contrastive": "They are pictured at home near Manchester with their son Allan .", "similar": "Tom sits on his couch, overcome with regret about his past actions."}
{"text": "Marcus needed clothing for a business casual event.", "contrastive": "Eleanor Harding and James White .", "similar": "Marcus obtains clothing suitable for a business casual occasion."}
{"text": "All of his clothes were either too formal or too casual.", "contrastive": "# Sydney trains” They then continued: ‘Guard says we’ll be “moving slowly”.", "similar": "He had only formal or casual clothes, with no options in between."}
{"text": "He decided to buy a pair of khakis.", "contrastive": "Nicola's family didn't approve of the match and she still doesn't speak to many of them .", "similar": "He chooses to purchase a pair of khakis."}
{"text": "The pair he bought fit him perfectly.", "contrastive": "NEW: James Anderson takes five wickets as Pakistan collapse against England .", "similar": "The pair he purchased fits him exactly."}
{"text": "Marcus was happy to have the right clothes for the event.", "contrastive": "It is notoriously difficult to .", "similar": "Marcus is pleased to have the suitable attire for the occasion."}
{"text": "Bobby thought Bill should buy a trailer and haul it with his car.", "contrastive": "communicating, such as BlackBerrys.", "similar": "Bobby recommends that Bill purchase a trailer and tow it with his vehicle."}
{"text": "Bill thought a truck would be better for what he needed.", "contrastive": "The fighting has all but stamped out any hope that Damascus could fulfill its potential as an international arts haven, as many predicted a few years ago.", "similar": "Bill believes a truck would be more suitable for his requirements."}
{"text": "Bobby pointed out two vehicles were much more expensive.", "contrastive": "March 24: A handful of members from the New Black Panther Party offer a $10,000 reward for the \"capture\" of George Zimmerman.", "similar": "Bobby noticed that the two vehicles were significantly more expensive."}
{"text": "Bill was set in his ways with conventional thinking.", "contrastive": "Indonesia is one of the world's biggest emitters of greenhouse gases due to deforestation .", "similar": "Bill has a strong preference for traditional ideas."}
{"text": "He ended up buying the truck he wanted despite Bobby's advice.", "contrastive": "Operations were halted for about half an hour before resuming.", "similar": "Despite Bobby's advice, he ultimately purchases the truck he wanted."}
{"text": "John was a pastor with a very bad memory.", "contrastive": "How did Merkel survive while the rest fell?", "similar": "John was a pastor, but his memory was quite poor."}
{"text": "He tried to memorize his sermons many days in advance but to no avail.", "contrastive": "The disease is expected to worsen as the summer progresses .", "similar": "He attempted to memorize his sermons several days in advance but failed to do so."}
{"text": "He decided to learn to sing to overcome his handicap.", "contrastive": "I saw it, the whole of the crescent saw it.", "similar": "He decides to learn singing to compensate for his physical limitations."}
{"text": "He then made all his sermons into music and sang them on Sundays.", "contrastive": "\"This election failed to give Belarus the new start it needed,\" said Tony Lloyd, who leads a short-term OSCE mission and heads the delegation of the organization's Parliamentary Assembly.", "similar": "He converted his sermons into songs and sang them on Sundays."}
{"text": "His congregation was delighted and so was he.", "contrastive": "Actors Ellen Burstyn, Billy Crudup and Josh .", "similar": "His congregation is thrilled, and he shares their joy."}
{"text": "Melody's parents surprised her with a trip to the big aquarium.", "contrastive": "the blog 'for a bit of fun', as she had always loved clothes .", "similar": "Melody's parents surprise her by taking her to the big aquarium."}
{"text": "Melody took a nap during the two hour car ride to the aquarium.", "contrastive": "The 24-year-old still has the $67million she inherited from her Page Six columnist mother after her death in 2007.", "similar": "Melody sleeps during the two-hour car trip to the aquarium."}
{"text": "When they arrived, Melody was energetic and excited.", "contrastive": "Temporary flight restrictions will be in place over the stadium, and a 1½-mile section of the adjacent Anacostia River will be closed during the Mass.", "similar": "When they arrived, Melody displayed great enthusiasm and excitement."}
{"text": "At the aquarium Melody saw sharks, tropical fish and many others.", "contrastive": "He had to undergo surgery for two and a half hours and is grateful to plastic surgeon Padraig Regan for helping him.", "similar": "Melody saw a variety of marine animals, including sharks, tropical fish, and many other species at the aquarium."}
{"text": "After five hours at the aquarium, Melody and her family drove home.", "contrastive": "Monita Wahyuni Jauw .", "similar": "After visiting the aquarium for five hours, Melody and her family head back home."}
{"text": "The math teacher announced a pop quiz as class began.", "contrastive": "There is much speculation about how the grand project could work.", "similar": "The math teacher gives a pop quiz as the class starts."}
{"text": "While some students complained, he began passing out the quiz.", "contrastive": "He added: 'All the work is done by club members who are volunteers, and the majority of the locomotives are built by them, a labour of love sometimes taking many years.", "similar": "Some students express dissatisfaction, and he starts distributing the quiz."}
{"text": "I took out my pencil and began to work.", "contrastive": "18,360 feet, the mountain stretches a length of 22 miles and a width of .", "similar": "I start working with my pencil."}
{"text": "About 5 minutes later, I finished.", "contrastive": "Inspectors visited the plant again in 2012 to determine whether any processes had changed that would require the company to obtain additional air quality permits, Huffman said.", "similar": "After a few minutes, I complete my task."}
{"text": "I stood up feeling confident and turned it in.", "contrastive": "Scroll down for video .", "similar": "I stood up feeling confident and successfully submitted it."}
{"text": "My first girlfriend i met on the internet.", "contrastive": "He also stated that because of the country's fragile security situation that there are opponents who do not wish to see Al-Ahly at the top of the league.", "similar": "I met my first girlfriend online."}
{"text": "She lives about 4 hours away from me.", "contrastive": "The Supreme Court found Nastase and his wife innocent regarding these accusations.", "similar": "She resides approximately 4 hours away from me."}
{"text": "Finally after 2 years we met each other.", "contrastive": "People have long left letters for loved ones (and the rare nemesis) with estate lawyers to be delivered after death.", "similar": "Finally, we met each other after 2 years."}
{"text": "She stayed with me for a week or two.", "contrastive": "Der Spiegel named former NSA contractor Edward Snowden as the source of its information.", "similar": "She lives with me for a week or two."}
{"text": "We decided we couldn't be apart so she moved in with me.", "contrastive": "The striking aspect of the emergence of the Spanish indignados movement was that it came about in a country which has, traditionally, had low levels of civic engagement and social participation.", "similar": "She moved in with me, and we chose not to be apart."}
{"text": "I got Charlie Horse when I was four years old.", "contrastive": "They seemed to be having a good time.", "similar": "I got a Charlie Horse at the age of four."}
{"text": "He's a brown stuffed horse, and at 35 I still sleep with him at night.", "contrastive": "her diligence, her willingness to put herself in harms way and her total .", "similar": "He's a brown stuffed horse, and even at the age of 35, he remains my nighttime companion."}
{"text": "He was my best friend, and always laid at the head of my bed.", "contrastive": "She added: ‘The brand new schedule continues to bed in at Radio 1 and we remain confident that it will emerge strongly from a period of transition.’ A BBC Radio source said the department had ‘anticipated the drop’ and that changing the make-up of the audience was 'not going to be painless'.", "similar": "He was my best friend, and always slept at the foot of my bed."}
{"text": "I laid him next to me, smelling his soft fur every night.", "contrastive": "Automakers are 'doing something .", "similar": "I place him beside me, taking in the scent of his soft fur each evening."}
{"text": "I liked to listen to my radio as I fell asleep cuddling him.", "contrastive": "court heard he was stabbed once in the back during an incident .", "similar": "As I drifted off to sleep, I enjoyed listening to my radio while snuggling with him."}
{"text": "Laura loved corn.", "contrastive": "A healthy score is between 18.5 and 24.99 - above is overweight and obese.", "similar": "Laura had a strong affection for corn."}
{"text": "So she decided to grow some in her backyard.", "contrastive": "From this list, DevOps engineer, iOS and Android developer and data scientist didn't exist on TheLadders list in 2008.", "similar": "She starts cultivating plants in her yard."}
{"text": "The whole process of growing them made her very excited.", "contrastive": "18 per cent of ladies surveyed said their profile picture was unrealistic .", "similar": "Growing them made her extremely excited throughout the process."}
{"text": "But she realized that they required too much water.", "contrastive": "UPDATED: .", "similar": "She discovered that the plants demanded an excessive amount of water."}
{"text": "So Laura quickly abandoned her corn garden idea.", "contrastive": "However, he missed knocked over coach Mike Jirschele instead.", "similar": "Laura gives up her corn garden project immediately."}
{"text": "Andy was invited to a Halloween party.", "contrastive": "If you build it, the tourists will come to your museum .", "similar": "Andy is invited to a Halloween celebration."}
{"text": "Andy figured that for dramatic effect, he should color his hair.", "contrastive": "‘There’s no .", "similar": "Andy decides to dye his hair for dramatic effect."}
{"text": "Since Andy's costume was green, Andy decided on that color.", "contrastive": "Both fans of her work: Patricia and Roy met at one of Rebecca's concerts .", "similar": "Andy chose green as the color for their costume because it matched their costume."}
{"text": "After the stylist finished the coloring, Andy regretted it.", "contrastive": "Former Leinster and Ireland legend Brian O'Driscoll has taken a new step in his career by joining BT Sport as a rugby pundit for the coming season.", "similar": "Andy regrets the hair coloring after the stylist finishes the process."}
{"text": "Andy was disappointed with his new, bold, green hair color.", "contrastive": "'Look,' he said, 'the person who is going to – and, and Secretary Clinton is really competent, capable person, and a friend – the person who is going to be the next President of the United States is the one who's going to be able to articulate the clearest vision to the American people of where they're going to take the country.'", "similar": "Andy is dissatisfied with his bold, green hair, which he recently dyed."}
{"text": "Luke was playing hockey at school.", "contrastive": "Jamie Vardy had a day to remember as he helped Leicester beat Manchester United last weekend .", "similar": "Luke plays hockey at school."}
{"text": "The game was tied and almost over.", "contrastive": "Dwight Eisenhower failed.", "similar": "The game is a draw, and it's almost finished."}
{"text": "Then Luke made the winning shot!", "contrastive": "Scroll down for video .", "similar": "Luke scores the winning basket."}
{"text": "Everybody cheered!", "contrastive": "5 things to know about Obamacare and contraceptives .", "similar": "The crowd erupted in cheers!"}
{"text": "Luke was so proud of himself!", "contrastive": "Six years his senior, she had been by his side throughout his astonishing ascent while he acted as a stepfather to her two sons from a previous relationship, Kieron, now 25 and Liam, 21.", "similar": "Luke felt incredibly proud of his own achievements!"}
{"text": "Robbie was competing in a cross country meet.", "contrastive": "'One thing led to another and I stayed the night.'", "similar": "Robbie participated in a cross-country running competition."}
{"text": "He was halfway through when his leg cramped up.", "contrastive": "In addition to the spinach and milk, very small amounts of radioactive iodine have been detected in tap water near the plant.", "similar": "He was in the middle of something when his leg suddenly cramped."}
{"text": "Robbie wasn't sure he could go on.", "contrastive": "Watson's string of birdies bettered a run of four he made in the final round when he won two years ago.", "similar": "Robbie is uncertain about being able to continue."}
{"text": "He stopped for a minute and stretched his bad leg.", "contrastive": "was promoted from the junior rank of trooper to major general and .", "similar": "He pauses for a brief moment to relieve the discomfort in his bad leg."}
{"text": "Robbie began to run again and finished the race in second place.", "contrastive": "There are two further reception rooms, one styled with Ralph Lauren wall fabrics and the other with the finest silk wallpaper.", "similar": "Robbie starts running again and ends the race in second place."}
{"text": "Jude was very excited about his college graduation ceremony.", "contrastive": "It's time we were all exposed to the bizarre symbology of state identity-politics.", "similar": "Jude is thrilled to be graduating from college, and he celebrates at the ceremony."}
{"text": "On the way to the arena, he got stuck in traffic.", "contrastive": "'Some of the world’s worst thugs and their cronies': Human Rights Foundation claims Jennifer Lopez has made a fortune playing parties for world tyrants .", "similar": "He encounters traffic delays on the way to the arena."}
{"text": "He only had an hour before the ceremony started.", "contrastive": "'That's nothing against Jim and Robbo but I would like to see him back with us.", "similar": "He has a limited time before the ceremony commences."}
{"text": "He thought he wasn't going to be able to make it in time.", "contrastive": "Mission controllers then face a nervous seven-hour wait for Philae to reach the surface.", "similar": "He was worried he wouldn't arrive on schedule."}
{"text": "Luckily, the traffic cleared up in time for him to get to the ceremony.", "contrastive": "During the investigation it also emerged that Mr Gargan had left a previous post at the British embassy in Paris after he developed a close relationship with a senior colleague’s daughter.", "similar": "Luckily, the traffic congestion subsides just in time for him to attend the ceremony."}
{"text": "Beth sent a letter to Santa Claus.", "contrastive": "Ameida said he'd gotten tickets to see Jackson at his \"This Is It\" concerts beginning on July 13 in London.", "similar": "Beth writes to Santa Claus."}
{"text": "She received a letter back in the mail.", "contrastive": "Proficient: The Duchess proved herself adept at playing the ukulele during yesterday's visit .", "similar": "She gets a letter sent back to her via the postal service."}
{"text": "Beth did not think that it sounded like the real Santa.", "contrastive": "3.", "similar": "Beth doubts that the voice really belongs to Santa."}
{"text": "She sent another letter calling that Santa a fake.", "contrastive": "pepper spray, knocked her down, stepped on her head and snarled at her, .", "similar": "She sends another letter, accusing Santa of being a fake."}
{"text": "She did not receive another letter back in the mail.", "contrastive": "'We approached her again as she walked up to her house and she said \"Come in Martin\".", "similar": "She fails to get another response in the mail."}
{"text": "Our granddaughter Anna is very fussy about her clothes.", "contrastive": "I was at home when I saw Swallow outside his house .", "similar": "Anna is quite picky about her clothing choices."}
{"text": "She is only two, but wants to pick her outfits.", "contrastive": "Hoever, Treasurer Joe Hockey has ordered the property, which features stunning harbour views, be sold immediately after deciding the purchase contravened foreign investment rules .", "similar": "She is only two years old, but prefers to choose her own outfits."}
{"text": "Today her mom wanted Anna to wear a dress.", "contrastive": "Nottingham University study has concluded that this lack of action could create a long-term ‘cycle of disadvantage’ for obese children .", "similar": "Today, Anna's mom insisted that she wear a dress."}
{"text": "Anna started crying.", "contrastive": "failing to dispense methadone responsibly in 2004 and for failing to .", "similar": "Anna begins to cry."}
{"text": "They let her wear a t-shirt and shorts instead.", "contrastive": "Crime scene: Henderson police investigators entered the home, pictured, on Friday - after relatives had asked them to check on the family's welfare four times .", "similar": "They allow her to wear casual clothing, consisting of a t-shirt and shorts, instead."}
{"text": "Jake needed a ride to the store.", "contrastive": "Daily Mail Reporter .", "similar": "Jake requires a ride to the store."}
{"text": "His girlfriend was working and wouldn't take him.", "contrastive": "Associated Press .", "similar": "She wouldn't take him because his girlfriend was working."}
{"text": "His brother was in the middle of a movie and said no.", "contrastive": "Yet those wrongdoers are still there today, at the top of the News International empire and ordinary staff at the paper are paying with their livelihoods,\" NUJ General Secretary Michelle Stanistreet said in a statement.", "similar": "His brother is watching a movie and refuses to be interrupted."}
{"text": "Jake decided to take the bus to the store.", "contrastive": "It is an undisputed fact that when you mess you the bull, you get the horns, but what happens when you mess with your wife?", "similar": "Jake chooses to travel to the store by bus."}
{"text": "He got what he needed all by himself.", "contrastive": "'They made the country proud to go through the group stage in the way that they did.'", "similar": "He acquires what he required without any outside assistance."}
{"text": "I'd been looking for a stand for my TV.", "contrastive": "\"It wasn't traumatic.", "similar": "I'd been searching for a TV stand for some time."}
{"text": "I looked everywhere, but the ones I saw were expensive.", "contrastive": "Operator:  And you’re sure they’re deceased?", "similar": "I searched extensively, but the ones I found were too costly."}
{"text": "I happened upon a yard sale on my way home.", "contrastive": "Experts also warn that people at Coachella should also take precaution to touch as few surfaces as possible while in public restrooms.", "similar": "On my way home, I stumbled upon a yard sale."}
{"text": "She had a stand that was perfect, and cheap.", "contrastive": "Nearly 30 bombs have reportedly been dropped from fighter jets over the past two days during the struggle to beat the extremists, who have links to al-Qaeda.", "similar": "She finds a stand that is both perfect and affordable."}
{"text": "It looks great in my den.", "contrastive": "He adds: 'The aim is to bring people round from the hypnosis so they feel as refreshed and revitalised as they do after a two week break.", "similar": "It looks wonderful in my sitting room."}
{"text": "Sally had a root canal this morning, as she had a damaged root.", "contrastive": "19:52 EST, 6 June 2013 .", "similar": "Sally undergoes a root canal procedure to repair a damaged root in the morning."}
{"text": "After the procedure, the dentist wrote her a prescription.", "contrastive": "Do you know someone who should be a CNN Hero?", "similar": "The dentist writes her a prescription after the procedure."}
{"text": "She headed straight to the pharmacy to fill her medication.", "contrastive": "When the Coalition came to power in May 2010 the starting salary for higher rate tax stood at just £43,875.", "similar": "She goes directly to the pharmacy to get her medication filled."}
{"text": "She handed the prescription to the technician and waited patiently.", "contrastive": "'(And) Women in their forties can improve their fertility by leading a healthy lifestyle including eating a balanced diet with high protein and high fibre, exercising regularly and avoiding smoking, drinking and using recreational drugs.'", "similar": "She gives the prescription to the technician and remains there, waiting patiently."}
{"text": "The technician called her name and she paid for the prescription.", "contrastive": "'She was very shy, very quiet, it was obvious she was under a strict regime.", "similar": "The technician calls her name, and she pays for the prescription."}
{"text": "My dog is terrified of thunder.", "contrastive": "'Across the board, he has put his heart and soul into this thing, and he has taken it very seriously,' Obama said.", "similar": "My dog is extremely frightened by thunder."}
{"text": "There was a storm today.", "contrastive": "A crane hoists the frame of the bus which crashed and burned on the road from l'Alpe d'Huez in the French Alps.The driver was killed, and three people were severely injured .", "similar": "A storm occurred today."}
{"text": "He came running into my office.", "contrastive": "laundry and home care products in Ukraine, said yesterday that the .", "similar": "He rushes into my office."}
{"text": "He hid in the kneehole of my desk, trembling.", "contrastive": "He has pleaded guilty to five counts of indecent assault, five of indecency and one assault with indecency along with the most serious charge of persistent sexual abuse of a child .", "similar": "He secretly hides under the kneehole of my desk, shaking with fear."}
{"text": "Once the storm was over, he acted like a brave dog again.", "contrastive": "‘Probably less than three other people have done this - I still have one more to jump.", "similar": "After the storm had passed, he showed his courage again."}
{"text": "Mark and Jo were brainstorming ideas for a children's show.", "contrastive": "The day of the tragedy, Caffall's mother said her son had been having emotional problems.", "similar": "Mark and Jo think of concepts for a children's television program."}
{"text": "Mark suggested that a monster attacks the children.", "contrastive": "For me, it's still about discovery.", "similar": "Mark thinks a monster is attacking the children."}
{"text": "Jo laughed because he thought Mark was joking.", "contrastive": "According to the Department of Labor, the company was paying its workers far below the $8 per hour minimum wage applicable in California at the time.", "similar": "Jo laughs because he believes Mark is joking."}
{"text": "Mark was confused because he thought it was a great idea.", "contrastive": "An American company has created a wristband that uses a form of shock therapy to encourage the development of good habits.", "similar": "Mark is puzzled because he considered it an excellent concept."}
{"text": "Mark left in a huff for having his ideas mocked.", "contrastive": "Several research papers have studied the phenomenon, though most prosecutors argue it's being used as an excuse by defendants to escape justice.", "similar": "Mark stormed off in anger after his ideas were ridiculed."}
{"text": "Ben's Boy Scout Troop worked for weeks on a float.", "contrastive": "Hilton's Martin Rinck adds: \"China skipped the whole desktop/MacBook/computer thing and went straight to mobile.\"", "similar": "Ben's Boy Scout Troop spent several weeks constructing a float."}
{"text": "It was going to be in the town's July 4th parade.", "contrastive": "Money: The floors of Floyd Mayweather's house seems to be lined with hundreds of bank notes (pictured) The Instagram video also shows the many luxurious properties owned by Mayweather, including his Las Vegas mansion (pictured) Jewels: The video showing off Mayweather's unbelievable wealth and expensive possessions surfaces just two weeks before one of the most anticipated fights in recent boxing history .", "similar": "The town's July 4th parade will feature this event."}
{"text": "They got it finished just in time.", "contrastive": "In addition to our on-the-ground work, we're looking ahead and changing the 2016 presidential primary process so that we have better debates, handpicked moderators and an earlier convention.", "similar": "They complete the task just as the deadline arrives."}
{"text": "It was big enough for his whole troop to ride on.", "contrastive": "I don’t know if that will mean more pressure this season but we certainly have more hunger than ever.", "similar": "This beast was large enough to accommodate his entire troop of riders."}
{"text": "They felt proud as they went down the street as people clapped.", "contrastive": "By .", "similar": "They feel proud as they walk down the street, receiving applause from the crowd."}
{"text": "Francis has always wanted to learn how to tie a necktie.", "contrastive": "players.", "similar": "Francis has always wanted to master the skill of tying a necktie."}
{"text": "He decides to practice until he can tie one.", "contrastive": "Well here we are, it's 2007, gas is flowing from Qatar to the UAE and it's done.", "similar": "He keeps practicing until he can tie one."}
{"text": "At first he finds it very difficult.", "contrastive": "Research by Which?", "similar": "He initially struggles with it."}
{"text": "But eventually he is able to tie a necktie very well.", "contrastive": "Captain America' can play in Peoria just as well as Hong Kong.", "similar": "He eventually becomes proficient in tying a necktie."}
{"text": "Francis is proud of himself for learning how to tie a necktie.", "contrastive": "'Doctors said it would take me around 18 months to walk again but it's taken me around four-and-a-half months.", "similar": "Francis is proud of his achievement in mastering the skill of tying a necktie."}
{"text": "Eric and his wife had a daughter named Meg.", "contrastive": "Ms Sordal gave a different version, describing how Mr Scott only offered to help the woman and her child and when confronted by Mr Romero, had his hands down, backed away and said, 'I don't want any trouble'.", "similar": "Eric and his wife have a daughter, Meg."}
{"text": "Eric's wife passed away.", "contrastive": "Komsomolskaya station's baroque-style decor, historical mosaics and chandeliered ceilings resemble a grand ballroom.", "similar": "Eric becomes a widower."}
{"text": "Eric and Meg were very sad.", "contrastive": "Panic everyone!", "similar": "Eric and Meg are overcome with sorrow."}
{"text": "Eric met a woman and married her 5 years after his wife died.", "contrastive": "Anti gay-marriage protestors clashed with riot police in Paris .", "similar": "Eric marries a woman five years after his first wife's passing."}
{"text": "Meg is now happy with her new stepmother.", "contrastive": "While reversing, the Micra collided with the victim, causing serious injuries.", "similar": "Meg is now happy with her new mother-in-law."}
{"text": "My cousin took me to a local restaurant.", "contrastive": "Cuccinelli is backed by the tea party; Bolling had support from establishment .", "similar": "My cousin took me to a nearby eatery."}
{"text": "We ordered a large pizza.", "contrastive": "German doctors told Mrs Naylor that she is responding well to treatment and hope that the tumour will continue to shrink.", "similar": "We purchased a big pizza."}
{"text": "Since she never tasted the food there, she didn't know if it was good.", "contrastive": "Three of the injured were in critical condition, KVUE said; the fourth was treated and released .", "similar": "Since she never tried the food, she is unsure whether it is good or not."}
{"text": "I began to start sneezing.", "contrastive": "The .", "similar": "I start sneezing suddenly."}
{"text": "To make matters worse, I caught an allergy.", "contrastive": "A similar campaign in the UK will see a £10 note, pictured, with the face of author Jane Austen on it go into circulation in 2017 .", "similar": "I developed an allergy on top of everything else."}
{"text": "When I was 12 years old, my dad got angry and kicked me aggressively.", "contrastive": "Opulent: The Banu Sasan, a group of burglars, poets  and rogues -  provided a contrast to the glories of Islam's golden age.", "similar": "When I was 12 years old, my dad's anger led to him forcefully kicking me."}
{"text": "Afterward, I became very ill, and tasted something metallic.", "contrastive": "He has had that experience from 2011 and done it for the Lions.", "similar": "After recovering, I felt unwell and had a metallic taste in my mouth."}
{"text": "I went to a doctor, and was informed that one of my kidneys was dead.", "contrastive": "A look into the future: A new report by the Municipal Arts Society shows how seven new skyscrapers will impact light in the park.", "similar": "After visiting a doctor, I was told that one of my kidneys had ceased to function."}
{"text": "Ever since, I've had swelling and hypertension.", "contrastive": "Roland Peter Wright, 83,  head teacher between 1959 and 1970, was convicted of 12 counts of sexual assault against five pupils aged eight to 13.", "similar": "Since then, I've experienced swelling and hypertension."}
{"text": "I started taking medications to combat the symptoms at 13.", "contrastive": "We remain open of course to success of negotiations.’ Many .", "similar": "I began taking medications to alleviate symptoms from age 13."}
{"text": "Fred noticed that he feet got very hot in the summer.", "contrastive": "Then, Harvey played his song about the 1970s gas crisis, \"Cheaper Crude or No More Food.\"", "similar": "Fred discovered that his feet become extremely hot during the summer."}
{"text": "He decided he needed new footwear.", "contrastive": "Response: Flashing lights could be seen gathered in front of the South Portico of the building tonight .", "similar": "He realizes he requires new shoes."}
{"text": "Fred invested in a nice new pair of sandals.", "contrastive": "\"This has been the most incredible week, and I've never been happier.\"", "similar": "Fred purchases a high-quality pair of sandals."}
{"text": "He loved wearing his new sandals.", "contrastive": "', he said: 'Thanks for all your worry and concern but don't get too stressed about me, things aren't that bad.", "similar": "He enjoyed wearing his fresh sandals."}
{"text": "Fred was glad that his feet no longer got hot in the summer.", "contrastive": "For more mental_floss articles, visit mentalfloss.com .", "similar": "Fred is relieved that his feet are no longer hot in the summer."}
{"text": "Last year I took a day trip to see a friend in Maine.", "contrastive": "\"If you can get past the government, the people there are great.\"", "similar": "I visited a friend in Maine on a day trip last year."}
{"text": "I took the Amtrak from Boston to Saco, Maine.", "contrastive": "Out of this world: Amesbury resident Phil Green found this mud-covered rock in a river behind his house, and recently discovered it was a piece of a Russian space station .", "similar": "I boarded the Amtrak train, traveling from Boston to Saco, Maine."}
{"text": "We had lunch at Gritty's in Portland.", "contrastive": "despite her having classic symptoms, such as dizziness and chest pain.", "similar": "We ate at Gritty's in Portland during lunch."}
{"text": "My friend drove me back to the train station.", "contrastive": "He said he would 'muck about' posing dead bodies of men and women together before taking photographs.", "similar": "My friend gives me a ride back to the train station."}
{"text": "I had a nice time and will visit my friend this year.", "contrastive": "BWS is a rare genetic condition, affecting around one in every 15,000 births.", "similar": "I had a pleasant experience and plan to see my friend this year."}
{"text": "Heather and her family really wanted tacos for dinner.", "contrastive": "Has frontline reporting become more dangerous?", "similar": "Heather and her family long for tacos for dinner."}
{"text": "Two of the children wanted chicken tacos.", "contrastive": "I just completely zoned out and saw it as just another championship,\" she says.", "similar": "Two children desired chicken tacos."}
{"text": "The other two children wanted beef.", "contrastive": "witnesses had their evidence scrutinised to the standards of a criminal .", "similar": "The other two children desire beef."}
{"text": "Heather took great care preparing all the tacos that each wanted.", "contrastive": "Fast food outlet will repay more than $645,000 to employees it had underpaid following audit .", "similar": "Heather goes to great lengths to prepare all the tacos that each person wants."}
{"text": "Everyone sat down at dinner and enjoyed eating the tacos together.", "contrastive": "The numbers speak for themselves.", "similar": "Everyone sits down for dinner and shares the tacos as a group."}
{"text": "Anna was filling her bird feeders.", "contrastive": "this kind of activity, regardless of what happened to the original Silk .", "similar": "Anna refills her bird feeders."}
{"text": "But a chunk of suet fell onto the ground.", "contrastive": "A manhunt has been launched to find three alleged accomplices who are said to have fled the scene in a red mini van .", "similar": "A piece of suet accidentally drops onto the ground."}
{"text": "Her dog rushed over and lapped it up!", "contrastive": "Murder probe: Dr Gary Hughes was found dead at his home in Feock, and his wife Marion has been detained .", "similar": "Her dog runs quickly to drink the liquid."}
{"text": "Anna was astonished.", "contrastive": "'It is a nice, original example, with a proper engine.", "similar": "Anna was extremely surprised."}
{"text": "She had no idea dogs loved bird food!", "contrastive": "Stroll under the blossoms .", "similar": "She was unaware that dogs have a fondness for bird food."}
{"text": "James had an Xbox 360.", "contrastive": "She says the committee passed on chance to put global spotlight on person or cause .", "similar": "James had an Xbox 360."}
{"text": "His friends had Xbox accounts online.", "contrastive": "Iran insists that like other countries, it has a right to develop nuclear power for peaceful purposes.", "similar": "His friends had online Xbox accounts."}
{"text": "James registered, but was still unable to connect online.", "contrastive": "The wilderness area also has cultural resource sites for visitors to explore the settlements and lives of Native Americans who settled on the land over 10,000 years ago.", "similar": "James signs up, yet he fails to log in online."}
{"text": "He called for tech support, but they couldn't help either.", "contrastive": "03:03 EST, 9 November 2012 .", "similar": "He requested assistance from technical support, but they were unable to provide any help."}
{"text": "He realized he would need a new Xbox.", "contrastive": "The United States and Mexico combined had offered rewards of more than $7 million for information leading to his capture.", "similar": "He will require a new Xbox."}
{"text": "The people gathered to protest the court's ruling last week.", "contrastive": "Several prominent figures called on the young mother to stop her protest.", "similar": "The crowd assembled to express their discontent with the court's decision from the previous week."}
{"text": "They held signs and chanted loudly.", "contrastive": "Egyptian media say 11 protesters were injured as masked assailants attack with birdshort and knives during demonstration against President Morsi .", "similar": "They carry signs and shout loudly."}
{"text": "The police stormed in and arrested them all.", "contrastive": "With inflation at its target of 2 per cent, the Bank said it sees ‘no immediate need to raise bank rates even if the 7 per cent unemployment threshold were to be reached in the near future’.", "similar": "The police suddenly burst in and apprehend everyone."}
{"text": "Now there are more protests in surrounding towns.", "contrastive": "A spokesperson for Honeywell says the company has no plans to revive the project unless federal regulators demand it be put into cockpits or airlines ask for it.", "similar": "There are additional protests happening in nearby towns."}
{"text": "The movement is gaining momentum!", "contrastive": "She had tweeted: ‘Dubious of .", "similar": "The movement is growing in strength and popularity."}
{"text": "My roommate and I bought a new futon for our living room.", "contrastive": "The Most Rev Vincent Nichols added Christianity 'was literally born in the Middle East' as he delivered Midnight Mass to worshippers in London's Westminster Cathedral.", "similar": "My roommate and I purchase a new futon for our living room."}
{"text": "The futon came in a huge box.", "contrastive": "to the finish in Plymouth.", "similar": "The futon arrived in a massive package."}
{"text": "We set the box out on the curb to be picked up on trash day.", "contrastive": "VERDICT: I served prawn mousse wrapped in smoked salmon on this slab and my guests loved it.", "similar": "We put the box on the curb to be collected on trash day."}
{"text": "Much to our chagrin, the garbage men left the box on the curb.", "contrastive": "Their newborns will be named after DNA tests can determine their gender in a few weeks' time.", "similar": "We are dismayed that the garbage men left the box on the curb."}
{"text": "We had to take the box to the dump ourselves.", "contrastive": "I encourage the president to sign this legislation and work with us,' he said.", "similar": "We had to transport the box to the dump without any assistance."}
{"text": "Bob chased after the rainbow through the fields.", "contrastive": "13:32 EST, 6 November 2013 .", "similar": "Bob pursued the rainbow, running through the fields."}
{"text": "He ran after it over forests and streams.", "contrastive": "\"I missed that feeling of seeing what's going to happen and also being able to catch a wave before other people know the wave is there, and that's really what a venture capitalist does.", "similar": "He pursued it through forests and across streams."}
{"text": "Bob thought he'd lost it behind a boulder.", "contrastive": "Firefighter: It was Anthony Bruno's wedding day on November 30th and he was shot dead in the early hours of December 1 .", "similar": "Bob believed he left it behind a large rock."}
{"text": "He found it waiting for him on the other side.", "contrastive": "Wildlife experts suggest that foxes do not generally pose a threat to hedgehogs but there are rare incidents where foxes can prey on the spiky hedgehog.", "similar": "He discovered it, already there, on the other side."}
{"text": "When Bob dived for the pot of gold, he woke up.", "contrastive": "The researchers then extract this bacteria, with the protons, electrons and carbon dioxide and metabolically engineers it to make isopropanol.", "similar": "Bob goes underwater, only to find that he was just dreaming when he wakes up."}
{"text": "Soren ran through the airport, pulling her bags behind her.", "contrastive": "If political parties are essentially brands -- and they are -- then contemporary political conventions should be occasions when those brands are both strengthened and nuanced.", "similar": "Soren rushes through the airport, trailing her luggage."}
{"text": "The female voice above her announced final boarding to Soren's fligh.", "contrastive": "Registered: McDaniel's crime is public record on the Georgian sex offender registry, as part of his release requires him to keep authorities constantly updated on his whereabouts .", "similar": "The female voice above her announces the final boarding call for Soren's flight."}
{"text": "She yelled for them to wait as she neared her gate, waving her arms.", "contrastive": "Officers responding to the storage locker around 7:30 pm immediately noticed a significant amount of bombs and bomb making materials, police said.", "similar": "She signals to them to wait, waving her arms frantically, as she approaches her gate."}
{"text": "The attendant at the desk gave Soren a sad, sympathetic look.", "contrastive": "PUBLISHED: .", "similar": "The attendant at the desk looks at Soren with a sad and sympathetic expression."}
{"text": "Nearly out of breath, Soren presented her pass and boarded the plane.", "contrastive": "The club was alerted to the new image by two people who noticed it at the end of last year on satellite pictures used by Apple for its smartphone maps.", "similar": "Soren boards the plane after presenting her pass, nearly out of breath."}
{"text": "Charles had always wanted to have a college degree.", "contrastive": "He said: ‘The deal with Real Madrid did not happen because if you have money and you go to buy a shirt or a pair of trousers, you have to decide whether to buy it or not — Real Madrid chose not to.", "similar": "Charles had always dreamed of earning a college degree."}
{"text": "He worked hard for many years to complete his courses.", "contrastive": "| .", "similar": "He puts in a lot of effort over a long period of time to finish his studies."}
{"text": "Finally he turned in his last college essay.", "contrastive": "It took about 30 seconds to reach steam, and the middle section lifts out to become a handheld steamer.", "similar": "He submits his final college essay."}
{"text": "All of his family attended his college graduation.", "contrastive": "But the proposed developments would lead to 'significant increase in night-time background noise levels'.", "similar": "His entire family is present at his college graduation."}
{"text": "Charles was proud that he had a college degree.", "contrastive": "Scroll down for video .", "similar": "Charles is proud to have earned a college degree."}
{"text": "Stacy originally thought she wanted five kids.", "contrastive": "It was bullying.", "similar": "Stacy initially believed she was destined for a family of five children."}
{"text": "She and Bob first were blessed with a daughter.", "contrastive": "UPDATED: .", "similar": "She gives birth to a daughter with the help of Bob."}
{"text": "Two years later, they had twin girls.", "contrastive": "Alan Hansen sparked a row by using the term last year on the day that John Terry was charged with racially abusing Anton Ferdinand.", "similar": "After two years, they have twin daughters."}
{"text": "Now, Stacy is selling all her maternity and baby clothes.", "contrastive": "Warning: As a result of greater lorry security, cars and motor homes are a prime target for illegal immigrants in Calais who are trying to enter the UK .", "similar": "Stacy is selling her maternity and baby clothing."}
{"text": "She says she has changed her mind about wanting five kids!", "contrastive": "The freephone NSPCC helpline 0808 800 5000 is available for anyone to report a concern or seek advice relating to this incident.", "similar": "She has reconsidered her initial desire for having five children."}
{"text": "Lance was going to make a bet.", "contrastive": "How dare you!'", "similar": "Lance intends to make a wager."}
{"text": "He was thinking of making it a big one.", "contrastive": "But my, can traveling to a wedding get expensive.", "similar": "He plans to make it a significant event."}
{"text": "He was going to bet all of his savings on a Race.", "contrastive": "For more information, go to www.visitskane.com/en.", "similar": "He decides to risk all his savings on a single race."}
{"text": "The day of the Race is here.", "contrastive": "As President, she has often been combative, accusing opponents of undermining her ability to govern.", "similar": "The day of the race has finally arrived."}
{"text": "Lance crosses the finish line and Wins it all!", "contrastive": "AU leadership could end sexual exploitation and abuse by .", "similar": "Lance crosses the finish line, and he ultimately achieves victory."}
{"text": "Larry worked at an accounting firm.", "contrastive": "17:31 EST, 12 September 2012 .", "similar": "Larry was employed at an accounting firm."}
{"text": "It was a boring job but it paid the bills.", "contrastive": "But if you happen to be in the village around that time, you'd be very welcome to try them out.", "similar": "The job was uninteresting, but it provided financial stability."}
{"text": "Larry grew tired of doing the same thing every day.", "contrastive": "He added: 'My family all tell me that I’m exactly like my dad was.", "similar": "Larry becomes disenchanted with the monotony of his daily routine."}
{"text": "He had the idea to have an office party.", "contrastive": "\"I know [he was involved] because my brother confessed to me that he had killed Meredith and he asked me to hide a blood-stained knife and set of keys,\" he said, according to an attachment to Knox's appeal documents.", "similar": "He decides to host a company celebration."}
{"text": "By lunch the whole office had passed out and nothing got done.", "contrastive": "‘I have been so touched and moved, beyond all words, by the people who have come up to me today -- strangers on the airplane, the flight attendants, and most of all, my family to say welcome home,’ Peter Curtis was quoted as saying.", "similar": "The office staff had succumbed to exhaustion by lunchtime, resulting in a complete lack of productivity."}
{"text": "Ava was six years old.", "contrastive": "An effort is also under way to put a proposal to legalize same-sex marriage on the November ballot in Maine, where voters previously overturned a 2009 state law authorizing it.", "similar": "Ava was six years old at that time."}
{"text": "She wanted to learn to swim.", "contrastive": "\"It's the fastest-growing sport in the world,\" says Mike Straka, a long-time MMA journalist and broadcaster who now works in the fight industry.", "similar": "She decides to learn the art of swimming."}
{"text": "Her mom took her to the pool.", "contrastive": "'But there are areas where we can in fact enhance what is already being done by companies like TechShop.'", "similar": "Her mom takes her to the pool."}
{"text": "There, she patiently taught Ava the basics.", "contrastive": "\"All she did was be a good mother, sacrifice her life for us,\" Francisca says.", "similar": "She patiently instructed Ava in the fundamentals."}
{"text": "Soon Ava was paddling all by herself!", "contrastive": "Former President George H.W.", "similar": "Ava learns to paddle independently and is soon doing it on her own."}
{"text": "James was walking down a street one afternoon.", "contrastive": "A funeral service for Parsons is scheduled for Saturday.", "similar": "James walks down a street one afternoon."}
{"text": "He noticed a wallet lying on the ground.", "contrastive": "conservative bloc who often casts decisive votes in close cases, .", "similar": "He sees a wallet left on the ground."}
{"text": "He decided to bring it to the police station.", "contrastive": "Raymond van Barneveld 5-7 Kim Huybrechts .", "similar": "He takes the item to the police station."}
{"text": "That evening, the phone rang.", "contrastive": "'But it is for people who are really into their fitness.", "similar": "The phone started ringing in the evening."}
{"text": "The old man had called to thank James for returning his wallet.", "contrastive": "His pinpoint pass, his seventh assist in the EPL this season, left Costa to score his ninth in seven games since moving from Atletico Madrid, another key Mourinho signing.", "similar": "The old man expresses his gratitude to James for the returned wallet."}
{"text": "Chad's dog would always jump on people.", "contrastive": "'I ran to the ward.", "similar": "Chad's dog is known for jumping on people."}
{"text": "Chad couldn't bring his dog anywhere.", "contrastive": "They stood outside and embraced each other as they called roll to make sure everyone had escaped.", "similar": "Chad is unable to take his dog anywhere."}
{"text": "Chad decided to hire a dog trainer.", "contrastive": "‘You’ve got to feel sorry for the lad who bowled the bouncer but he can’t feel any guilt that he bowled a bouncer.", "similar": "Chad chooses to employ a dog trainer."}
{"text": "The trainer taught the dog how to behave.", "contrastive": "‘We started selling them to help raise money for charity and people keep asking for them.", "similar": "The trainer instructs the dog on proper behavior."}
{"text": "Chad was proud to finally show off his dog to others.", "contrastive": "'But through all of that it's a way of life that most of them wouldn't swap, a lot of people go off and do other things and then come back to it.'", "similar": "Chad was proud to exhibit his dog to others."}
{"text": "Karl was a good baseball player in his youth.", "contrastive": "'That's the first time in going on 28 years that we have found somebody down in a storm drain,' he said.", "similar": "Karl excelled at baseball during his younger years."}
{"text": "As a middle-aged man, he joined an adult baseball team.", "contrastive": "Two-fifths of all prisoners have the average reading age of an 11-year-old,’ he added.", "similar": "As a middle-aged man, he becomes part of an adult baseball team."}
{"text": "Karl is very competitive and will do anything to win.", "contrastive": "It certainly damaged her image — reviving the drugs scandal that erupted during the trial of her former assistants just as she was hoping to put it behind her.", "similar": "Karl is extremely competitive, and will stop at nothing to emerge victorious."}
{"text": "One day, he slid into second base to beat a throw and hurt his knee.", "contrastive": "'Not even a power cable.", "similar": "He slides into second base to avoid a tag, and in the process, injures his knee."}
{"text": "The injury made Karl realize that he wasn't young anymore.", "contrastive": "It would leave the government unable to guarantee savings in the event of a collapse, echoing the crisis which engulfed Iceland in 2008 when all of its banks were allowed to fail.", "similar": "Karl comes to the realization that his youth has passed due to the injury."}
{"text": "Nick was trying to buy a house.", "contrastive": "Kristina Lynn Moore, 48, of Katy, who was a teacher at Thornton Middle School in Cypress-Fairbanks is charged with sexual assault of a child during the alleged relationship.", "similar": "Nick attempts to purchase a residence."}
{"text": "He lived with a roommate that he couldn't trust.", "contrastive": "'The last one was the week before Christmas in 2012.", "similar": "He shared a living space with an unreliable roommate."}
{"text": "His stuff always ended up missing from his bedroom.", "contrastive": "Sanders .", "similar": "His possessions consistently vanish from his bedroom."}
{"text": "He knew it had to be Nick so he decided he would move out.", "contrastive": "By .", "similar": "He concludes that it must be Nick, and he chooses to relocate."}
{"text": "He found a place and moved out as fast as he could.", "contrastive": "Messi sparked Barca's comeback against PSG by scoring the equaliser in their 3-1 win at the Nou Camp - a result that saw them qualify as Group F winners at the expense of Laurent Blanc's side.", "similar": "He discovered a location and vacated it at a rapid pace."}
{"text": "Jody bought a goldfish from the pet store.", "contrastive": "He says: 'Sometimes we have to deal with some difficulties, but you have to try to move on.'", "similar": "Jody acquired a goldfish from the pet store."}
{"text": "She noticed that the goldfish looked quite fat.", "contrastive": "A Year of British Festivities For Families and Friends reportedly .", "similar": "She observed that the goldfish appeared to be quite plump."}
{"text": "Her mom told her that the goldfish had too much to eat.", "contrastive": "Page was a member, identifying himself as a Northern Hammerskin, part of the group's upper Midwest branch.", "similar": "Her mom warns her that the goldfish has eaten too much."}
{"text": "Jody adjusted her pet's diet.", "contrastive": "Pimp my ride .", "similar": "Jody alters her pet's eating habits."}
{"text": "The goldfish got skinnier and healthier.", "contrastive": "He wrote: ‘I hope the girls whose boyfriends died to save them were worthy of the sacrifice.’ Indignant: Wall Street Journal columnist James Taranto sparked outrage with this tweet .", "similar": "The goldfish loses weight and becomes healthier."}
{"text": "Jane had recently gotten a new job.", "contrastive": "There appears to be little pressure from above for Suarez to race himself back to fitness, but the PFA Player of the Year is passing tests at an alarming rate.", "similar": "Jane has acquired a new job recently."}
{"text": "She was nervous about her first day of work.", "contrastive": "Norwich likely to be priced out of Jordan Rhodes bid .", "similar": "She feels apprehensive about her inaugural day on the job."}
{"text": "On the first day of work, Jane overslept.", "contrastive": "George Hammer, the owner of Urban Retreat at Harrods, the world’s largest hair and beauty salon, said: ‘Chemical companies have a huge vested interest in keeping this under wraps.’ The warning is set out in the journal Materials.", "similar": "Jane sleeps in on her first day at work."}
{"text": "Jane arrived at work an hour late.", "contrastive": "Htein Lin was imprisoned for a month in Rangoon, two years at Mandalay Prison, and 4-1/2 years at Myaungmya Prison in the south.", "similar": "Jane is late to work by an hour."}
{"text": "Jane did not make a good impression at her new job.", "contrastive": "Speaking to Italian newspaper La Repubblica as the case reached its closing stages she said: ’I want to speak to them.", "similar": "Jane failed to make a positive impression at her new job."}
{"text": "Jill was going on a trip to the amazon.", "contrastive": "Former top-level Chinese officials sentenced to over 10 years in jail .", "similar": "Jill is taking a trip to the Amazon."}
{"text": "She arrived after a flight from the US.", "contrastive": "Two years later he met his now-wife Rosanna who helped him with his enormous grief .", "similar": "She arrives in the US after a flight."}
{"text": "Once there she marveled at all the beauty.", "contrastive": "'No one should be fooled by the government's claim that it is undertaking urban planning in the middle of a bloody conflict,' Solvang said.", "similar": "She was amazed by all the beauty as soon as she arrived."}
{"text": "It was dangerous, but exciting.", "contrastive": "the root of who knew what.’ Julie Bailey, whose mother Bella died .", "similar": "The situation was perilous, yet thrilling."}
{"text": "Jill had a wonderful time on her trip to the Amazon.", "contrastive": "Foursquare, the geolocation networking service, grew 3400% in 2010 and reached 10 million users by June 2011.", "similar": "Jill enjoyed a fantastic experience during her journey to the Amazon."}
{"text": "Chris is a defense attorney.", "contrastive": "Sir Andrew’s report also revealed a string of embarrassing facts about the bank, including:* Six in ten loan applications to RBS are ‘screened out’ even before customers formally request a loan, more than in the rest of the industry;* Of those who submit an application, just a third are successful;* The majority of RBS managers admit they only submit an application if they are ‘100 per cent sure’ it will be approved by bosses.", "similar": "Chris becomes a defense attorney."}
{"text": "He has a client that he must defend in court.", "contrastive": "And to my relief she said, \"OK let's get married and keep our own places\".", "similar": "He has a client to protect in a court of law."}
{"text": "The client is not guilty.", "contrastive": "It is hidden away in the small office of the American Geographical Society .", "similar": "The client is innocent and did not commit any wrongdoing."}
{"text": "Chris does his best to defend his client during his trial.", "contrastive": "But it was the 1995 Cardiff Bay Opera House in Wales -- a commission she won twice, but was thwarted by local politicians -- which nearly ended her career, and helped shape the steely woman who last year was honored by Queen Elizabeth for her services to architecture.", "similar": "Chris defends his client with his best efforts during the trial."}
{"text": "Chris wins the case and the client goes free.", "contrastive": "His killers were found guilty of murder and sentenced to total of 90 years .", "similar": "Chris wins the case, and the client gains their freedom."}
{"text": "Julie was feeling hungry.", "contrastive": "Flight 877 then continued its journey to Kona, Hawaii, where it landed at 1.16am local time.", "similar": "Julie is experiencing hunger."}
{"text": "She thought she would order some Pizza.", "contrastive": "sex scandal swirling around Filner has plunged the city into political .", "similar": "She decides to place an order for some pizza."}
{"text": "Julie order the food through an online website.", "contrastive": "I respect all the people talking about my daughter when she went to London - they either accepted her trip or not,\" Shaherkani said.", "similar": "Julie places an order for food through an online website."}
{"text": "The pizza arrived and Julie tipped the driver.", "contrastive": "The Shenzhen Trade Union Federation announced in 2012 that it would move enterprise trade unions towards direct elections, beginning with 163 factories.", "similar": "The pizza arrives, and Julie rewards the driver with a tip."}
{"text": "Julie went to take a bite of the pizza and it was burnt!", "contrastive": "But Pernambuco is prized by all Brazilians for one thing.", "similar": "Julie tried to take a bite of the pizza, but it turned out to be burnt."}
{"text": "Justin was terrified of dogs.", "contrastive": "One in eight women are diagnosed with the disease, Dr Sally Norton said .", "similar": "Justin had a severe fear of dogs."}
{"text": "His girlfriend had a dog and he wanted to feel comfortable with it.", "contrastive": "UPDATED: .", "similar": "He wanted to become familiar with his girlfriend's dog."}
{"text": "Justin went to therapy to help him get over his fear.", "contrastive": "Former foe Iran is understood to have agreed to talks about how to contain the threat.", "similar": "Justin seeks therapy to overcome his fear."}
{"text": "After a few months of therapy Justin felt better around dogs.", "contrastive": "The 29-year-old is frustrated to be missing England's campaign in Australia and New Zealand after his poor form and a dismal series in Sri Lanka led to him being replaced by Eoin Morgan.", "similar": "Justin's emotional well-being improved significantly after a few months of therapy, and he found comfort in the presence of dogs."}
{"text": "Justin then moved in with his girlfriend and her dog.", "contrastive": "Setting out the scale of the task, .", "similar": "Justin starts living with his girlfriend and her dog."}
{"text": "David was walking down the street when he felt down.", "contrastive": "'It is our firm belief that Lillo Brancato is guilty of the murder of police officer Daniel Enchautequi even though he was only convicted of attempted burglary.", "similar": "David is walking down the street and suddenly feels down."}
{"text": "He stood up and saw that his knee was bleeding.", "contrastive": "'She had massive injuries to her head and there was nothing left of her facial area.", "similar": "He discovers that his knee is bleeding after standing up."}
{"text": "He found a handkerchief in his pants and applied it to the wound.", "contrastive": "the girl in a May message warning her not to tell anyone they were in .", "similar": "He discovers a handkerchief in his pants and uses it to dress the wound."}
{"text": "He hopped to the nearest pharmacy stifling his pain.", "contrastive": "Tottenham advanced to the quarter-finals of the Capital One Cup after beating Brighton 2-0 at White Hart Lane on Wednesday .", "similar": "He rushes to the nearest pharmacy, trying to hide his discomfort."}
{"text": "He then bought some peroxide and bandages to treat his knee.", "contrastive": "Dejan Lovren, Dani Osvaldo, Victor Wanyama and Jay Rodriguez are also looking to leave.", "similar": "He purchases peroxide and bandages to attend to his knee injury."}
{"text": "Nicole wanted to go to a concert in another city.", "contrastive": "10:55 EST, 10 August 2013 .", "similar": "Nicole longed to attend a concert in a different city."}
{"text": "Unfortunately, Nicole could not drive.", "contrastive": "Colin Newey is accused of murdering his cousin Bronwynne Richardson 40 years ago .", "similar": "Nicole is unable to drive."}
{"text": "She asked her cousin to take her to the concert.", "contrastive": "I couldn't believe it when the lights turned green and he just drove off dragged me along the side.'", "similar": "She requests her cousin's assistance in attending the concert."}
{"text": "Her cousin agreed to drive if Naomi bought the tickets.", "contrastive": "'That was amazing.", "similar": "Naomi buys the tickets, and her cousin agrees to drive."}
{"text": "They went to the concert and had a great time.", "contrastive": "The father of Martha Corey-Ochoa, 18, has also revealed his heartbreak at losing his only child on Monday, just hours after helping her move into her dorm at the New York City school.", "similar": "They attended the concert and had a wonderful experience."}
{"text": "I woke from my sleep at around three in the morning.", "contrastive": "The State Department had concealed both documents from the public.", "similar": "I wake up at approximately three in the morning."}
{"text": "I heard a scratching sound coming from inside my closet.", "contrastive": "After the dog was accidentally put down Hallett .", "similar": "The sound of scratching can be heard coming from inside my closet."}
{"text": "I turned the light on beside my bed to investigate.", "contrastive": "Tortured to death: Baby Peter, who was just 17 months when he died .", "similar": "I turn on the light near my bed to examine the situation."}
{"text": "I crept slowly toward the closet.", "contrastive": "'I .", "similar": "I approached the closet cautiously, taking my time."}
{"text": "My little brother jumped out of the closet, scaring me to death.", "contrastive": "Fumes from your new car created from soup of harmful chemicals .", "similar": "My little brother suddenly emerged from the closet, terrifying me."}
{"text": "Ken put a bottle of beer in the freezer.", "contrastive": "addition to studying fly-away lunar dust, LADEE will probe the tenuous .", "similar": "Ken places a bottle of beer in the freezer."}
{"text": "He heard a popping noise.", "contrastive": "They appeared together to talk about their experiences on Katie Couric's talk show on Monday.", "similar": "He heard a sudden, sharp sound."}
{"text": "He looked in the freezer and saw the bottle had burst.", "contrastive": "‘As with all crimes, we assess each of these types of incidents that come into us and from that, we decide whether there is a realistic chance of being able to solve the crime with the evidence available.’", "similar": "He checks the freezer and finds that the bottle has exploded."}
{"text": "He didn't want to wait for another beer to get cold.", "contrastive": "Saved: Louis Currie, 12, (pictured left with his mother, Sarah) could have died in the attack by the dog but for the bravery of Stewart McGuinness (right), 45 (pictured right with the vacuum cleaner he used to fend off the dog) But he was helped to safety and the emergency services were called.", "similar": "He preferred to drink another beer now, rather than waiting for it to get cold."}
{"text": "He drank a warm beer instead.", "contrastive": "Scroll down for video .", "similar": "He opted for a warm beer instead."}
{"text": "Christmas was Tyler's favorite holiday.", "contrastive": "As well as ghostly figures and phantom sounds, Olive once found mutilated cats in her kitchen.", "similar": "Tyler particularly enjoys celebrating Christmas."}
{"text": "On Christmas morning he ran downstairs to the tree.", "contrastive": "Writing in a . medical journal published by the respected Lancet group, the medics .", "similar": "He rushes downstairs to the Christmas tree on the morning of the holiday."}
{"text": "Tyler saw so many presents and could not wait to open them.", "contrastive": "A boy in China born with a malfunctioning liver is now looking forward to living a normal life after both of his parents donated part of their organs to save him.", "similar": "Tyler sees numerous gifts and is eager to unwrap them."}
{"text": "By the time his parents woke up, Tyler had opened all his presents!", "contrastive": "Cazorla and Ramsey look apprehensive as they await Welbeck to try and park the smaller car .", "similar": "By the time his parents awoke, Tyler had unwrapped all his gifts before they even knew."}
{"text": "Tyler showed his parents everything Santa Claus gave him.", "contrastive": "... A couple of our players were able to take pictures of the car and the license plate.", "similar": "Tyler exhibits the gifts he received from Santa Claus to his parents."}
{"text": "Wendy was working at her local fast food establishment.", "contrastive": "And I think golf completely suits their mentality and style and their physical abilities,\" he said.", "similar": "Wendy works at her local fast food restaurant."}
{"text": "She pretty much hated her Job.", "contrastive": "Everyone has a tragedy of some sort in their life, but when you lose a loved one, you never get over it.", "similar": "She has a strong dislike for her job."}
{"text": "Wendy was having a rough day and her employees were annoying her.", "contrastive": "It was only then that the family learned that he had been the father to little Carlton and Sarah.", "similar": "Wendy had a difficult day, and her employees made it even more frustrating."}
{"text": "The cook decided to defy her orders when she said go clean the trash.", "contrastive": "Corporate lethargy, no doubt.", "similar": "The cook chose to disregard her instructions when told to clean the trash."}
{"text": "Wendy flew off the handle and fired him on the spot.", "contrastive": "surgery' and once over, she could finally be able to concentrate fully .", "similar": "Wendy loses her temper, and she immediately terminates his employment."}
{"text": "Walter was worried because his dog was showing a lot of aggression.", "contrastive": "Once settled into one of 25 rosewood villas, guests can take guided hikes through the tropical forest, snorkel, mountain bike or even water-ski.", "similar": "Walter is concerned because his dog exhibits a great deal of aggression."}
{"text": "The dog recently began snapping at other dogs and even people.", "contrastive": "The move to upgrade and unify Facebook's mobile Web experience also will streamline Web development for Facebook.", "similar": "The dog started exhibiting aggressive behavior towards other dogs and humans."}
{"text": "Walter consulted with his veterinarian.", "contrastive": "But he described David Cameron as 'the most pleasant man' who has 'done a good job' His estate would be exempt from inheritance tax if he leaves everything to his third wife, former Miss World Wilnelia Merced, 57, who is the mother of his only son, JJ .", "similar": "Walter seeks advice from his veterinarian."}
{"text": "The vet discovered that the dog was suffering a flea infestation.", "contrastive": "A tally of total bombs dropped is shown in the bottom right-hand corner of the video, pictured, along with a tally that shows how many bombs each individual country has used .", "similar": "The vet finds that the dog is infested with fleas."}
{"text": "Some medication got rid of the fleas and the dog's bad mood, too.", "contrastive": "And I wanted to clear the air just being saying that I'm a good person.\"", "similar": "The medication not only eliminated the fleas but also lifted the dog's bad mood."}
{"text": "The couple took a romantic trip to the lake.", "contrastive": "There are many theories but no simple explanation .", "similar": "The couple goes on a romantic vacation to the lake."}
{"text": "They stayed in a nice cabin by the water.", "contrastive": "Current questions range from, 'Have You Ever Slept Your Way Into (or Out of) Something?'", "similar": "They reside in a comfortable cabin near a water body."}
{"text": "They went boating and relaxed in the hammock.", "contrastive": "Sometimes, migrations attract predators, as with the sardine run in South Africa.", "similar": "They went boating and took it easy in the hammock."}
{"text": "They were happy to reconnect with each other.", "contrastive": "By .", "similar": "They are overjoyed to be reunited with one another."}
{"text": "When they returned home, they decided to buy a lake house.", "contrastive": "The International Atomic Energy Agency, the U.N. nuclear watchdog, has reported that Iran is cooperating with inspectors by providing access to declared nuclear material, documents and facilities.", "similar": "When they get back home, they opt to purchase a lake house."}
{"text": "The family planned their first trip to Universal Studios.", "contrastive": "Luxury hotel: A night at The Apartment at the Cannaught, in at 10th place, costs £14,000 .", "similar": "The family makes arrangements for their initial visit to Universal Studios."}
{"text": "They were excited to go on all the rides.", "contrastive": "Gift for bridesmaid, gold necklace    £35 .", "similar": "They are looking forward to experiencing all the attractions."}
{"text": "They saw a lot of the characters.", "contrastive": "He kept zebras as pets in English countryside, says they behaved like dogs .", "similar": "They had a glimpse of many characters."}
{"text": "They spent three days in the park.", "contrastive": "Visitors can take a self-guided tour of the main rooms, or a ranger-led foray into creepily named niches such as the Hall of the White Giant, the Rookery and Spider Cave.", "similar": "They take a three-day break in the park."}
{"text": "They were sad to come home.", "contrastive": "Honour .", "similar": "They return home with a sorrowful mood."}
{"text": "I went to a restaurant.", "contrastive": "But the 2CV has now, most definitely, had the last laugh.", "similar": "I dined at a restaurant."}
{"text": "I ordered fries.", "contrastive": "How .", "similar": "I buy a plate of fried potatoes."}
{"text": "They put ketchup on the fries.", "contrastive": "Seoul .", "similar": "They add ketchup to the fries."}
{"text": "I was furious at the awful site.", "contrastive": "The Canidrome in Macau where many Australian dogs compete.", "similar": "I was enraged by the terrible website."}
{"text": "After complaining, I was given delicious, ketchup free fries.", "contrastive": "The Department of Education is coordinating with Justice officials, a spokesman told CNN.", "similar": "After complaining, I received a tasty, ketchup-free serving of fries."}
{"text": "The woman decided to start a new hobby.", "contrastive": "Celebrity patients: The £10,000-a-week centre treated Take That star Mark Owen and singer Amy WInehouse .", "similar": "The woman chooses to engage in a new pastime."}
{"text": "She went to the craft store and picked out some supplies.", "contrastive": "‘Perhaps their countless hours of studio time together exposed each rapper’s vocabulary to one another,’ explained Daniels.", "similar": "She visits a craft store, acquiring some necessary supplies."}
{"text": "She went home and created an amazing masterpiece.", "contrastive": "SWEETHEART CABBAGE SALAD .", "similar": "She returns home, where she crafts a remarkable work of art."}
{"text": "She was very proud of her work.", "contrastive": "The Very Reverend Adrian Dorber, Dean of Lichfield, said: 'Stephen's vigil will allow a period for people to come in and pay their respects.", "similar": "She feels a strong sense of pride in her work."}
{"text": "She displayed it in her kitchen.", "contrastive": "\"It is contrary to our fundamental values of equality, opportunity, and inclusion.", "similar": "She exhibits the item in her kitchen."}
{"text": "James had always wanted to try out for a sport at his school.", "contrastive": "Former Victoria's Secret Angel Marisa Miller is expecting her first child.", "similar": "James has always desired to participate in a school sport."}
{"text": "He decided he would try out for football.", "contrastive": "Jonathan Lighter: World War I brought slew of new words into use to express the turbulent time .", "similar": "He decides to give football a shot."}
{"text": "James exercised every day to be ready to try out.", "contrastive": "Dianna Westgarth said the price of her house had dropped by 70 per cent .", "similar": "James engages in daily physical activity to prepare for a tryout."}
{"text": "After trying out, James was accepted onto the team.", "contrastive": "Supporters said the law was established to protect clinic staff and patients from what they said was harassment and intimidation from protesters.", "similar": "James makes it onto the team after trying out."}
{"text": "James was glad to be playing a sport at school.", "contrastive": "Manning waves to the crowd as he runs off the field after the game against the San Francisco 49ers .", "similar": "James is happy to participate in a sport at his school."}
{"text": "Josie wanted to win an important race at school.", "contrastive": "A few good performances, but overall the film feels lifeless .", "similar": "Josie aimed to be the winner of the important school race."}
{"text": "She woke up early for a week to practice in the park.", "contrastive": "CNN iReport asked independents why they refuse to align with a party .", "similar": "She practices in the park for a week, waking up early every day."}
{"text": "She also hired a coach to train with him after school.", "contrastive": "Jim Soar, 53, suffers from cluster headaches .", "similar": "She hired a coach to train with him after school, and they work together regularly."}
{"text": "When the race event started she was really nervous.", "contrastive": "My friends tried to help me and it took about ten seconds in total.", "similar": "She was very nervous as the race event began."}
{"text": "But all her hard work paid off and she made it to third place easily.", "contrastive": "250kW turbine that fed power directly into the National Grid.", "similar": "Her efforts were successful, and she placed third without much difficulty."}
{"text": "Kayla parked her car in front of the convenience store.", "contrastive": "He is a perfect miniature of his mum.'", "similar": "Kayla parked her car at the entrance of a nearby convenience store."}
{"text": "She got out of the car, and began to walk towards the store.", "contrastive": "VIDEO Scroll down for Maverick, master or madman... who is Louis van Gaal?", "similar": "She leaves the car and walks towards the store."}
{"text": "Suddenly, she got hit in the head with an egg.", "contrastive": "Darren Fletcher made 12 appearances last season after recovering from a bowel condition .", "similar": "She is suddenly struck on the head with an egg."}
{"text": "She looked up and saw teenagers on top of the store.", "contrastive": "'Motherhood is beautiful AND it can make you better!'", "similar": "She glanced up and noticed teenagers perched atop the store."}
{"text": "The teenagers ran away, and Kayla was left with an egg on her head.", "contrastive": "He was a smart kid as well which made it really dangerous.", "similar": "Kayla is left with an egg on her head after the teenagers run away."}
{"text": "A police officer got a new patrol route.", "contrastive": "A witness described seeing 15 police officers, wearing gas masks and white boots, enter a property before seeing a woman and two children taken out and put into a van, with a man was placed in a separate van.", "similar": "The police officer is assigned a new patrol route."}
{"text": "He wasn't familiar with the neighborhood.", "contrastive": "Pelosi on Boxer retirement: 'What?'", "similar": "He didn't know the neighborhood well."}
{"text": "He spent a lot of time familiarizing himself with the street names.", "contrastive": "A third said that if the Election produced a Miliband-Sturgeon pact to run Britain, they would regard the result as ‘illegitimate’.", "similar": "He learns the street names, spending a considerable amount of time doing so."}
{"text": "SOon he got to know everyone in the neighborhood.", "contrastive": "Meanwhile, the newspaper said former Beatles drummer Ringo Starr's Surrey estate was transferred into a company in Jersey three years ago and the late George Harrison's Oxfordshire home was transferred to a company on the same island in 2005.", "similar": "He soon became acquainted with everyone in the neighborhood."}
{"text": "He was beginning to feel at home.", "contrastive": "'I want the death penalty brought back for people like my father.", "similar": "He starts to feel comfortable in his new surroundings."}
{"text": "Mikey has a habit of taking items that don't belong to him.", "contrastive": "Helpless: The sweat lodge set up by James Arthur Ray that killed three people and injured 18 others can be seen on the bottom left of this shot of the Angel Valley Retreat Center, near Sedona, Arizona .", "similar": "Mikey has a tendency to steal things that aren't his."}
{"text": "Last night he stole a trailer from Henry's yard.", "contrastive": "The young woman's father, Roland, seems  concerned with this happening to other young woman in the area.", "similar": "He stole a trailer belonging to Henry from his yard the previous night."}
{"text": "Henry has a camera in his yard and caught Mikey on tape.", "contrastive": "Marks & Spencer staff even have dubbed their new premium babywear range the ‘Prince George Collection’, while Johnnie Boden, the founder of the eponymous mail order brand, told The Mail on Sunday that his firm has ‘a Royal baby-inspired’ collection launching in March.", "similar": "Henry captures footage of Mikey with his camera in his yard."}
{"text": "The cops were called and took Mikey to jail.", "contrastive": "Nationally, corporate cash donations are down by about $1.5 million over last year .", "similar": "The police arrived, and Mikey was taken to custody."}
{"text": "Mikey is now sitting in a cell thinking about his actions.", "contrastive": "Both the flight data recorder and the cockpit flight recorder are expected to help investigators understand what went wrong.", "similar": "Mikey is currently imprisoned and is contemplating his past decisions."}
{"text": "Roger was hungry.", "contrastive": "By .", "similar": "Roger felt a strong desire for food."}
{"text": "He checked the fridge.", "contrastive": "An autopsy found that Dallas Cowboys practice squad player Jerry Brown Jr was sober when he was killed.", "similar": "He opens the fridge to see what's inside."}
{"text": "The fridge was empty.", "contrastive": "Goal: A Ayew 14 (pen) Senegal (3-4-1-2): Coundoul, Sane, Kara Mbodji, Djilobodji (Gassama 45), Badji, Gueye, Kouyate, Diop (Saivet 85), Souare, N'Doye, (Sow 79), Diouf .", "similar": "The fridge has no food."}
{"text": "Roger went to the store.", "contrastive": "Every minute of journey will be streamed on his official Facebook page .", "similar": "Roger visits the store."}
{"text": "He came home with lots of food.", "contrastive": "There are some obscure lyrics to the children's songs we all know and love .", "similar": "He returns home with a large quantity of food."}
{"text": "Bob stared in disbelief at the flooded basement.", "contrastive": "'One of them was stepping on my neck and my face.", "similar": "Bob stands in shock, gazing at the flooded basement."}
{"text": "All that could be seen were the stone arches above the doors.", "contrastive": "Women in the audience immediately and loudly protested his speech .", "similar": "What was visible were the stone arches above the doors."}
{"text": "The plumber told him it flooded because the sump pump was off.", "contrastive": "Other Sony secrets revealed in the hack, was the company's plans for a Ghostbusters remake, the entire script for the new James Bond movie and the salaries for actors like James Franco and Seth Rogen.", "similar": "The plumber explained that the flooding occurred because the sump pump had not been turned on."}
{"text": "Bob understood that was because the electricity had also been off.", "contrastive": "with the idea of Just Love Safe as we wanted to send a clear message .", "similar": "The reason Bob understood was that the electricity was also out."}
{"text": "He enabled the electricity and the pump drained the flooded basement.", "contrastive": "Former undercover officer claimed he was ordered to find 'dirt' on the Lawrence family and those campaigning for justice for the murdered teen .", "similar": "He turned on the electricity, and the pump removes the water from the flooded basement."}
{"text": "Oscar decided that he no longer wanted to be out of shape.", "contrastive": "One of the powerful beasts came hurtling towards Mr Mayne and threw him into the air as hundreds of spectators watched on.", "similar": "Oscar chooses to improve his physical fitness."}
{"text": "He decided to start running outside every day.", "contrastive": "Crime: Bradford postcode BD12, around five miles away from Leeds, took second place in the table .", "similar": "He begins to run outdoors daily."}
{"text": "At first he found it very difficult.", "contrastive": "The photo album changes were brought in yesterday in the U.S. but it is unclear when the new feature will arrive in Britain .", "similar": "He initially struggled with it."}
{"text": "However, over time, Oscar began to enjoy running.", "contrastive": "In an explicit video, Quaid's wife Evgina sits on the bed in a bikini while the 64-year-old actor, who is sporting a long white beard, launches a diatribe against Warner Bros and News Corp.", "similar": "Oscar develops a taste for running as time passes."}
{"text": "He was glad to be getting in shape.", "contrastive": "James Holmes, who identified himself to police as \"the Joker,\" made his first court appearance on Monday and will be formally charged July 30.", "similar": "He is happy about his efforts to improve his physical fitness."}
{"text": "Jill went to the doctor for her annual exam.", "contrastive": "Eric Brisley has been denied home insurance because of a flood risk despite living 250ft above sea on a hillside .", "similar": "Jill has a check-up at the doctor's office for her annual medical examination."}
{"text": "A lump was found on her breast and she needed more testing.", "contrastive": "to entertain between 200 and 250 of the radio station's staff, before .", "similar": "A tumor is discovered on her breast, requiring further examination."}
{"text": "She went to a follow up appointment and it was confirmed as cancer.", "contrastive": "NBC and CBS tied for second; both got 53.", "similar": "She attends a follow-up appointment, and it is confirmed that she has cancer."}
{"text": "Jill went through several rounds of chemotherapy.", "contrastive": "mean saying yes to many more patients, .", "similar": "Jill undergoes multiple rounds of chemotherapy."}
{"text": "Fortunately, she had no signs of cancer following her treatment.", "contrastive": "(CNN) -- A little over a week ago nearly every media outlet was fixated on Tiger Woods and his apology news conference.", "similar": "She did not display any cancer symptoms after her treatment."}
{"text": "Jasmine had homework to do.", "contrastive": "Connie Fleming is described by US transgender website QUEENMother.TVas 'a living doll, a multi-talented lady with a promising .", "similar": "Jasmine has homework to complete."}
{"text": "She did not have a pencil.", "contrastive": "Olive Stevens, the mother of actor Michael Fenton Stevens (pictured together) died after being hit by her own car in a bizarre accident caused by fly-tippers near her home in Orpington, Kent .", "similar": "She lacked a pencil."}
{"text": "She looked around the room for one.", "contrastive": "He went 664-611 with the Rangers, earning more wins than any manager in club history.", "similar": "She searches the room for someone."}
{"text": "The room did not have a pencil.", "contrastive": "In Maricopa County, which includes Phoenix, Sheriff Joe Arpaio has long been an advocate of tough measures against illegal immigration.", "similar": "The room lacked a pencil."}
{"text": "Jasmine decided not to do her homework.", "contrastive": "\"Good news, Mr. Curry,\" he says.", "similar": "Jasmine chooses not to complete her homework."}
{"text": "Marc always had perfect attendance at school.", "contrastive": "All clubs taking part in UEFA's competitions for the 2012/2013 season had to provide Europe's governing body with details of any \"overdue payables\" by the end of June.", "similar": "Marc never missed a day of school."}
{"text": "One day, he stopped coming to class.", "contrastive": "On another forum, one member chillingly asks advice on how to ‘properly rape a woman’ without leaving any evidence.", "similar": "He ceases to attend classes one day."}
{"text": "Everyone was worried about him!", "contrastive": "The program also features insight from a family in Britain raising their child as gender-neutral.", "similar": "They were all anxious about him."}
{"text": "He came back a few days later.", "contrastive": "As for Princess Margaret’s visit backstage with the Stones, this emerged in a scurrilous biography of the Queen’s sister in which it was alleged she was invited by Mick Jagger to a Stones concert at Earls Court and partook of the drug with them in their dressing rooms before the concert, watched by 23,000 people, had begun.", "similar": "He returns a few days after the initial departure."}
{"text": "He had been in bed with the flu.", "contrastive": "She has been with the school only five months and her job is not protected under contract, he said.", "similar": "He had been in bed with the flu, struggling with the illness."}
{"text": "Joe was really excited for Christmas.", "contrastive": "JTS says it is operating on a not-for-profit basis, with any excess funds to be spent on the tourism library at the college.", "similar": "Joe is extremely enthusiastic about Christmas."}
{"text": "Joe has never seen Santa Claus before.", "contrastive": "They were discussing the crisis in Syria and became violent when they disagreed .", "similar": "Joe has never encountered Santa Claus before."}
{"text": "He decided to hide on top of the staircase to try to catch Santa.", "contrastive": "It represents a shift to what she called \"authentic identity,\" from the wisdom of the crowd to \"wisdom of our friends.\"", "similar": "He decides to conceal himself at the top of the staircase in an effort to capture Santa."}
{"text": "Joe waited as long as he could before he fell asleep.", "contrastive": "‘I .", "similar": "Joe waited until he was too tired to stay awake, then he fell asleep."}
{"text": "He woke up to many presents under the tree, and no Santa in sight!", "contrastive": "David Cameron has revealed plans to cut short appeals by illegal immigrants and terror suspects in the wake of the Abu Hamza fiasco.", "similar": "He finds a pile of gifts under the tree, but there is no sign of Santa when he wakes up!"}
{"text": "Anna went to pick apples.", "contrastive": "A tribal leader involved in mediation says the couple is going through depression .", "similar": "Anna goes to harvest apples."}
{"text": "She tried to pluck the low-hanging fruits.", "contrastive": "Scroll down for video .", "similar": "She attempts to pick the easily accessible opportunities."}
{"text": "But she could reach very few.", "contrastive": "it provides to BT and O2.", "similar": "She is able to connect with very few."}
{"text": "At the end of the trip, she had only ten apples.", "contrastive": "this was first raised with me I was pretty disparaging.", "similar": "By the time the trip ended, she had a remaining supply of only ten apples."}
{"text": "Anna wished she had been able to reach more apples!", "contrastive": "Alberto Nunez Feijoo, head of the regional government in Galicia, declared seven days of mourning in the region for victims of the tragedy.", "similar": "Anna regrets not being able to grasp more apples."}
{"text": "Bob bought a new manufactured home in Montana.", "contrastive": "The Cuyahoga County sheriff's department is investigating the shooting.", "similar": "Bob purchases a newly constructed residential property in Montana."}
{"text": "He was sad he didn't have any land to grow a garden on.", "contrastive": "By .", "similar": "He is unhappy because he lacks a plot of land to cultivate a garden."}
{"text": "One of his neighbors told him he could vegetables in tires.", "contrastive": "Matt Chorley, Mailonline Political Editor and James Chapman .", "similar": "His neighbor suggested that he grow vegetables in tires."}
{"text": "Bob tried it and was astounded when it worked.", "contrastive": "detached home in Watlington, Oxfordshire, in the early hours of June 8.", "similar": "Bob tried it, and he was amazed that it functioned."}
{"text": "He's very proud of his tire grown tomatoes and corn.", "contrastive": "been endorsed by Central Saint Martins.", "similar": "He's very proud of his tomato and corn harvest."}
{"text": "The candidates were running a tight campaign.", "contrastive": "The classic Mini bonnet stripes are three-dimensionally embossed and run on into high-quality polished aluminum accents.", "similar": "The candidates were running a highly competitive election campaign."}
{"text": "The latest poll said they were tied.", "contrastive": "UPDATED: .", "similar": "The latest poll reveals that the two sides are evenly matched."}
{"text": "The Republican candidate focused on radio ads.", "contrastive": "‘It’s hard to describe how I feel.", "similar": "The Republican candidate emphasizes his message through radio advertisements."}
{"text": "The Democrat focused on TV.", "contrastive": "Chris Moran, defending, said Easterby’s actions had been committed out of embarrassment.", "similar": "The Democrat concentrated on television."}
{"text": "They fought for every vote they could grab.", "contrastive": "Angel Aguirre gave no details about the DNA of the 28 bodies that were uncovered in clandestine graves last week .", "similar": "They engage in a fierce battle for every available vote."}
{"text": "Johnnie got dragged to the ballet because his sister wanted to go.", "contrastive": "this year, he quickly arranged lucrative deals with the Weinstein Co. for a feature film, the producers of 'American Masters' for TV rights .", "similar": "Johnnie attends the ballet against his will because his sister wanted to go."}
{"text": "He was dreading how boring it would be.", "contrastive": "The five men who died alongside Cpl Aston, from Swadlincote, Derbyshire, were Lance Corporal Thomas Keys, Sergeant Simon Hamilton-Jewell, Corporal Simon Miller, Lance Corporal Ben Hyde and Corporal Paul Long.", "similar": "He is anticipating a dull experience."}
{"text": "He was already bored when the lights were dimmed.", "contrastive": "'I voted for independence because I've always felt very Catalan,' said Nuria Silvestre, a 44-year-old teacher.", "similar": "He was already disinterested when the lights were turned down."}
{"text": "Then when the dancers started he got into it.", "contrastive": "Frightened he wouldn't be able to perform, Mr Bobbitt was relieved to discover he was still capable of having sex; it 'wasn't 100 per cent, but we did OK,' he said.", "similar": "He became fully engaged when the dancers began to perform."}
{"text": "He was sad when it ended.", "contrastive": "Gov.", "similar": "He felt sorrow when it came to an end."}
{"text": "Dan had always wanted to participate in a marathon.", "contrastive": "On CCTV footage, he can be seen paying particular attention to a girl of about nine as she walks past and watching a children’s swimming pool through a window.", "similar": "Dan longs to take part in a marathon."}
{"text": "However he was scared that it would be very difficult.", "contrastive": "Obama focused on the three priorities of the budget he will present to Congress later this week: energy, health care and education.", "similar": "He is apprehensive that the task will be extremely challenging."}
{"text": "He decided to practice until he felt stronger.", "contrastive": "But many parents were left fuming over explicit sexual references in sketches broadcast before 8pm.", "similar": "He continues to practice until he feels stronger."}
{"text": "Finally he was prepared to participate in a marathon.", "contrastive": "- Dyffryn Estate dates back to 640 A.D when the Manor of Worlton was granted to Bishop Oudoceus of Llandaff.", "similar": "After much preparation, he is ready to run a marathon."}
{"text": "Dan was glad that he was finally going to run a marathon.", "contrastive": "Also at the national memorial service in Johannesburg's FNB Stadium are Deputy Prime Minister Nick Clegg and Leader of the Opposition Ed Miliband.", "similar": "Dan is thrilled that he is about to complete a marathon."}
{"text": "Bill's wife, Carly, warned him that it would rain today.", "contrastive": "Her evidence showed he had changed, he was doing things out of character, he was drinking too much and was brusque to her to the point of being rude.", "similar": "Bill's wife Carly warns him that it's going to rain today."}
{"text": "Bill disregarded this, and began mowing the lawn.", "contrastive": "What to know about the killer disease .", "similar": "Bill ignores this and starts mowing the lawn."}
{"text": "Within minutes, rain began pouring down on Billy.", "contrastive": "Last updated at 10:13 AM on 3rd November 2011 .", "similar": "Rain started falling heavily on Billy within a matter of minutes."}
{"text": "Billy hurried to get the tools inside the shed and went in the house.", "contrastive": "It was also one of the seven sacred trees in Celtic tradition and was used by the Druids for prophecy.", "similar": "Billy rushes to gather the tools from the shed and then heads into the house."}
{"text": "Carly was there, giving Billy the look that says I told you so.", "contrastive": "\"It doesn't bring them back.", "similar": "Carly was present, conveying a look that clearly indicated \"I told you so\" to Billy."}
{"text": "Joe rented a movie from one of the last rental stores.", "contrastive": "Attorneys for Strauss-Kahn said they had a \"constructive meeting\" with prosecutors .", "similar": "Joe borrows a movie from one of the final video rental shops."}
{"text": "He had it for five days so he was going to keep it that long.", "contrastive": "Tonight's awards aim to celebrate outstanding achievement in the field of African conservation .", "similar": "He held onto it for five days, intending to keep it that long."}
{"text": "At the end of the fifth day he decided to take it back.", "contrastive": "Vital: Chelsea stars Gary Cahill (left) and Frank Lampard celebrate winning at Anfield .", "similar": "He decides to take it back on the fifth day."}
{"text": "The store closed early that night.", "contrastive": "Camping: Parents had been camping out at the school over the weekend to secure a place .", "similar": "The store closed prematurely that evening."}
{"text": "Joe now has to pay a ten dollar late fee on a five dollar movie.", "contrastive": "'I feel bad about the whole thing and like I just don't want to do it anymore.'", "similar": "Joe must pay an additional five dollars as a late fee on the initial five-dollar movie."}
{"text": "Janet loved to pet her neighbor's dog.", "contrastive": "The 25-year-old goalkeeper cemented the interest of Arsene Wenger after impressive performances for Colombia as they reached the quarter finals at the World Cup.", "similar": "Janet had a fondness for stroking her neighbor's canine companion."}
{"text": "She was told the dog had puppies a few weeks ago.", "contrastive": "Shoppers using the high street or online stores will have a ‘no quibble’ right to return a faulty item and get a refund within 30 days.", "similar": "She was informed that the dog gave birth to puppies a few weeks prior."}
{"text": "Janet was very excited to see them.", "contrastive": "\"Argo,\" directed by Ben Affleck, who also played the lead role, is about the rescue of U.S. diplomats during the Iran hostage crisis.", "similar": "Janet was thrilled to encounter them."}
{"text": "She begged her parents to let her have a puppy.", "contrastive": "legal chief Tom Crone have told MPs the email was the sole reason for .", "similar": "She implores her parents to grant her permission to have a pet puppy."}
{"text": "Janet was very happy when she walked back to her house with a puppy.", "contrastive": "Branislav Ivanovic, Chelsea - April 2013 .", "similar": "Janet is overjoyed as she returns home with a new furry companion."}
{"text": "When Shawn was growing up he collected beanie babies.", "contrastive": "Friday.", "similar": "Shawn collected beanie babies during his childhood."}
{"text": "He had hundreds of them.", "contrastive": "Questionable judgement: Baugh was heavily criticized earlier this year for sentencing teacher Stacey Dean Rambold (left) to just 30-days prison for raping his student Cherice Morales (right) who later committed suicide .", "similar": "He had a large quantity of them."}
{"text": "He was convinced that they would be worth a lot of money.", "contrastive": "The logic was that they needed to make an example of him to other players to demonstrate that his behaviour was not acceptable.", "similar": "He believed they would be highly valuable."}
{"text": "He kept them for almost twenty years before realizing he was wrong.", "contrastive": "We're more interested in his skincare routine.", "similar": "He held onto them for nearly two decades, only to discover his initial assumption was incorrect."}
{"text": "He is now just a grown man with hundreds of stuffed animals.", "contrastive": "Mr McGuinness admitted his IRA past to the Saville Inquiry in 1998, . but has always insisted he never killed anyone – claims that have been .", "similar": "He has grown up to be a man with a large collection of stuffed animals."}
{"text": "Jasmin got pregnant during her senior year of high school.", "contrastive": "It took just two days and a small collection of everyday household items for a group of German hackers to bypass the fingerprint sensor on an Apple iPhone 5S.", "similar": "Jasmin became pregnant during her senior year of high school."}
{"text": "She was very worried that her life would be ruined.", "contrastive": "The woman was on board a Transaero flight heading towards a city in Russia, around 1,100 miles east of Moscow, when she noticed the fire coming from the plane's wing.", "similar": "She is greatly concerned that her life will be destroyed."}
{"text": "She had her baby after graduation.", "contrastive": "Paul's minority outreach efforts have certainly earned him plenty of media attention and accolades by some in African-American communities, but others say it's not enough.", "similar": "She gives birth to her child after completing her education."}
{"text": "She was still able to go to college to pursue her education.", "contrastive": "Last night Mr Farage told the BBC that if he stood and won Mr Cameron would 'have to resign' but if he lost Ukip would be finished: 'The bubble is burst.'", "similar": "She completes her education by attending college."}
{"text": "As soon as she graduated, she landed her dream job!", "contrastive": "As the researchers discovered, mosh pits have the same statistical character, and hence the analogy.'", "similar": "Immediately after graduating, she secures her ideal employment."}
{"text": "Randy had recently separated from his wife.", "contrastive": "Wing Cdr Daulby said: 'It just shows you the dangers of pulling the military down.'", "similar": "Randy and his wife had recently gone their separate ways."}
{"text": "He felt very lonely and sad all the time.", "contrastive": "The Pearson report also outlined plans for a new generation of tougher A-levels, which ‘set the bar higher’ with longer, essay-style questions.", "similar": "He experiences constant loneliness and sadness."}
{"text": "He considered trying to patch things up with Vera, his ex-wife.", "contrastive": "in the highest at risk category and 36 per cent of women found to be in .", "similar": "He thinks about reconciling with Vera, his former spouse."}
{"text": "He decided to get a puppy instead.", "contrastive": "Goalscorer Dyer looks back having been dispossessed by Everton midfielder Darron Gibson .", "similar": "He chooses a puppy over other options."}
{"text": "His decision made him happy and he no longer felt sad.", "contrastive": "'We bitterly regret my mum ever allowed doctors to persuade her having weight loss surgery was the answer to her obesity problem.'", "similar": "His decision brings him joy, and he ceases to feel sad."}
{"text": "Tim needed to take a large test to graduate from high school.", "contrastive": "He also claimed that people in rural areas were 'travelling very minor roads … with very little traffic' and 'have never killed anyone.'", "similar": "Tim must take a major test to earn his high school diploma."}
{"text": "He was confident he would pass.", "contrastive": "Yet against all the odds and after the key development of working with renowned sports psychologist Steve Peters, Trott is back and will compete with Adam Lyth to become Alastair Cook's opening partner in the three-Test series.", "similar": "He is sure of passing the exam."}
{"text": "However, Tim never studied for tests, including this one!", "contrastive": "UPDATED: .", "similar": "Despite Tim's lack of preparation, this test was also neglected."}
{"text": "Tim guessed all the answers, failed the test, and did not graduate.", "contrastive": "'They actually take out a lot of the stuff that they showed on TV,' said Justin Dearinger, whose Toyota Rav4 was given 'pop-up champagne contraption' and a 'drive in theater' - both of which were taken out when the episode wrapped.", "similar": "Tim correctly answers all the questions, but ultimately does not pass the test and fail to graduate."}
{"text": "Tim learned that studying is important.", "contrastive": "Floodwaters have washed away critical roads and bridges throughout the country, but especially in the mountainous areas of Gilgit Baltistan and Pakistani-administered Kashmir, and in the Swat Valley of Khyber Pakhtunkhwa province.", "similar": "Tim comes to understand that studying is crucial."}
{"text": "Lucy made marinara sauce for her family.", "contrastive": "Forced sterilization came up in a different way in California last year, when Governor Jerry Brown signed a bill that banned state prisons from forcing female inmates to be sterilized.", "similar": "Lucy prepares a marinara sauce for her family."}
{"text": "It took a lot of time and effort.", "contrastive": "Ms Westcott said the allegations had plunged the family into turmoil, and that having the 'hell on her mind 24/7' was affecting her health.", "similar": "This required a significant amount of time and hard work."}
{"text": "They ate it all and said it was great.", "contrastive": "They tried an experimental drug also used for an Arkansas girl, who survived .", "similar": "They consumed the entire portion and described it as excellent."}
{"text": "She finally tried it and it was disgusting.", "contrastive": "Pieces of the building began to collapse as firefighters doused the building with water, according to Mission.", "similar": "She decides to try it, but unfortunately, it is extremely unpalatable."}
{"text": "She was happy they all pretended to like it.", "contrastive": "from Britain.", "similar": "She was pleased that everyone pretended to enjoy it."}
{"text": "Little Charlie and his dad were painting the garage.", "contrastive": "O'Connor says that within an hour, all eight tables were filled and six people were waiting for carryout orders .", "similar": "Charlie and his father paint the garage together."}
{"text": "Charlie had some trouble controlling the brush.", "contrastive": "Beyond clothing and electronic knock-offs, he said, officials are especially worried about the threat to safety and health when counterfeit goods involve such things as air bags, drugs, car batteries and engine parts.", "similar": "Charlie struggled to manage the brush."}
{"text": "His dad turned around and started to laugh.", "contrastive": "AIDS virus will become a routine service at drugstores like blood .", "similar": "His dad turns around and begins to laugh."}
{"text": "Charlie had paint on him from head to toe.", "contrastive": "Roll up for the show: The snow tube left on the windscreen of Paul and Clare Ballard's car .", "similar": "Charlie is completely covered in paint from head to toe."}
{"text": "His dad rinsed him off with water from the hose.", "contrastive": "Chris opened the Park Slope Chip Shop in .", "similar": "He is cleaned with water from the hose by his dad."}
{"text": "Fred was never one for the gym.", "contrastive": "A former clinic employee told NewsChannel 9 that the clinic is connected to William Beaumont by a corridor.", "similar": "Fred never had a taste for working out at the gym."}
{"text": "He was always worried about what he would look like going in there.", "contrastive": "They survived and made it to the final of the FA Cup last time around and are currently five points clear of the relegation zone.", "similar": "He is concerned about how he will appear when entering that place."}
{"text": "One day he decided to go for it.", "contrastive": "about their behaviour; the way they cleaned knives in front of their .", "similar": "He makes up his mind to take the plunge."}
{"text": "It was a great life change for Fred.", "contrastive": "In her opening statement to her confirmation hearing, Kagan sought to address Republican concerns that her background as an academic and policy specialist in the Clinton administration would bring a liberal bias in her court rulings.", "similar": "Fred experiences a significant life alteration."}
{"text": "He started looking better and feeling better, all thanks to the gym.", "contrastive": "Widespread destruction: Revelers rip a tree out of the ground to add it to one of the many fires burning .", "similar": "He improved his physical appearance and overall well-being after joining the gym."}
{"text": "Leah and Kerry went to the beach in December.", "contrastive": "One parent asked:‘What morons do you have working there?", "similar": "Leah and Kerry visit the beach in December."}
{"text": "Kerry put on her bathing suit and waded into the ocean!", "contrastive": "\"I would certainly like to see him in,\" Hank Aaron told reporters at baseball's Hall of Fame festivities.", "similar": "Kerry wears her bathing suit and enters the ocean for a swim."}
{"text": "The water was so cold that Kerry's lips turned turned blue.", "contrastive": "'Anthony Diprose is a muscular individual who put himself up as a cage fighter and used his aggression to intimidate people,' he said.", "similar": "Kerry's lips turned blue because the water was extremely cold."}
{"text": "Leah pulled her from the icy water, saving Kerry from frostbite.", "contrastive": "Disbelief: Christina Morris' mother, Jonni McElroy, says she doesn't understand how Enrique Arochi doesn't have any more information about her daughter's disappearance since he was with her just hours before .", "similar": "Kerry was saved from frostbite by Leah, who pulled her out of the icy water."}
{"text": "Kerry learned not to swim at the beach in cold weather.", "contrastive": "But he added: 'It is clear that you have demonstrated some remorse and offered to pay recompense.'", "similar": "Kerry developed the habit of not swimming at the beach during cold weather."}
{"text": "Eliza needed a new dress for a party.", "contrastive": "Dressed in blue jeans and a grey shirt, the prince, 29, visited the Atlantic Rainforest that surrounds the city of São Paulo to learn about their efforts to preserve the eco system.", "similar": "Eliza requires a new dress for a party."}
{"text": "She went to a department store and looks at their dresses.", "contrastive": "Clinton's 11th-hour support for Obama came with the condition that his wife would have the President's support in 2016.", "similar": "She visits a department store and examines their dresses."}
{"text": "Eliza finds a purple dress that would look great for the party.", "contrastive": "'It may seem silly, but it’s a health issue,' Mrs Peckham told the New Hampshire Union Leader.", "similar": "Eliza discovers a purple dress that would be perfect for the party."}
{"text": "The store does not have the dress in Eliza's size.", "contrastive": "Daily Mail Reporter .", "similar": "The store lacks the dress in Eliza's size."}
{"text": "Eliza is sad that she will have to keep looking for another dress.", "contrastive": "Just before halftime Sporting's Dutch striker Ricky van Wolfswinkel smashed a low shot into the net to edge the away side in front once again.", "similar": "Eliza is disheartened by the prospect of continuing her search for another dress."}
{"text": "Jane walked into the home improvement store, ready to complain.", "contrastive": "Arrested: The men were so drunk the night of the stabbing that it took police six days to conduct their investigation and charge Clarkson with fourth-degree assault .", "similar": "Jane enters the home improvement store, prepared to voice her dissatisfaction."}
{"text": "Her new lawn mower would not crank, so she brought it back.", "contrastive": "A Kentucky mother who was reported missing when she failed to pick up her child from school on Friday was found three days later, locked alive in the trunk of her daughter's car.", "similar": "The new lawn mower fails to start, so she returns it."}
{"text": "She talked to the clerk, who asked for her receipt.", "contrastive": "said of Ms Taubira, who was born in French Guiana: ‘Honestly, she’s a . wild animal, coming on TV with that devil’s smile.", "similar": "She spoke to the clerk, who requested her receipt."}
{"text": "She gave him the receipt, and she exchanged the mower for a new one.", "contrastive": "There .", "similar": "She gives him the receipt, and then replaces the old mower with a new one."}
{"text": "Jane took the new mower home, and it cranked immediately.", "contrastive": "Midsomer Murders, as well as appearing in the new film Red 2.", "similar": "Jane took home the new mower, and it started right away."}
{"text": "The children laughed as it started raining on them.", "contrastive": "Many uninsured Americans are unable to get insurance in the market as it exists today, especially if they have chronic conditions.", "similar": "The children laughed at the sudden onset of rain, which fell on them."}
{"text": "They splashed about and started throwing mud at each other.", "contrastive": "'Lots of people have donated little bits for raffle prizes - it's been great.", "similar": "They play in the mud and engage in a mud fight with each other."}
{"text": "Nora looked aghast through the door and prepared to yell at them.", "contrastive": "Suzannah Hills .", "similar": "Nora's expression turned aghast as she prepared to loudly scold them after opening the door."}
{"text": "She paused when she realized how much ridiculous fun they were having.", "contrastive": "\"Whatever your position is, you can get up and say it,\" Manning explained.", "similar": "She stops when she recognizes the absurd amusement they are experiencing."}
{"text": "Nora decided to laugh at their antics and to join them, instead.", "contrastive": "would crush her.", "similar": "Nora laughs at their antics and decides to join them instead."}
{"text": "Karen's job requires long hours at work.", "contrastive": "'The property stolen is very distinctive,' he said.", "similar": "Karen's job demands extensive time spent at work."}
{"text": "She works upwards of 80 hours per week.", "contrastive": "The dangers of the product are when the baby gets trapped or when the baby suffocates on the inside of the product.", "similar": "She works extremely long hours, exceeding 80 hours a week."}
{"text": "Karen decides that she needs to relax and have some time off.", "contrastive": "Peters had been warned for inappropriate conduct with another pupil .", "similar": "Karen decides to take a break and enjoy some leisure time."}
{"text": "She books a vacation to Mexico.", "contrastive": "House Speaker John Boehner says he won't negotiate legislation with the president .", "similar": "She plans a trip to Mexico."}
{"text": "Karen travels to Mexico and has a very relaxing vacation.", "contrastive": "Based on experience, Martin had ideas about what might have caused Hermanstorfer's cardiac arrest, but nothing was certain.", "similar": "Karen travels to Mexico, where she has a truly relaxing getaway."}
{"text": "The boys were so excited they couldn't even sleep that night.", "contrastive": "The sentence carries a 20 year maximum sentence for anyone who 'unlawfully assaults another who dies as a direct or indirect result of the assault,' said Government's website set up for the introduction of the laws.", "similar": "The boys were extremely thrilled and couldn't sleep that night due to their excitement."}
{"text": "It was Christmas morning and they sprang out of bed.", "contrastive": "He has shown remorse.'", "similar": "On Christmas morning, they suddenly jumped out of bed."}
{"text": "They ran downstairs to the tree.", "contrastive": "portray a ‘whiter than white’ image, he told his co-host: ‘Let me ask .", "similar": "They hurry to the tree by running downstairs."}
{"text": "There it was!", "contrastive": "To illustrate the point of just what the information gathered from a flight data recorder can show, Campbell takes us through a heavy door into the soundproof audio analysis lab and pulls up an animation on a monitor.", "similar": "It was right before our eyes!"}
{"text": "The brand new Go Cart they had wanted.", "contrastive": "Dr Joseph Leija, who's responsible for the Midwest's official daily allergy count at Gottlieb Memorial Hospital in Melrose Park, Illinois, said in a statement that the tree pollen in the area indicates a dangerous air quality warning.", "similar": "They had wanted a brand new Go Cart."}
{"text": "I was listening to the music saved on my phone.", "contrastive": "The loved-up couple managed to snag the spectacular four-bedroom, .", "similar": "I listened to the music stored on my phone."}
{"text": "Since the volume was on the highest setting, I couldn't hear anything.", "contrastive": "Caught red-handed: Bagarozzo throws a handful or quarters into a red bag on the seat of a truck while working his job in Buffalo .", "similar": "Because the volume was turned up to its maximum level, I was unable to hear anything."}
{"text": "My mom tried to call me, but I didn't respond since I didn't hear her.", "contrastive": "The first was last Easter.", "similar": "My mom makes an attempt to contact me, but I fail to acknowledge her because I'm unaware of her call."}
{"text": "When I went to look for my leftover food, it was gone.", "contrastive": "Scroll down for video .", "similar": "When I went to search for my leftover food, it was nowhere to be found."}
{"text": "My mom told me that she ate it.", "contrastive": "Ponzo’s lawyer, John Cunha Jr., also told the jury that Ponzo left Massachusetts because he believed he was on a hit list created by a mobster whose son was shot to death.", "similar": "My mom informed me that she consumed the item."}
{"text": "Jeff needed a big amount of money.", "contrastive": "Family lived in a two-bedroom first floor maisonette in Harrow .", "similar": "Jeff required a significant sum of money."}
{"text": "He had made some bad bets and was down big.", "contrastive": "The new model, which costs £79.99, coincides with ITV's revamped version of the 1960s TV show and will be unveiled today at the Toy Fair in London.", "similar": "He had placed some unsuccessful wagers, and he is significantly in debt."}
{"text": "Jeff decided he had to take extreme gamble.", "contrastive": "Their site will house everything from ginger cat videos to ginger cocktails and recipes, ginger hotties and moustaches, and even a ginger dictionary.", "similar": "Jeff chooses to take a big risk."}
{"text": "Jeff bet all of his life savings on the basketball game.", "contrastive": "WATCH THE VIDEO HERE .", "similar": "Jeff risked his entire life savings on the basketball game."}
{"text": "Jeff won and covered the spread to win it all.", "contrastive": "A . police helicopter was dispatched and a command center set up at a . nearby church around as the neighborhood rallied to find Kelsie.", "similar": "Jeff wins the bet and achieves a perfect score."}
{"text": "John decided he wanted to move to a new state.", "contrastive": "Calls for return to democracy to repair Pakistan's image as terrorist haven .", "similar": "John chooses to relocate to a different state."}
{"text": "Before he could move he needed to sell his house.", "contrastive": "Opinion: Give Morsy a chance to fix this .", "similar": "He had to sell his house before he could make any move."}
{"text": "A buyer offered John a good price for his house.", "contrastive": "By the end of the siege, police had rescued all the remaining 50 civilians held hostage in the hotel, according to Salangi.", "similar": "A buyer offers John a fair price for his house."}
{"text": "John sold the house.", "contrastive": "S*** always does.", "similar": "John sells the house."}
{"text": "He was happy that he could now move to a new state.", "contrastive": "very flattering to be thought of in such high regard by the people in .", "similar": "He is thrilled to relocate to a new state."}
{"text": "Sandy wanted to go clubbing.", "contrastive": "VIDEO Scroll down to watch German players celebrating as they arrive back at hotel .", "similar": "Sandy wishes to attend a nightclub."}
{"text": "She was going to the hottest club in the city.", "contrastive": "The harassment by the Vietnamese side is in violation of China's sovereign rights,\" said Hua Chunying, spokesperson of China's Ministry of Foreign Affairs.", "similar": "She is attending the most popular nightclub in the city."}
{"text": "She got to the club and started to have a few drinks.", "contrastive": "They argue the Koch \"bogeyman\" strategy is helping their candidates and with fund-raising.", "similar": "She arrives at the club, and soon she is having a few drinks."}
{"text": "She saw her ex boyfriend who wanted to come talk to her.", "contrastive": "One demonstrator wore a T-shirt that read, \"Racism isn't over but I'm over racism.\"", "similar": "She encounters her former partner who wishes to converse with her."}
{"text": "He caused a big scene when Sandy Refused.", "contrastive": "experts are investigating which varieties best suit certain .", "similar": "He created a significant commotion when Sandy refused."}
{"text": "Bobby wanted to take his family to the beach.", "contrastive": "The club is known for its glitzy crowd and expensive prices, where the cover charge is regularly $60 and drinks start at around $20.", "similar": "Bobby decides to take his family to the beach."}
{"text": "He planned the itinerary carefully.", "contrastive": "Hooks has also appeared on 'The Simpsons,' 'Futurama,' 'The Martin Short Show,' 'She had a cameo in 1992's 'Batman Returns,' a recurring role as Vicki Dubcek on NBC's '3rd Rock from the Sun' and lent her voice to play Apu's wife Manjula in Fox's hit animated series 'The Simpsons.'", "similar": "He meticulously prepares the plan for the trip."}
{"text": "When it was time to leave, they loaded up the car.", "contrastive": "His story has helped me come out of my shell and given me new purpose and a determination to use whatever strength I have to help others.", "similar": "They pack the car and head out when it's time to depart."}
{"text": "THey spent the next five days relaxing on the sand.", "contrastive": "On both occasions Blake stripped her daughter naked because she said she wanted to check for signs of sexual abuse.", "similar": "They took a five-day break to unwind on the beach."}
{"text": "It was a great family trip!", "contrastive": "got one telephone call from a clerk that was a couple days after it .", "similar": "The family went on an excellent trip."}
{"text": "Jane wanted to become a better artist.", "contrastive": "They will be receiving a full refund of their cruise fare, pre and post cruise packages, air costs, and taxes, fees, and port expenses.", "similar": "Jane aims to improve her artistic skills."}
{"text": "She bought brushes and paint from the art store.", "contrastive": "fiercely oppose the existence of Futenma, and believe the base should .", "similar": "She purchases painting supplies, including brushes and paint, from the art store."}
{"text": "She practiced her painting skills whenever she could.", "contrastive": "According to the tradition, parents put their babies on a mattress at the central square of the small village.", "similar": "She practices painting as often as she can."}
{"text": "The next month, she entered an art contest.", "contrastive": "I want to come home again.", "similar": "She participates in an art competition the following month."}
{"text": "She was excited when her painting won a ribbon.", "contrastive": "What exactly is a beardog?", "similar": "When her painting wins a ribbon, she becomes excited."}
